{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-50th-anniversary-of-a-day-that-shocked-the-world-112213/",
    "podcast": {
      "developer-note": "",
      "length": "56:22",
      "note": "",
      "size": 13528466,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/f6ysm6/GaryNullShow_JFK_JamesDouglass_112213.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "50th Anniversary of a Day That Shocked The World"
  },
  "title": "50th Anniversary of a Day That Shocked The World",
  "date": "2013-11-22 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>JFK Series:  The motivation in the military and intelligence complex for eliminating JFK to continue the US’s war of<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\naggression against CommunismJames Douglas has been leading anti-war and anti-nuclear activist in the tradition of Thomas Merton beginning when he was a professor of religion at the University of Hawaii, a Christian theologian and author of “JFK and the Unspeakable.” This text has been considered by many as the single most authoritative work providing the motivation and historical rationale for the CIA and military industrial complex to eliminate President John Kennedy.  It served as a fundamental resource for Oliver Stone’s film JFK and has been praised by Daniel Ellsberg and doubters of the Warren Commission throughout the JFK research community.<br />\n  In 1975 James founded Ground Zero Center for Nonviolelnt Action to protest the construction of the Trident missile nuclear submarine. <br />\nHe has participated in several peace missions including Iraq.<br />\n  James is a member and co-founder of Religious Leaders for 911 Truth and founder of Mary’s House in Birmingham Alabama which provides services to the homeless community there. <br /></p>\n"
}
