{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-china-053013/",
    "podcast": {
      "developer-note": "",
      "length": "1:07:01",
      "note": "",
      "size": 16085824,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/wzewyd/GaryNullShow053013.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "China"
  },
  "title": "China",
  "date": "2013-05-30 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>A look at China as a growing or failing economic power\nDr.\n&lt;!--more--&gt;\nSteven Leeb is the founder, chairman and chief investment officer of Leeb Capital Management, an investment house managing large-cap growth portfolios.<br />\n  He is also the founder of the Leeb Group, which published extensive financial letters and has received multiple awards, including for the publications of The Complete Investor and Leeb’s Real World Investing.\n<br />\nFor the past 30 years, Dr Leeb has written many books on global economic trends and forecasts addressing oil and energy crises, future technologies and assets such as gold and metals.\n<br />\nHe is also the author of a 2011 book “Red Alert: How China’s Growing Prosperity Threatens the American Way of Life” which focuses in great length on the long-term strategies behind China’s present national push to be the preeminent country in renewable energy technologies.\n<br />\nNewsmaker: An initiative to permanent shut down Indian Point due to increased likelihood of a hydrogen explosion in the event of a meltdown\nMark Leyse is a nuclear safety consultant, who researched and wrote Riverkeeper’s enforcement action petition, dated November 14, 2012, requesting that the Nuclear Regulatory Commission order the Indian Point nuclear power plant to be shutdown permanently. <br />\n The petition cites safety analyses indicating that hydrogen produced in the event of a meltdown could detonate and breach one of Indian Point’s reactor containment buildings, causing a large radiological release to the environment.\n<br />\nLeyse has also worked as a consultant for other environmental organizations, including Natural Resources Defense Council. <br />\n He is also the author of the NRDCs recent research and investigative report, “Preventing Hydrogen Explosion at Indian Point Nuclear Plant: Fact versus Industry Spin”\nWebsite: www.Riverkeeper.org<br /></p>\n"
}
