{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-051512/",
    "podcast": {
      "developer-note": "",
      "length": "1:04",
      "note": "",
      "size": 15363448,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/uqnt74/GaryNullShow051512.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-05-15 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>HPV Vaccination and FDA/CDC vaccine policies\nBeth Clay is the present Senior Vice President of Capitol Strategy<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nConsultants in Washington DC, where she works with corporate and nonprofit organizations and government relations. <br />\nMuch of her work is focused now on dietary supplement regulation and alternative health policy issues, particularly regarding vaccination and autism. <br />\nFormerly she was a senior on the House Committee on Oversight and Government Reform and the Subcommittee on Human Rights and Wellness with Chairman Congressman Dan Burton.<br />\n  It was her work with Rep. <br />\nBurton’s investigation into CDC failures over mercury in vaccines leading to autism that has made her best known. <br />\nShe has also worked with the NIH’s Office of Alternative Medicine, and was a member of the US delegation to Codex Alimentarius’ Committee on Nutrition and Food for Special Dietary Uses.\n<br />\nEmily Tarsell is the mother of 21 year old Christina Tarsell who died suddenly following her third injection with the human papilloma virus (HPV) vaccine.<br />\n  She is a licensed clinical counselor and is now the volunteer Director of the Gardasil Network Development group at Barbara Lo Fisher’s National Vaccine Information Center and doing out reach to families who have experienced the loss of a daughter or have suffered serious adverse events from the HPV vaccine.\n<br /></p>\n"
}
