{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-012714/",
    "podcast": {
      "developer-note": "",
      "length": "57:31",
      "note": "",
      "size": 13804251,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/nzdhkd/PCH012714.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-01-27 00:00:00 -0700",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nVandana Shiva is an internationally renown environmental and social activist, and formerly a one of India’s top nuclear physicists. <br />\nShe is regarded as the leading pioneer behind India’s ecological and ecofeminism movement. <br />\nIn 1982 Dr Shiva founded the Research Foundation for Science, Technology and Ecology, which led to the creation of Navdanya (all “a”s are softly pronounced  NAV-DAN-YA) – an organization dedicated to the restoration of organic farming across India and the preservation of indigenous knowledge and culture.\n<br />\nFor several decades, Vandana has fought for changes in the globalized practices of agriculture and food. <br />\nShe has traveled the world speaking against biopiracy and patenting of indigenous knowledge by large agricultural and pharmaceutical corporations. <br />\nHer activist efforts have created grassroots organizations throughout the developing world to counter genetic engineering of crops, as well as empower women throughout the third world.\n<br />\nDr Shiva has received numerous international awards, including the Alternative Nobel Prize (the Right Livelihood Award), the UNEP’s Global 500 Award and the UN’s Earth Day International Award.\n<br />\nAmong her more important books are “Earth Democracy: Justice, Sustainability and Peace”, “Manifestos on the Future of Food and Seed”, “Soil Not Oil” and most recently  “Making Peace with the Earth: Beyond Resource, Land and Food Wars”\nDr Juliet Christian-Smith is a climate scientist with the Climate and Energy Program at the Union of Concerned Scientists (UCS), based at the University of California at Berkeley. <br />\nThe focus of her work is providing California and national policymakers and the public with robust, policy-relevant information on climate science and the impacts of climate change. <br />\n  Prior to joining UCS, Juliet worked as a senior researcher for the Pacific Institute, performing policy-focused research on sustainable water management, primarily in the Western US She and two colleagues received the Environmental Protection Agency’s Award for Outstanding Achievement for their work on agricultural water management.  Juliet holds a PhD in Environmental Science, Policy, and Management from the University of California, Berkeley and a BA in Biology from Smith College.   She is also the lead author of the book A Twenty-First Century US Water Policy (Oxford Press 2012) and an editor of the journal Sustainability Science.  The website is UCSUSA.org\nMeera Karunananthan is the Water Campaigner for the Council of Canadians, one of Canada’s largest public advocacy organizations presided over by renowned environmental activist Maude Barlow, with thousands of members and chapters throughout the country.  Meera is also the international campaign director for the Council’s Blue Planet Project, which is part of a global movement, working with allies around the world, struggling for water justice and defending it as a commons and human rights issue, for the nearly billion people without safe drinking water and the 3.<br />\n5 million who die annually fro water related diseases. <br />\nMeera’s studies and research focuses upon corporate appropriation of water rights and its political impact upon policies. <br />\n The websites are BluePlanetProject.net   AND   Canadians.org\n \n<br /></p>\n"
}
