{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-091514/",
    "podcast": {
      "developer-note": "",
      "length": "57:45",
      "note": "",
      "size": 20792425,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/siwa6f/BAR091514.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-09-15 00:00:00 -0600",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>“Shame on the Congressional Black Caucus” Rally\n </p>\n\n<p>The Israeli bombing of Gaza “was the straw that broke the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nproverbial camel’s back,” said Asantawaa Nkrumuah Ture, an organizer of a “Shame on the CBC” rally set for September 24 in front of the Washington Convention Center, where the Black Caucus opens its annual legislative conference and gala. <br />\n“It’s well past time for us to hold them accountable.<br />\n” The protesters want to “start a conversation, nationally,” said Nkrumah Ture, “not only regarding the Black Caucus’ support of apartheid Israel, about also their position on Internet neutrality, their ties with corporate America,” and the CBC’s overwhelming vote, in June, to continue militarization of local police forces.\n<br /></p>\n\n<p>Motive: Black. <br />\nPenalty: Death\n </p>\n\n<p>When Duane Buck faced sentencing on a murder conviction in a Houston courtroom, the judge allowed “expert” testimony that Blacks were inherently more dangerous than whites. <br />\nOn August 29, a federal judge called the testimony “repugnant and dangerous,” but upheld the death sentence, anyway. <br />\n“It is absolutely shocking, it is stunning, it is appalling and it sets a terrifying precedent,” said Christina Swarns, litigation director for the NAACP Legal Defense and Educational Fund, which is handling Buck’s appeal. <br />\n“This is asking a jury to rely on race to impose a death sentence.<br />\n”</p>\n\n<p>New York City Needs Justice, Not More Police Training\n </p>\n\n<p>Police Commissioner Bill Bratton defended his “Broken Windows” policing policies before the New York City Council, claiming there’s nothing wrong with the NYPD that $30 million in training and 1,000 more cops can’t cure. <br />\nJosmar Trujillo, of New Yorkers Against Bratton, disagrees. <br />\n“The police department is one of the most trained in the world,” said Trujillo. <br />\n“Training isn’t the issue. <br />\nThe systemic culture of brutality, which is reinforced by institutional racism, is really the conversation we need to be having.<br />\n”</p>\n\n<p>Obama Targets Syria, Not ISIS\n </p>\n\n<p>President Obama’s bombing offensive in Iraq and Syria “brings humanity closer to world war than we have been, maybe, in 80 years,” said scholar and activist Dr Anthony Monteiro. <br />\nAlthough purportedly aimed at ISIS, Washington is actually targeting the Syrian government, Iran and, ultimately, Russia. <br />\nObama’s arming of so-called “moderate” Syrian rebels is a farce, said Monteiro. <br />\n“There is no ‘moderate’ opposition to the Assad government. <br />\nIt is all extreme, gangster, thuggish militants who are funded by some of the very nations that are part of the ‘coalition of the willing.<br />\n’” Dr Monterio is fighting his termination from the African American Studies department at Temple University, in Philadelphia.\n<br /></p>\n\n<p>US Proxy Wars Empower Jihadists and Nazis\n </p>\n\n<p>“The United States is essentially contracting out its wars” in Libya, Syria and Ukraine, said Eric Draitser, an independent political analyst and publisher of StopImperialism.<br />\ncom. <br />\n“The proxy wars that the United States has begun all over the world are part and parcel of a larger imperial agenda” dating from US involvement in Afghanistan and Central America. <br />\nThe Islamic State “is a by-product of US foreign policy, just as the Nazis in Ukraine are a by-product of US foreign policy,” said Draitser.\n<br /></p>\n\n<p>September Surge in EEOC Case Dismissals\n </p>\n\n<p>Every year about this time, the Equal Employment Opportunity Commission dismisses tens of thousands of discrimination cases, citing “lack of evidence” and a perennial backlog. <br />\n“There is no backlog,” said Ricardo Jones, a former chief investigator for the EEOC in New York. <br />\n“There’s been 15 years of not paying overtime” to deal with legitimate complaints, while the money “has basically gone to managers.<br />\n”</p>\n\n<p>Black President Doesn’t Respect Black Culture or History\n </p>\n\n<p>Dr Donald Smith, a founder of the National Alliance of Black School Educators, will be honored at a conference on Education for Liberation in the African American Tradition, in New York, October 10. <br />\nDr Smith said Black history and culture is disappearing from classrooms around the country. <br />\n“The major challenge begins in the White House, with a president who does not believe in Black culture as being essential to the education, not only of children of African descent, but of all American children,” said Smith.\n<br /></p>\n\n<p><br /></p>\n"
}
