{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-090314/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:25",
      "note": "",
      "size": 22113216,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/phw8vg/GaryNullShow_090314.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-09-03 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Health risks and hazards from America’s shale gas boom\nDr Robert Oswald is a professor of Molecular Medicine at the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nCollege of Veterinary Medicine, and the Graduate Field of Biophysics, at Cornell University, where his focus of research has been the function of neurotransmitter receptors, in particular glutamate receptors as they related to learning, memory and a variety of neurological disorders.  He serves on the editorial board of the Journal of Biological Chemistry and the scientific journal Molecular Pharmacology.<br />\n  In the past Dr Oswald was a visiting professor at Harvard and Oxford universities.\n<br />\nJoining him is Dr Michelle Bamberger, a veterinarian practicing in Ithaca New York. <br />\nDr Bamberger is a graduate of Cornell College of Veterinarian Medicine, and has a masters in pharmacology from Hahnemann University Medical College. <br />\nShe studied at Oxford in the UK and specialized in small animal and exotic medicine.\n<br />\nRobert and Michelle are the co-authors of the recent book “The Real Cost of Fracking: How America’s Shale Gas Boom is Threatening Our Families, Pets and Food.” They are also both members of the advisory board of the organization Physicians, Scientists and Engineers for Healthy Energy.<br /></p>\n"
}
