{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-060414/",
    "podcast": {
      "developer-note": "",
      "length": "52:35",
      "note": "",
      "size": 12622890,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/zbe5d2/LeidStories_060414.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-06-04 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Historian Gerald Horne Debunks the Myth of America’s Beginnings;\nPreservation of Slavery, He Says, Fueled Founding<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nFathers’ Revolutionary War\nAs is common lore, the nation was born out of a rebellion against onerous taxes imposed by Britain on its 13 early colonies in America. <br />\nHaving no representation in Parliament, the colonists deemed tribute to the crown unfair, illegal and an old-world threat to the ideals and freedoms they had come to enjoy in their new world. <br />\nTheir righteous indignation grew over time and fed the ubiquitous cry to break free of the British Empire—a yearning  achieved with the Revolutionary War (also called the American War of Independence). <br />\nThe visionary Founding Fathers then forged a new nation, enshrining the colonists’ shared noble values in the Declaration of Independence and Constitution, guaranteeing freedom, justice and equality to all.\n<br />\nIt’s a nation-creation myth, says Dr Gerald Horne, John J. <br />\nand Rebecca Moores chair of history and African American studies and professor of diplomatic history at the University of Houston. <br />\nHis newly released book, The Counter-Revolution of 1776: Slave Resistance and the Origins of the United States of America, is the focus of today’s program.\n<br />\nThe Revolutionary War really was a counterrevolutionary movement, says Horne. <br />\nThe chief protagonists were “founding fathers” who were heavily invested in slavery in North America and feared the inevitability of abolition by Britain and strategic military help Britain and enslaved Africans in America would receive from leaders of successful slave rebellions in the Caribbean.\n<br />\nAn eye-opening, history-remaking session! <br />\nDon’t miss it!<br /></p>\n"
}
