{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/paris-france-and-baga-nigeria-white-lives-black-lives-and-terrorism-011215/",
    "podcast": {
      "developer-note": "",
      "length": "57:1",
      "note": "",
      "size": 20581057,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/3jnfmx/LeidStories_011215.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Paris, France and Baga, Nigeria: White Lives, Black Lives and Terrorism"
  },
  "title": "Paris, France and Baga, Nigeria: White Lives, Black Lives and Terrorism",
  "date": "2015-01-12 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>More than 40 world leaders and dignitaries headed a march in Paris yesterday in solidarity with national mourning for<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\n17 people killed in terrorist attacks last week. <br />\n(President Barack Obama, who did not attend, was heavily criticized by US media for his absence; Secretary of State John Kerry dismissed the media’s barbs as “quibbling.<br />\n”)\nWorld reaction to the three-day spate of killings by three alleged al-Qaeda-linked terrorists (whose main target was Charlie Hebdo, a popular satirical magazine that recently ran a cartoon lampooning the Prophet Muhammad) is in stark contrast to the massacre of more than 2,000 people in a single attack by the terrorist group Boko Haram in a town called Baga in Borno State, Nigeria.\n<br />\nDr Chika Onyeani, publisher and editor in chief of The African Sun Times, discusses the situation in Nigeria in the aftermath of the attack, and the dichotomy in world reaction to these separate, though related, events.\n<br />\nThe new year brings with it a new fighting spirit in beleaguered Detroit, says activist Elena Herrada, a member of the Detroit School Board and member of Detroiters Resisting Emergency Management.\n<br /></p>\n\n<p>Herrada provides an overview of where the battle lines are being drawn, even though, she says, grassroots organizations still in the fight have been whittled down to just a few.<br /></p>\n"
}
