{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-060412/",
    "podcast": {
      "developer-note": "",
      "length": "1:54:21",
      "note": "",
      "size": 27445392,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/idgb6f/ProgressiveCommentaryHour060412.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-06-04 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>The erosion of civil liberties, human rights and the demise of American democracy\nPeter Dale Scott is a former<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nprofessor of English at the University of California at Berkeley (where he was also the co-founder of the Peace and Conflict Studies Program), a recognized poet, a former Canadian diplomat and a scholar and on domestic and international political issues including war and conflict, the drug trade, the politics of oil and the assassination of JFK. <br />\n His website is PeterDaleScott.<br />\nnet\nPeter Phillips is a professor of Sociology at Sonoma State University in California where he teaches courses in political sociology, media censorship, and the sociology of power and the media. <br />\nHe is the former founding director of Project Censored, an internationally known research program and watch organization that annually identifies the “Most Censored” news stories not appearing in mainstream media\nSteve Lendman is an independent , progressive economist and investigative writer who consistently tackles the most critical issues in the world as soon as they emerge.<br />\n  He has degrees from Harvard and the University of Pennsylvania’s Wharton School of Business and recently received the International Journalist award from the prestigious Club of Mexico. <br />\nSteven is the host of the The Lendman News Hour heard on the Progressive Radio Network every Thursday at 11 AM and every Saturday and Sunday at 1 PM.\n<br /></p>\n"
}
