{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-obama-and-ali-042814/",
    "podcast": {
      "developer-note": "",
      "length": "55:12",
      "note": "",
      "size": 13251918,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/3gdv5z/LeidStories_042814.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Obama And Ali"
  },
  "title": "Obama And Ali",
  "date": "2014-04-28 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Obama Mines Russia-Ukraine, Asia-Pacific for Global Power, Midterm Votes\nMuhammad Ali Takes A Stand; Refuses to Be<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nDrafted In the Army\nTwo days after Vice President Joe Biden’s return from Kiev to shore up US support for Ukraine’s “democracy, unity and territorial integrity,” his boss began a big diplomatic mission of his own.\n<br />\nPresident Obama tomorrow wraps up an eight-day, four-nation trek through the Asia-Pacific region to accomplish the following goals with respect to Japan, the Republic of Korea, Malaysia and the Philippines, said the White House: “modernizing US alliances, supporting democratic development, advancing the Trans-Pacific Partnership and other commercial ties, investing in regional institutions, and deepening cultural ties.<br />\n”\nWell, how did it all go? <br />\nSince diplomacy is mostly about what is not said or seen, Dr Gerald Horne, the John J. <br />\nand Rebecca Moores chair of history and African American studies and professor of diplomatic history at the University of Houston, reveals what’s behind Obama’s big sell.\n<br />\nOn this day in 1967, heavyweight champion Muhammad Ali, then a member of the Nation of Islam, refused to be drafted into the US Army on the grounds that it violated his religious beliefs. \nIn his own words, Ali explains his defiance of the law—a battle that would cost him dearly, even though the US Supreme Court in 1971 would overturn a lower-court conviction by an all-white jury on draft-evasion charges. <br /></p>\n"
}
