{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-081114/",
    "podcast": {
      "developer-note": "",
      "length": "58:05",
      "note": "",
      "size": 20914848,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/8h349y/LeidStories_081114.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-08-11 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Running Dry In Detroit: More Than 100,000 At Risk of Water Shutoffs\nSeeking Justice for Eric Garner, But Sharpton Is<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nIn A Political Chokehold\nAdd a water crisis and a fast-developing public-health problem to the long list of miseries heaped upon beleaguered Detroiters as the city seeks to declare bankruptcy.\n<br />\nTens of thousands of households unable to pay their water bills have no running water. <br />\nAnd 100,000 more facing shutoffs aren’t sure what will happen after a citywide moratorium ends on Aug. <br />\n25.\n<br />\nCurt Guyette, an investigative reporter for the American Civil Liberties Union of Michigan focusing on Michigan’s emergency management law, discusses the human-rights and related legal issues raised by the water-shutoff crisis, and says that the shutoffs are being done “in a way that disproportionately affects African Americans, a concern echoed by the United Nations.<br />\n”\nThe Rev. <br />\nAl Sharpton’s Aug. <br />\n23 “March for Justice for Eric Garner” across the Verrazano Bridge into Staten Island instead will be a caravan—owing to safety concerns, not capitulation to City Hall or the NYPD, he says.\n<br />\nBut even as he takes the lead in channeling the community’s outrage over Garner’s NYPD-inflicted chokehold death, demanding justice in the case, Sharpton is himself in a political chokehold, and it already is affecting the legal course of the case.\n<br />\nLeid Stories explains.  </p>\n\n<p><br /></p>\n"
}
