{
  "header": {
    "category": "the-news-dissector",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenewsdissector.podbean.com/e/news-dissector-092613/",
    "podcast": {
      "developer-note": "",
      "length": "55:05",
      "note": "",
      "size": 13223393,
      "type": "audio/mpeg",
      "url": "http://thenewsdissector.podbean.com/mf/feed/f8jprk/NewsDissector092613.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://thenewsdissector.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Fri, 19 Sep 2014 16:24:15 +0000",
        "timestamp": "1411161855"
      },
      "subtitle": "h",
      "title": "The News Dissector"
    },
    "tags": [
      "News & Politics",
      "the-news-dissector"
    ],
    "title": "The News Dissector"
  },
  "title": "The News Dissector",
  "date": "2013-09-26 00:00:00 -0600",
  "categories": [
    "the-news-dissector"
  ],
  "content": "<p>Noreena Hertz. a professor at Amsterdam and University of Cambridge.\n&lt;!--more--&gt;\nHer new book iS EYES WIDE OPEN: How To Make Smart Decisions in A Confusing World…She is a brilliant economic forecaster and author of The Debt Threat. <br />\nGoogle Her for More Background\nCARTER ALAN. <br />\nFORMER WBCN DJ AND AUTHOR OF THE BOOK RADIO FREE BOSTON—ON WBCN ON THE RISE AND FALL OF WBCN (AND ROCK RADIO).\n<br />\nBlaring the Cream anthem “I Feel Free,” WBCN went on the air in March 1968 as an experiment in free-form rock on the fledgling FM radio band. <br />\nIt broadcast its final song, Pink Floyd’s “Shine On You Crazy Diamond,” in August 2009. <br />\nIn between, WBCN became the musical, cultural, and political voice of the young people of Boston and New England, sustaining a vibrant local music scene that launched such artists as the J. <br />\nGeils Band, Aerosmith, James Taylor, Boston, the Cars, and the Dropkick Murphys, as well as paving the way for Bruce Springsteen, Tom Petty, U2, and many others. <br />\nAlong the way, WBCN both pioneered and defined progressive rock radio, the dominant format for a generation of listeners. <br />\nBrilliantly told by Carter Alan–and featuring the voices of station insiders and the artists they loved–Radio Free Boston is the story of a city; of artistic freedom, of music and politics and identity; and of the cultural, technological, and financial forces that killed rock radio.\n<br /></p>\n"
}
