{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-program-on-vaccines-020413/",
    "podcast": {
      "developer-note": "",
      "length": "57:21",
      "note": "",
      "size": 13764441,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/p24c75/PCH020413.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Program on Vaccines"
  },
  "title": "Program on Vaccines",
  "date": "2013-02-04 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Catherine Frompovich is a retired natural nutritionist and a journalist and researcher focusing on consumer health<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nissues. <br />\nShe has advanced degrees in Nutrition Sciences and in Orthomolecular Theory and Practice. <br />\nIn the 1980s she was the host of one of the countries first natural cooking shows on television, Catherine’s Natural Kitchen.<br />\n  She is the co-author of a monogram, Vaccines and Vaccinations, presented to the Congressional Oversight Committees to initiate a thorough review into vaccine safety, efficacy and policies.\n<br />\nShe is the author of several books including A Cancer Answer, Holistic Breast Cancer Management, and Our Chemical Lives and the Hijacking of our DNA.<br />\n  Today she continues publishing her investigative reporting on Activist Post and other alternative news sites, and she consults for other aspiring authors to get their works into publication.\n<br />\nBOOK:  Our Chemical Lives and the Hijacking of our DNA\nWEBSITE:  www.CatherineJFrompovich.<br />\ncom\nDr Viera Scheibner is a retired Principal Research Scientist in Australia. <br />\nAfter losing a baby to crib death in the mid-1980s due to a vaccine immunization, she has made the science behind vaccines her primary focus of medical research.  She is now one of the world’s leading experts on the faulty science and adverse effects of vaccines in general, and their individual ingredients in particular.<br />\n  Frequently she has served as a expert witness in court cases related to death and injuries caused by vaccines.\n<br />\n Dr Scheibner has published two major books on vaccines – “Vaccination 100 Years of Orthodox Research”  and  “Behavioral Problems in Childhood: The Link to Vaccination” and close to 90 scientific peer-reviewed papers.\n<br />\nEdda West is the co-founder of the Association for Vaccine Damaged Children and the Vaccination Risk Awareness Network, Canada’s leading vaccine awareness organization.  VRAN is a non profit education society that supports and provides resources to vaccine injured Canadians.  Her daughter was injured by the MMR vaccine at 15 months, back in 1977.<br />\n  Edda is a long time political activist and has been actively opposed to mandatory vaccines as being against Canada’s constitution and her efforts have been greatly responsible for her country’s exemption laws.\n<br />\nWEBSITE:  www.VRAN.org\n<br /></p>\n"
}
