{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour/",
    "podcast": {
      "developer-note": "",
      "length": "2:07:11",
      "note": "",
      "size": 30527424,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/snut/ProgressiveCommentaryHour112811.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2011-11-29 00:00:00 -0700",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Guests: Celia Farber, Professor Henry Bauer, David Crowe\nCelia Farber is a journalist who covered the HIV wars<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nextensively since 1987, in various magazines. <br />\nSome of these writings are collected in her book: “Serious Adverse Events: An Uncensored History of AIDS” published by Melville House Press, (now Random House) in 2006. <br /></p>\n\n<p>Activist Michael Callen called Farber “..the best AIDS journalist in the world.<br />\n”  She also has enemies, of course. <br />\nHer 2006 article for Harper’s magazine detailing the totalitarian corruption of HIV/AIDS research was titled “Out of Control: AIDS And The Corruption of Medical Science.<br />\n” The attacks from the AIDS industry were predictable and fierce. <br />\nStill, she won the 2008 Semmelweis Clean Hands Award for Outstanding Investigative Journalism.\n<br />\nProf. <br />\nHenry Bauer is professor emeritus of chemistry and science studies and a former dean at Virginia Polytechnic Institute.<br />\n  After his retirement he served as the editor-in-chief of the Journal of Scientific Exploration for seven years. <br />\nHe is author of the book The Origin, Persistence and Failings of HIV/AIDS Theory , which was among the first books to gather together two decades of research on HIV and AIDS and to identify the scientific contradictions.\n<br />\nDavid Crowe is the President of the Reappraising AIDS Society and a member of the Canadian Association of Journalists. <br />\nHe hosts the www.ReThinkingAIDS.com website, which is science and news resource on all international research and commentary challenging the current HIV/AIDS model.<br />\n  David is also the former president and treasurer for the Green Party in Alberta Canada.\n<br /></p>\n"
}
