{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-99/",
    "podcast": {
      "developer-note": "",
      "length": "59:39",
      "note": "",
      "size": 14317488,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/zkr8jr/GaryNullShow042811.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-04-28 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today’s guest is Dr.\n&lt;!--more--&gt;\nDavid Rasnick and he is medical researcher specializing in AIDS, cancer, protease inhibitors and clinical diagnostics. <br />\nHe was the first scientist to synthesis peptidyl-fluoromethanes, inhibitors of cysteine proteases used to destroy tissue related to arthritis, cancer and various parasites. <br />\nIn 1978, he helped establish the Diagnostic chemistry group at Abbott Laboratories and was a founder of Enzyme Systems Products and Prototek. <br />\n After leaving Khepri Pharmaceuticals as a senior scientist, David, along with his colleague Dr Peter Duesberg at the University of California at Berkeley, David further developed the aneuploidy theory of cancer, which pertains to chromosomal imbalance. <br />\n Over the years he has been a sharp critic of the current dominant AIDS hypothesis, has been a former President of the group Rethinking AIDS and was a member of the Presidential AIDS Advisory Panel of South Africa started by President Thabo Mbeki. <br /></p>\n\n<p>www.DavidRasnick.<br />\ncom\nAlso, we have Martin Barnes and he has been a volunteer for the science organization Rethinking AIDS for the past four years and directs its public relations activities. <br />\nHe resides in the south of France and is the editor of “The AIDS Trap”, which has been translated into five languages and is illustrated by the famous underground comic artist and AIDS dissident R. <br />\nCrumb.\n<br />\nwww.Maisondemartin.com and www.TheAIDSTrap.com\n<br /></p>\n"
}
