{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-jfk-and-the-secret-service-112013/",
    "podcast": {
      "developer-note": "",
      "length": "1:03:1",
      "note": "",
      "size": 15161678,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/wwkqp/GaryNullShow112013.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "JFK and the Secret Service"
  },
  "title": "JFK and the Secret Service",
  "date": "2013-11-20 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The role and failures of the Secret Service, and the confession of E Howard Hunt to his son regarding the “Big Event” <span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\n— the murder of JFK</p>\n\n<p>Vince Palamara became interested in the JFK assassination at the age of twelve and later realized that very little attention in the conspiracy literature gave attention to the Secret Service agency, which is assigned to protect Presidents.<br />\n  He has become the leading civilian authority on Secret Service history and protocol. <br />\nVince’s research led him to personally contact over 80 individuals including former Secret Service agents, White House aides and surviving members of the Kennedy family. <br />\nHis research has been compiled in a recent new addition of his book “Survivor’s Guilt: The Secret Service and the JFK Murder” \n \nVince earlier book, “JKF: The Medical Evidence Reference” is regarded as one of the most thorough texts on the physical examination of the medical forensics and coverup following Kennedy’s death.  His website is VincePalamara.blogspot.<br />\ncom</p>\n\n<p>Our guest is the son of the high CIA spymaster and Watergate burglar E. <br />\nHoward Hunt.  Saint John Hunt was born in the US however lived on various continents while growing due to his father’s activities with the CIA.<br />\n  For the past 35 years Saint John has been involved with the music industry as a musician in addition to working in the healthcare profession.\n<br />\n \nLater Saint John reproduced the conversations with his father in addition to new information about the JFK assassination and Watergate in his book “Bond of Secrecy: My Life with CIA Spy and Watergate Conspirator E Howard Hunt” (Trineday books). <br />\nHis website is SaintJohnHunt.com</p>\n\n<p><br /></p>\n"
}
