{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-121613/",
    "podcast": {
      "developer-note": "",
      "length": "57:12",
      "note": "",
      "size": 13731318,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/r6axg5/PCH121613.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2013-12-16 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Arne Gundersen is founding chief engineer of Fairwinds Energy Education, a non profit organization dedicated to<span class=\"ellipsis\">…</span>\n<!--more-->\neducating the public about nuclear power and other energy issues. <br />\nIn the past he was an energy advisor with 39-years of nuclear power engineering experience and a former nuclear industry senior vice president. <br />\nDuring his industry career, Arne managed and coordinated projects at 70-nuclear power plants around the country. <br />\nNow an independent nuclear engineering and safety expert, Arne has provided testimony on nuclear operations, reliability, safety, and radiation issues to the NRC, Congressional and State Legislatures, and Government Agencies and Officials throughout the US, Canada, and internationally. <br />\nIn 2008, he was appointed by the Vermont Senate President to be the first Chair of the Vermont Yankee Nuclear Power Plant Oversight Panel.<br />\nHe is regarded as one of the leading nuclear experts who is conveying the truth about the dangers of the Fukushima Daiichi nuclear power plants and the global threats from the on-going release of radiation. <br />\nHis website is FairWinds.<br />\norg    \n  \nDr Helen Caldicott is perhaps the single most articulate and passionate advocate of citizen action to counter the nuclear and environmental crises. <br />\nShe has a medical degree from the University of Adelaide  and was a pediatric instructor Harvard Medical School until 1980 when she resigned to work full time on the prevention of nuclear war. <br />\nShe co-founded the Physicians for Social Responsibility, an organization of 23,000 doctors committed to educating their colleagues about the dangers of nuclear power, nuclear weapons and nuclear war. <br />\nDr Caldicott has received numerous awards, was nominated for a Nobel Peace Prize by Linus Pauling and has 21 honorary degress. <br />\nThe Smithsonian has named Dr Caldicott as one of the most influential women of the 20th century.\n<br />\nShe has written many articles and books, her latest being “Nuclear Power is Not the Answer to Global Warming or Anything Else.”  Her website is www.HelenCaldicott.<br />\ncom\nProf. <br />\nHarvey Wasserman is a professor of history at Columbus State College and Capital University in Ohio.<br />\n  He is an investigative journalist, author and has been a national voice in the anti-war and anti-nuclear movements for over four decades. <br />\nHe is also a senior advisor for Greenpeace USA and the Nuclear Information and Resource Service and founder of Solartopia.<br />\norg, a grassroots endeavor to promote a green-powered earth. <br />\n Among his many books are “George W Bush vs. <br />\nthe Superpower of Peace” and his articles appear frequently on Counterpunch, Alternet, NukeWatch, Huffington Post and others.\n<br />\nHarvey can also be heard every Monday afternoon at 3 pm Eastern as host of “Green Power and Wellness” on the Progressive Radio Network.  His website is Solartopia.org\n<br /></p>\n"
}
