{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-mainstream-media%e2%80%99s-culture-of-misinformation-061013/",
    "podcast": {
      "developer-note": "",
      "length": "57:52",
      "note": "",
      "size": 13891814,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/edv9q6/PCH061013.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Mainstream Media’s culture of misinformation"
  },
  "title": "Mainstream Media’s culture of misinformation",
  "date": "2013-06-10 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Russ Baker is an award-winning investigative reporter and journalist in the alternative media and founder of the<span class=\"ellipsis\">…</span>\n<!--more-->\nindependent progressive news and analysis site, WhoWhatWhy.<br />\ncom.\n<br />\nOver the past two decades, he has produced over a thousand stories on a broad range of topics, from political revolutions to revolutionary humor. <br />\nRuss has covered the Hutu-Tutsi massacres in Central Africa, the fall of the Berlin Wall and the overthrow of Romanian dictator Nicolae Ceausescu. <br />\nHe has received Society of Professional Journalists, the Mencken and the Common Cause awards, and has served on the adjunct faculty at Columbia University’s Graduate School of Journalism.  His research into the rise and election of George W Bush led to his bestseller, “Family of Secrets: The Bush Dynasty, America’s Invisible Government and the Hidden History of the Last 50 Years.”  His website is www.WhoWhatWhy.com\nMickey Huff is the director of Project Censored and is on the board of directors for the Media Freedom Foundation.  He is professor of social science and history at Diablo Valley College in the San Francisco Bay area, where he is co-chair of the history department.<br />\n  He is also on the Advisory Committee for the History of Conflict programs at John F. <br />\nKennedy University.\n<br />\nMickey has appeared frequently on NPR, PBS, ABC, Pacifica, The New York Times Co.<br />\n, Al Jazeera English, Russia TV, the Progressive Radio Network, and many other commercial and independent media outlets. <br />\nHe lectures across the US on issues of censorship, propaganda and media literacy, with a special focus on suppressed historical narratives.<br />\n  He has been a co-editor, editor, and/or contributor to the award-winning Project Censored book series since 2008 and appears in the new documentary Project Censored:  The Movie. <br />\nWebsite is ProjectCensored.<br />\norg and he hosts. <br />\nHe is the co-host of the broadcast Project Censored, heard every Monday at 11 am Eastern time on the Progressive Radio Network.\n<br /></p>\n"
}
