{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-12-13-11/",
    "podcast": {
      "developer-note": "",
      "length": "1:03:04",
      "note": "",
      "size": 15138576,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/t449p8/GaryNullShow121311.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-12-13 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guest: Rabbi Michael Lerner</p>\n\n<p>Rabbi Michael Lerner is clearly one the nation’s greatest Jewish intellectuals and<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nspiritual political activists. <br />\nAs a teenager, Rabbi Lerner was a student of Abraham Joshua Heschel, a great socially responsible mystical thinker who marched with Martin Luther King.\n<br /></p>\n\n<p>During the 60s, he was a chair of the Berkeley chapter of the Students for a Democratic Society and briefly incarcerated among the Seattle Seven while teaching at the University of Washington,. <br />\nHe also has the honor of having been called by J Edgar Hoover as “one of the most dangerous criminals in America.<br />\n”</p>\n\n<p>Michael is currently the editor of Tikkun Magazine—an award winning journal of interfaith and progressive critiques on American culture, politics, and religion—and is the founder of the Network of Spiritual Progressives. <br />\nHis most recent book just released before the Hannukah holiday is “Embracing Israel/Palestine: A Strategy to Heal and Transform the Middle East” which is being praised by people like Jimmy Carter, Uri Avnery who is a frequent guest on this program, Desmond Tutu, Senator Keith Ellison and others as the most insightful treatment and understanding of the roots of the Israeli-Palestinian conflict and a roadmap for bringing peace to the region.\n<br /></p>\n"
}
