{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/the-infectious-myth-the-cdc-vaccine-scandal-with-dr-toni-bark-090214/",
    "podcast": {
      "developer-note": "",
      "length": "59:47",
      "note": "",
      "size": 21526600,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/gzdiyh/InfectiousMyth090214.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 24 Feb 2015 20:00:00 +0000",
        "timestamp": "1424826000"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "The CDC Vaccine Scandal with Dr. Toni Bark"
  },
  "title": "The CDC Vaccine Scandal with Dr. Toni Bark",
  "date": "2014-09-02 00:00:00 -0400",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>A vaccine scandal erupted recently at the CDC and David talks with Dr. Toni Bark to understand it.\n<!--more-->\nIt has been known for some time that a whistleblower within the CDC was leaking data about the suppression of the connection between the MMR vaccine and autism to PhD chemist Brian Hooker. <br />\nBut recently the whistleblower was revealed to be Brian Thompson who released a statement through his personal lawyers, saying, in part, “I regret that my coauthors and I omitted statistically significant information  in our 2004 article published in the journal Pediatrics.<br />\n The omitted data suggested that African American males who received the MMR vaccine before age 36 months were at increased  risk for autism. <br />\nDecisions were made regarding which findings to report after the data were collected, and I believe that the final study protocol was not followed.<br />\n”\n \nThis means that the claims that the CDC is unaware of any connection between MMR and autism is false. <br />\nNot only that it means that the CDC, a government agency that Americans should be able to trust, has been lying to its own citizens, to maintain the illusion that all vaccines are safe and without any significant risk of side effects.\n<br />\n \nDr Bark talks about her journey from mainstream MD chastising parents who didn’t vaccine, to starting to learn about side effects of vaccines, to questioning most vaccines. <br />\nShe talks about the risks of mercury, aluminum and formaldehyde in vaccines, as well as the limited efficacy of vaccine immunity versus natural immunity.\n<br />\n \nYou can find out more about Dr Bark and her work at: http://www.disease-reversal.com\n </p>\n\n<p>She has a documentary coming out soon, called “Bought”, which covers the issues of vaccinations, GMO and big pharma in general, https://www.indiegogo.com/projects/bought-the-movie-phase-ii<br /></p>\n"
}
