{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-010814/",
    "podcast": {
      "developer-note": "",
      "length": "56:12",
      "note": "",
      "size": 13490991,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/6w6apb/AlternativeVisions010814.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Boeing Workers Tell Their Story of Force Concessions"
  },
  "title": "Boeing Workers Tell Their Story of Force Concessions",
  "date": "2014-01-08 00:00:00 -0500",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus interviews Boeing workers who over the weekend were forced into massive concessions by a combined offensive<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nby the Boeing Corp., in alliance with politicians, their International Union office, and suspiciously organized community groups paid by sources yet unknown.<br />\n  Listen to the story of how, after rejecting company proposals 2 to 1 to end their pensions, dismantle their health care, reduce wages to minimum levels in an 11 year contract extension, they were forced by a vote over the holidays to accept the agreement when 8000 of their members were on holiday and couldn’t vote. <br />\nThe concession agreement at Boeing is historic and a likely template of things yet to come. <br />\nNo longer are concessions forced by companies in financial trouble. <br />\nBoeing reported profits of $4.7 billion after the settlement, and after having paid its stockholders $10 billion in buybacks and $2 billion in dividends just last month.  The Boeing debacle represents a case example of union labor at a strategic impasse, in its bargaining strategy, political strategy, and community alliances strategy.<br />\nThe Boeing worker guests on today’s show were:\n Shannon Ryker\nShannon Ryker began working at Boeing at 17, and has been an employed 8 years at the company as a final assembly installer on the 767 aircraft and a structures mechanic on the 777 aircraft. <br />\nShe recently started a union support Facebook page called Rosiesmachinists751, which in the last eight months has grown from 8 members to almost 1600.\n<br />\nJim Levitt\nJim is a 35 year veteran at Boeing, working as a machinist and a tool &amp; die maker. <br />\nHe was at the same time a member of Impact Visuals, a cooperatively owned photo agency specializing in labor and social change from 1985-2001. His photographs have appeared in AFL-CIO, IAM, Teamsters, and other union publications, along with BusinessWeek, Time, the NY Times, Labor Notes, and many other outlets.<br />\n Before working at Boeing Jim was a graduate student in history.\n<br />\nHazel Powers\nHazel is a Tooling Inspector at Boeing, a 55 year old single parent, and has worked at Boeing since 1979.<br />\n  She is an IAM District Council Alternate delegate and has held past IAM Local Lodge positions as well. <br />\nHazel voted to reject the Boeing contract due to concessions with pension and other benefit cuts, and concern the new contract language is not specific enough\nabout keeping new aircraft 777X work in Puget Sound. “ \n \n<br /></p>\n"
}
