{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-the-supplement-pyramid-032514/",
    "podcast": {
      "developer-note": "",
      "length": "1:02:45",
      "note": "",
      "size": 15063771,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/95yah8/GaryNullShow032514.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Supplement Pyramid"
  },
  "title": "The Supplement Pyramid",
  "date": "2014-03-25 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The Supplement Pyramid – our need for maximizing, individual supplemental needs rather than a one-size fits all model<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nand the Who, Why and What behind negative studies on vitamins and supplements\nDr Michael (Mike) Smith, MD is the senior health scientist for Life Extension, the world’s leading organization dedicated to anti-aging research into the value and efficacy of nutrients, natural disease prevention, and for extending human lifespan. <br />\nHe is also the organization’s on-line personality and key educator.  Dr Smith received his medical degree from the University of Texas and did his internal medical internship at the University of Utah.<br />\n  Prior to joining Life Extension, he was the cardiovascular medical liaison for the pharmaceutical company AstraZeneca. <br />\nHe is a frequent guest on the Lifetime Network, manages several content health-conscious based medical websites, and hosts the program Healthy Talk on the RadioMD.com station. \nMike is the author of a recent and very important book “The Supplemental Pyramid” which helps guide people to properly creating their personalized nutritional regimen to most effectively deal with their individual health needs.<br /></p>\n"
}
