{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg"
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/infectious-myth-positive-hell-with-joan-shenton-061114/",
    "podcast": {
      "developer-note": "",
      "length": "59:48",
      "note": "",
      "size": 14355921,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/du4zv7/InfectiousMyth061014.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 24 Feb 2015 20:00:00 +0000",
        "timestamp": "1424826000"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Positive Hell with Joan Shenton"
  },
  "title": "Positive Hell with Joan Shenton",
  "date": "2014-06-11 00:00:00 -0400",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>David talks with veteran film maker Joan Shenton about her new joint product with Andi Reiss, “Positive Hell”<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\n(http://immunity.org.<br />\nuk), about a group of Spanish HIV-positives, who have either never taken AIDS drugs or took them only for a short time. <br />\nAll were severe IV drug addicts or, in the case of their medical advisor, Dr Manuel Garrido, a severe alcoholic. <br />\nAll of them conquered their addiction, and reclaimed their health, eventually rejecting their AIDS diagnosis.\n<br />\n \nThe interviews in this new video include a woman who went on to get married and have a child with her new husband. <br />\nDespite more than two decades of unprotected sex, he is still HIV-negative.\n<br />\n \nThe story of Dr Garrido is interesting because he is not just the medical advisor, but he has lived his advice, as he is also HIV-positive, and has also declined AIDS drugs.\n<br />\n \nThis should be the kind of hopeful story that will rock the world. <br />\nBut the experience of Joan Shenton shows that this will be difficult. <br />\nHer career as a successful medical documentary producer was destroyed in the early 1990s after a documentary first won a major award and then was the subject of a “Star Chamber” investigation.\n<br />\n \nJoan is the instigator of the Immune Resource Foundation website (http://immunity.org.<br />\nuk) that has a huge archive of critical AIDS documentaries and other video footage. <br />\nAlso with Andi Reiss she recently co-produced the film “Positively False: Birth of a Heresy” (http://positivelyfalsemovie.<br />\ncom) and is republishing her book this year, also called “Positively False”.\n<br /></p>\n"
}
