{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-020215/",
    "podcast": {
      "developer-note": "",
      "length": "57:59",
      "note": "",
      "size": 20875809,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/yfguwq/BAR020215.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2015-02-02 00:00:00 -0500",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>NYPD Creates Machine Gun-Toting Anti-Protest/Terror Unit\nNew York City police commissioner William Bratton announced<span class=\"ellipsis\">…</span>\n<!--more-->\nformation of a 350-officer, machine gun-equipped Strategic Response Group unit to deal with Black Lives Matter protests as well as terror attacks. <br />\n“That’s outrageous.<br />\n” said Carl Messineo, legal director of the Partnership for Civil Justice Fund, a DC-based outfit that has won millions of dollars in damages against police departments that abuse protesters’ civil rights. <br />\n“The police always conflate terrorism and protest.<br />\n” The mayor needs to “disband this unit before it is put into place,” said Messineo. <br />\n“This is a mission that is doomed to disaster.<br />\n”\nFerguson Protest Leader Speaks on Holder’s Tricks and Oprah’s Insults\nTaurean Russell, one of the leaders of Hands Up United, has been a key protest organizer since the day Officer Darren Wilson killed Michael Brown on a street in Ferguson, Missouri. <br />\nAsked how Blacks in Ferguson reacted to word that Attorney General Eric Holder will not indict Wilson on civil rights charges, Russell said: “We really don’t care if the system brings charges or indicts him. <br />\nThe community has indicted him.” The protests “woke up a lot of people to the hypocrisy that is the system.<br />\n” On media Tycoon Oprah Winfrey’s criticism, that young leaders of the new movement don’t know what they want, Russell said protesters’ demands have been widely circulated since August. <br />\n“I assume that she has a billion distractions – literally,” he said.\n<br />\nBlack Judas at the Justice Department\nFor months, the US Justice Department has been telling selected media that there will be no federal civil rights indictment of former cop Darren Wilson in the death of Michael Brown. <br />\nThe latest leak prompted whistleblower and BAR editor and columnist Dr Marsha Coleman-Adebayo to author an article titled, “Eric Holder’s Final Betraying Kiss to the People of Ferguson.<br />\n” “The symbolism is obviously the kiss between Judas and Christ,” said Coleman-Adebayo. <br />\nIn a sense, the leak liberates the Brown family from an eternity of waiting. <br />\n“Trayvon Martin’s family has been waiting for three years,” she said. <br />\nAll the martyrs’ families “should know they’ll get the same response” from Holder’s Justice Department as Michael Brown’s family.\n<br />\nMarissa Alexander Out of Prison on House Arrest\nAfter spending three years and 65 days in a Florida prison, Marissa Alexander has been placed under house arrest. <br />\nThe Black mother had faced as much as 60 years in prison for firing a shot to ward off her abusive husband. <br />\nHer supporters convened a People’s Movement Assembly to welcome Alexander back to Jacksonville. <br />\n“When we got rid of capitalism and the prison system, we also have to dismantle patriarchy,” said Aleta Alston-Toure, co-leader of the Free Marissa Now Mobilization Campaign. <br />\n“The National Rifle Association supports people having guns in their homes to protect themselves. <br />\nBut, why wasn’t Marissa in that equation? <br />\nBecause she’s a Black woman,” said Alston-Toure.\n<br />\nFebruary 20 Event for Lynne Stewart and All Political Prisoners\nOn New Year’s Eve, 2013, people’s lawyer Lynne Stewart was released from federal prison on compassionate grounds, suffering from Stage Four cancer. <br />\n“We are celebrating the year that Lynne has had out. <br />\nThe life expectancy was six months,” said her husband and lifelong comrade in struggle, Ralph Poynter. <br />\nThe celebration, at 6:pm on Friday, February 20, at St. <br />\nPeter’s Church, 54th Street and Lexington Avenue, in Manhattan, will call for freedom for all political prisoners. <br />\n“These are the people who gave their all, and we have to recognize them,” said Poynter. <br />\nA new movement is afoot. <br />\nBut, how can young people be expected to put their liberty at risk, when the prisoners of two generations ago are still behind bars? <br />\n“We cannot expect them to join in under those circumstances,” said Poynter. <br />\n“So, let us do something about it, if we truly are a movement people.<br />\n”\nThree Arrested as Obama Tries to Ram Secret Trade Treaty Through Congress\nCapitol Hill police charged three protesters with disrupting the Senate Finance Committee’s hearings on the Trans Pacific Partnership (TPP), a huge trade treaty that is being negotiated in secret. <br />\nPresident Obama wants Congress to give him authority to sign the pact, sight unseen. <br />\n“It’s going to strip jobs out of the country; it will lower wages and increase the wealth divide; it’s going to deregulate banking; it’s terrible for food and health and water – it’s just a monster,” said Kevin Zeese, of Popular Resistance. <br />\nHe urged opponents to go to StopFastTrack.com to pressure their congresspersons.<br /></p>\n"
}
