{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-01-27-12/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:26",
      "note": "",
      "size": 14507568,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/2ea6jk/GaryNullShow012712.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-01-27 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guests: Ralph Nader and Rocky Anderson</p>\n\n<p>Ralph Nader is without a second one of the most influential Americans during<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nthe past several decades. <br />\n He is directly responsible for many of our most important bills that have provided protection to consumers against the onslaughts of corporate short-term profits and Friedmanite free market, unregulated capitalism. <br />\nLandmark acts for Freedom of Information, Clean Water, Clean Air, Whistleblower Protection, Pension Protection, Wholesome Food, and others have been enacted by Congress were implemented due to Ralph’s tireless efforts to speak for the welfare of American citizens. <br /></p>\n\n<p>A graduate of Princeton and Harvard universities, Ralph has been a presidential candidate for five elections, building his platform on consumer rights, humanitarian and civil rights efforts, environmental sanity, and democratic government.\n<br /></p>\n\n<p>Ralph’s most recent book “Getting Steamed to Overcome Corporatism” targets many crimes being committed by corporate industries and government agenices that should steam us to take concerted action to protect democracy.\n<br />\nWe have joining us for today’s broadcast Ross “Rocky” Anderson who announced his candidacy to the Presidency and the launch of a new national party – the Justice Party – at the end of November.\n<br /></p>\n\n<p>Rocky is the former two-term mayor of Salt Lake City, serving from 2000 to 2008. <br />\nHe is the executive director of organization High Road for Human Rights. <br />\n Prior he practiced law in Utah for 21 years and was listed in Best Lawyers in America. <br />\n A former member of the Democratic Party, he left ver its evisceration of the Constitution and it having morphed as a flip side of the GOP.\n<br /></p>\n\n<p>Among his achievements and positions, which will have a chance to explore more thoroughly are:</p>\n\n<p>Listed by Business Week as one of the top 20 activists in th world on climate change and has received many awards from various environmental organizations\nRecognized by the Human Rights Campaign as one of the top 10 advocates for GLPT equality\nA leading opponent of invasion of Iraq and the only US mayor who advocated for the impeachment of George Bush\nAs mayor of Salt Lake City he succeeded in reducing incarceration of those convicted for minor crimes such as drug possession and rather created restorative justice programs that earned him his second World Leadership Award.\n<br /></p>\n\n<p><br /></p>\n"
}
