{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour/",
    "podcast": {
      "developer-note": "",
      "length": "1:54:37",
      "note": "",
      "size": 27508176,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/ayhgb7/ProgressiveCommentaryHour050712.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-05-07 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Ratlines – the secret networks giving sanctuary to Nazi and Ustashi war criminals and a look at the forces that have<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nshaped some of America’s most terrible recent events\nPeter Levenda is a philosopher and historian, who specializes in the interface between politics and religion and the occult. <br />\nIn the 1960s, for a very brief period he was involved with the American Orthodox Catholic Church, which had served as a front for American intelligence operations and was later implicated in the assassination of JFK.<br />\n  He has a higher degree in religious studies and has written extensively about Eastern and Western spiritual and occult traditions and their interconnections with political and criminal events. <br />\nPeter is a member of the American Academy of Religion, TAK (the religious studies honor society), and is a charter member of the Norman Mailer Society.\n<br />\nIn addition to his scholarly pursuits, Peter is a veteran of private business, having worked with trade with China for 25 years, and is author of the Mao of Business. <br />\nHe has lived and traveled extensively throughout Asia and other continents.\n<br />\nHe is best known for his research and study about Nazi occult beliefs – Unholy Alliance: A History of Nazi Involvement with the Occult – with a forward by Norman Mailer.<br />\n  His tome, Sinister Forces: A Grimoire of American Political Witchcraft is a monumental three volume set that we will touch upon during our conversation . <br />\nHis most recent publication is Ratline: Soviet Spies, Nazi Priests and the Disappearance of Adolf Hitler, a book that continues the research he began in Chile in 1979 about the escape routes for Nazi war criminals and scientists to the US, South America, the Middle East and as far as Indonesia and the far East.\n<br /></p>\n"
}
