{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-%e2%80%93-031815/",
    "podcast": {
      "developer-note": "",
      "length": "54:55",
      "note": "",
      "size": 19773590,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/8dcv5p/LeidStories_031815.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 18 Mar 2015 22:30:38 +0000",
        "timestamp": "1426743038"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2015-03-18 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Days Late, Dollars Short: Are Black Leaders Really Helping Chuy?\n&lt;!--more--&gt;\nAltered State: The Perpetually Surreal Universe of Hillary Clinton\nIt was an impressive show of support for Jesús “Chuy” García, the underdog in Chicago’s volcanic mayoral runoff slated for April 7. <br />\nOn March 9, an array of African American ministers, elected officials, community leaders and businesspeople, the Rev. <br />\nJesse Jackson prominent among them, pledged their troth to Chuy. <br />\nBusinessman Willie Wilson, who placed third in the Feb. <br />\n24 election, followed with his endorsement three days later.\n<br />\nHappy, happy, joy, joy. <br />\nBut are Black leaders really helping Chuy? <br />\nIs there a true coalition effort afoot here to put Rahm “Mr 1 Percent” Emanuel out of Chicago’s misery?\n<br />\nThat she finds herself in the eye of yet another firestorm calling her character, ethics and official conduct into question should be no surprise. <br />\nHillary Clinton, after all, is one-half of the most-often-subpoenaed-and-criminally-investigated couple ever to occupy the White House. <br />\nWith a reported six separate investigations currently in play over a private e-mail account and server she used when she was secretary of state, Clinton finds herself in familiar territory as a target of official inquiry and, possibly, prosecution. <br />\nHer response also is familiar—“I dare you to prove anything you think I did.<br />\n”\nIs she squeaky-clean innocent of all the charges and transgressions that have dogged her all these years? <br />\nOr, is it understood by all, in Hillary Clinton’s perpetually surreal universe, that she in fact is above the law?\n<br /></p>\n"
}
