{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse/",
    "podcast": {
      "developer-note": "",
      "length": "54:23",
      "note": "",
      "size": 13051152,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/g64xbw/NaturalNurse031411.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "The Natural Nurse"
  },
  "title": "The Natural Nurse",
  "date": "2011-03-14 00:00:00 -0400",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Nutrition Transition: Globalization and Trends in Nutrition and Health\nEllen Kamhi PhD, RN, www.naturalnurse.com<span class=\"ellipsis\">…</span>\n<!--more-->\ninterviews Dr Anna Kelles, Director of the School of Applied Clinical Nutrition at New York Chiropractic College. <br />\n Dr Kelles has dedicated her career to elucidating the connections between nutrition, human health, and the health of our environment. <br />\n   At Binghamton University she began a formal exploration into human and environmental health through a dual bachelor in Biology and Environmental studies. <br />\n She studied macrobiotic nutrition at the Kushi Institute and spent years in a remote Ecuadorian village exploring the nutritional status of children and household environmental conditions and promoting sound nutritional and environmental practices, and worked as a high school biology teacher and guide in the jungle. <br />\nDr Kelles earned a PhD in Nutritional Epidemiology from The University of North Carolina - Chapel Hill. <br />\n Her research explored the long term impact of globalization on divergent dietary and physical activity patterns between Filipino mothers and children. <br />\n   Dr Kelles has published several articles as well as a book chapter exploring deleterious dietary behavior patterns in developed and developing countries and subsequent policy recommendations. <br />\n Dr Kelles has assembled a team of expert faculty to deliver one of the only online graduate programs focused on whole foods therapeutic nutrition for  clinicians, at New York Chiropractic College.\n<br />\nContact: akelles@nycc.edu     PH: 315-568-3312\n<br /></p>\n"
}
