{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-030215/",
    "podcast": {
      "developer-note": "",
      "length": "56:42",
      "note": "",
      "size": 20415110,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/6prznf/LeidStories_030215.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2015-03-03 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Nukes &amp; Reactionaries: Boehner, Netanhayu and the Real Nuclear Threat\nChicago Hope: “Chuy” García’s Historic<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nChallenge to Big-Money Politics\nAttempting to lessen the presumed impact of Prime Minister Benjamin Netanhayu’s barnstorming speech before Congress tomorrow, the White House has published a brief touting “5 Things You Need to Know About the US-Israel Relationship Under President Obama.<br />\n” Summary: Billions in aid, strong defense of an ally, diplomatic help with its neighbors, high-volume trade, and millions to help with refugees.\n<br />\nProtocol-breaking House Majority leader John Boehner and his crass invitee Netanyahu nonetheless are banking on the speech to derail current US negotiations with Iran on its nuclear program. <br />\nBut it also can help Netanyahu and his right-wing Likud party get re-elected March 17, and help Boehner consolidate his fraying power among fellow Republicans while depriving Obama of much to boast about in his remaining two years.\n<br />\nLeid Stories explains the real nuclear threat that Netanyahu poses. <br />\n \n \nAll political eyes are on Chicago, where the incumbent mayor, Rahm Emanuel, unexpectedly finds himself in a dead heat with dark-horse candidate Jesús “Chuy” García, who last Tuesday shut Emanuel out of an easy re-election bid and forced him into a runoff April 7. <br />\nIt will be the first mayoral runoff in Chicago history.\n<br />\nOutspent 12 to 1, García, a Cook County commissioner, found victory in grassroots-coalition support and intense voter dislike of Emanuel’s policies and personality.\n<br />\nLeid Stories discusses the significance of García’s stunning showing.<br /></p>\n"
}
