{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-112513/",
    "podcast": {
      "developer-note": "",
      "length": "1:04:11",
      "note": "",
      "size": 15404267,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/pszami/PCH112513.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2013-11-26 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>HIV/AIDS Special – The AIDS industrial complex of misinformation and a look at AZT</p>\n\n<p>Clark Baker is a former officer of<span class=\"ellipsis\">…</span>\n<!--more-->\nthe LAPD in Los Angeles, who left after retirement in 2000 to become an independent writer and private investigator.  He is now the founder of the Office for Medical and Scientific Justice in Southern California, which spearheads investigations into the politics and fraud of various medical related groups and individuals, including the pro-AIDS industry and academia.  Clark serves on the Board of the Semmelweis Society International, a foundation that awards individuals for their scientific independence in innovative research and critical thought in the absence of invested interests.<br />\n  He has written extensively on his investigations into the activities of the pro HIV community. <br />\n   www.OMSJ.org    </p>\n\n<p>John Lauritsen is a retired market research analyst, author and gay liberationist and activist and currently the founder and head of Pagan Press, which publishes books that reach the gay community.  Earlier John wrote for the New York Native where he argued against the science behind HIV and AIDS and raised questions concerning the safety of AZT.<br />\n  More recently he is best known for his theoretical book, The Man Who Wrote Frankenstein which explores whether the real author of the novel by that name was written by Percy Bysshe Shelley and not his wife Mary.\n<br />\n \nJohn’s website is PaganPressBooks.com/ JPL where you can find a collection of his essays on AIDS, gay liberation and other subjects.    </p>\n\n<p>David Crowe is the President of the Alberta Reappraising AIDS and ReThinking AIDS, whose website he hosts at thewww.ReThinkingAIDS.com  website, a science and news resource on all international research and commentary challenging the current HIV/AIDS model.  David is also the former president and treasurer for the Green Party in Alberta Canada. www.ReThinkingAIDS.com \n<br /></p>\n"
}
