{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-union-labor%e2%80%99s-strategic-dead-end-112013/",
    "podcast": {
      "developer-note": "",
      "length": "56:59",
      "note": "",
      "size": 13678284,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/fwuah2/AlternativeVisions112013.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Union Labor’s Strategic Dead-End"
  },
  "title": "Union Labor’s Strategic Dead-End",
  "date": "2013-11-20 00:00:00 -0700",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus invites guests, Steve Early and Arun Gupta, to discuss ‘What Strategy for Union Labor in America’.  Dr.\n&lt;!--more--&gt;\nRasmus notes how union membership is now in freefall despite tens of millions of workers wanting to have a union today, how collective bargaining is in retreat now on the benefits as well as wages front, and how Labor’s political and industrial strategies of the past two decades have both produced little positive result. <br />\nDr Rasmus and guests discuss how US Labor’s political strategy of ever closer ties to the Democratic Party has resulted in virtually no gains for workers the past 6 years despite billions of dollars of union contributions to the party. <br />\nAnd how Labor’s industrial-bargaining strategy, focused on maintaining health and pension benefits in lieu of wage increases, is now being ripped apart as well by legislated health care and pension changes. <br />\nWith political-industrial strategies of the last two decades now in disarray, what are the alternatives for forging new strategies for organized labor in America? <br />\nJack and guests discuss what it means to say labor should embark on a path of more ‘independent political action’ and/or initiate new forms of industrial and bargaining, while reducing its reliance on the Democratic party and its primary focus on maintenance of benefits bargaining.\n<br /></p>\n"
}
