{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-wishful-thinking-092412/",
    "podcast": {
      "developer-note": "",
      "length": "1:03:03",
      "note": "",
      "size": 15134407,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/uyhvwk/GaryNullShow092412.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Wishful Thinking"
  },
  "title": "Wishful Thinking",
  "date": "2012-09-24 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>America’s epidemic of “wishful thinking” and hope in technology saving us – what this means for the fate of the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nnation\nJames Howard Kunstler is an award winning author of both fiction and non-fiction works. <br />\n His books focus on the degradation of American society as well as the causes of peak oil, economic crisis, and the degeneration of intellectual integrity that we read about in the daily news. <br />\n Jim’s writings focus on the challenges of American urban and suburban culture, including climate change, that may be leading to “converging catastrophes in the 21st Century”  His book “The Long Emergency”, directly dealing with these issues, has been considered prophetic by many.\n<br />\nHis novel, “World Made by Hand” was selected as a top five fiction pick in 2008 by National Public Radio’s “All Things Considered” – which portrays American rural life after a global peak oil crisis, economic collapse, war and the rise of mythological, radical religion.\n<br />\nHis most recent book is “Too Much Magic: Wishful Thinking, Technology and the Fate of the Nation\n<br /></p>\n"
}
