{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-the-global-oil-price-crash%e2%80%94what-are-the-consequences-121314/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:12",
      "note": "",
      "size": 21675065,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/6f4esd/AlternativeVisions_121314.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "The Global Oil Price Crash—What are the Consequences?"
  },
  "title": "The Global Oil Price Crash—What are the Consequences?",
  "date": "2014-12-13 00:00:00 -0700",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nJack Rasmus discusses the current global oil price deflation that began in earnest last June and is now accelerating, driving global oil from a prior 2014 high of $115/barrel to a recent low of $59.  Jack explains how the net effect on the global economy will likely prove to b significantly negative overall, and that the price decline could fall as low as $40/barrel in coming months.<br />\n  The impact on Emerging Market Economies, already seriously slowing or in recession, will also prove significant—causing their currencies to collapse even further and in turn generating capital flight, declining credit availability, slowing investment, rising inflation, and inability of emerging market businesses and governments to finance previous incurred debt. <br />\nOil price deflation will almost certainly push Europe and Japan into general deflation and further recession, and toward more QE money injections that will further generate asset price bubbles.  Rasmus predicts China’s current economic slowdown will continue in turn as Europe, Japan and Emerging markets slow their purchases of China exports.  The contrary popular USA notion that lower oil prices mean lower gasoline prices and therefore more spending by USA  consumers and businesses is challenged.  In conclusion, Jack discusses how oil deflation globally could set off another round of financial instability worldwide, and how it will likely mean the ‘shale gas/oil fracking’ boom in the USA will now stall and could potentially set off a ‘junk bond market’ crisis in the USA similar to the subprime market real estate bust of 2007-09.  Will the global oil glut and deflation lead to another ‘Asian Meltdown’, this time even more geographically dispersed;  and, in the USA, will it lead to another ‘oil patch’ crash that occurred in the US southwest in the 1980s—this time affecting North Dakota-Wyoming, Alaska, and Pennsylvania as well as Texas and the southwest?<br />\n  (Read Dr Rasmus recent posting on the PRN website, ‘The Economic Consequences of Global Oil Deflation’, for further analyses).\n<br /></p>\n"
}
