{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-dr-bart-billings-vera-sharav-042814/",
    "podcast": {
      "developer-note": "",
      "length": "56:09",
      "note": "",
      "size": 13478139,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/cetsvn/ProgressiveCommentaryHour_042814.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Dr. Bart Billings & Vera Sharav"
  },
  "title": "Dr. Bart Billings & Vera Sharav",
  "date": "2014-04-29 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nBart Billings is a retired Army Colonel, a former military psychologist and founder and director of both the military-wide Human Assistance Rapid Response Team Program to deal with combat stress and the International Military and Civilian Combat Stress Conference, which has been in existence for 21 years. <br />\nHe initiated the Congressional Hearing in February 2010 to tackle the growing relationship between psychiatric medication and the rise in military suicides. <br />\nIn 2014, Dr Billings was awarded the Human Rights Award from the Citizen’s Commission on Human Rights for his diligent efforts to bring greater public attention and awareness of the failures of modern drug-based psychiatry. <br />\nDr Billings has appeared on numerous television and radio programs including ABC’s Night Line and US News and World Report. <br />\nHe is currently completing a book on health and nutrition, The Psychology of Eating, and continues his advocacy for an integrative, wellness approach to combat stress and mental disorders to replace the current military psychiatric paradigm.\n<br />\nVera Sharav is the Founder and President of the Alliance for Human Research Protection, a national human rights and public interest information organization that exposes unethical research practices biomedical field, which undermine the dignity and rights and safety of people. <br />\nVera is particularly expert in the hidden dangers of psychotropic drugs and corporate and federal malfeasance in downplaying and/or ignoring their hazards. <br />\nHer efforts in the past have resulted in the suspension of the EPA’s pesticide experiments on children, exposing experimental AIDS drugs and vaccines in foster homes and standing up against Eli Lilly in federal court over the association of Zyprexa and diabetes. <br />\nHer advocacy has been featured in the Boston Globe and has resulted in the cessation of 29 clinical trials at the NIH. <br />\nHer articles and investigations can be found on the Alliance’s website at AHRP.<br />\norg.\n<br /></p>\n"
}
