{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-210/",
    "podcast": {
      "developer-note": "",
      "length": "56:32",
      "note": "",
      "size": 13571712,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/zprcic/GaryNullShow100411.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-10-04 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guest: Professor Tomas Sedlacek</p>\n\n<p>Professor Tomas Sedlacek is the chief macroeconomic strategist at CSOB, the largest<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nbank in Czechoslovakia, which won the Euromoney Award for Excellence in banking in 2011, a member of the country’s National Economic Council, and a lecturer of economics at Charles University in Prague – one of the oldest universities in the world – as well as at the University of New York in Prague and the Diplomatic Academy of the Ministry of Foreign Affairs of the Czech Republic. <br />\nProf. <br />\nSedlacek has shaken the study of economics and was named among the “Young Guns” and one of the “five hot minds in economics” by the Yale Economic Review.\n<br /></p>\n\n<p>Earlier he served as an economic advisor to the First Deputy Prime Minister and Minister of Finance in the Czech Republic and prior to that was the economic of advisor to President Vaclav Havel.\n<br /></p>\n\n<p>His recent book, “Economics of Good and Evil: The Quest for Economic Meaning from Gilgamesh to Wall Street” quickly became a best seller in Europe and completely rethinks the field and belief of economics as solely an objective science and re-introduces the moral principles required for a humanist view of economics that is truly progressive and can benefit all. <br />\nIt may be one of the most important books recently published in America to challenge economic determinism and make us think more imaginatively about our economic policies.\n<br /></p>\n"
}
