{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-090214/",
    "podcast": {
      "developer-note": "",
      "length": "57:2",
      "note": "",
      "size": 20642256,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/zn4fph/PCH_090214.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-09-03 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>How the rest of the world views the US and its Quest for Empire:</p>\n\n<p>Prof.\n&lt;!--more--&gt;\nGarry Leech is the director of the Center for International Studies and a lecturer in the Department of Political Science at Cape Breton University in Nova Scotia, Canada. <br />\nAs an independent journalist and author his research has focused upon the global struggle for social justice and on the US intervention in Colombia under the “war on drugs” and the “war on terror.<br />\n” Garry’s articles have appeared in numerous publications in the United States, Canada, Europe, Australia and Latin America. <br />\nFor eleven years he was the founding editor of the Columbia Journal, with over 350 scholarly articles. <br />\nHe is the author of seven books, dealing with Colombia, the drug trade, broader critiques of capitalist globalization and the influence of the fossil industry on global economics and politics. <br />\nHis most recent book is Capitalism: A Structural Genocide which takes a hard look at how contemporary capitalism’s inherent and fundamental structure generates inequality, violence, and increased human suffering and death. <br />\nHis website is GarryLeech.<br />\ncom. <br />\n    </p>\n\n<p>Roman Baudzus is an economist and financial analyst who has specialized in the software and marketing industries. <br />\nHe studied business informatics at Darmstadt University of Technology in Germany where he is residing. <br />\nRoman is a leading contributor to the German finance site Wirtschaftsfacts.<br />\nde and writes about the financial, gold and commodity markets for Gold Money. <br />\nHis articles have also appeared on GlobalResearch and Paul Craig Robert’s blog. <br />\n    </p>\n\n<p>Andre Vltchek is a journalist, novelist, filmmaker, poet, playwright and philosopher who has covered dozens of war zones and conflicts with a focus upon the plight of oppressed and colonized peoples around the world. <br />\nAmong these areas have been Bosnia, Ukraine, Timor and Indonesia, Peru, Sri Lanka, the Republic of the Congo and other African nations. <br />\nAmong his most recent books are “Fighting Against Western Imperialism” and “On Western Terrorist: From Hiroshima to Drone Warfare” – which was co-written with Noam Chomsky and will be turned into a film. <br />\nAmong his major documentaries are “Terlena about the Indonesian massacres in the 1960s, “One Flew Over Dadaab which is about the largest refugee camp in the world housing Somali refugees, and most recently The Rwanda Gambit, which challenges the official story about the genocide in Rwanda and the plunder of the Democratic Republic of the Congo. <br />\nAndre is also a senior fellow of the Oakland Institute and his articles and essays appear in CounterPnch, Asia Times, China Daily, Irish Times, Z Magazine and the Asia Pacific Journal. <br />\nHis website is AndreVltchek.Weebly.com.<br /></p>\n"
}
