{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-militarization-of-the-police-%e2%80%93-071914/",
    "podcast": {
      "developer-note": "",
      "length": "58:45",
      "note": "",
      "size": 14102152,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/3y8dkp/AlternativeVisions_071914.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Militarization of Police in the USA"
  },
  "title": "Militarization of Police in the USA",
  "date": "2014-07-19 00:00:00 -0600",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nJack Rasmus welcomes guest, Ali Issa, of the War Resisters League, to discuss the growing militarization of police forces in the USA today.<br />\n  What exactly is meant by ‘militarization’ of police vs. <br />\ntraditional policing activity is discussed—in terms of police use of military tactics, military weapons, and the growing ‘warrior mindset’ and psychology of police forces. <br />\nThe role of the US federal government in centralizing, coordinating, providing free military equipment, and increasingly funding local police forces, as well as the role of private corporations participating in the trend, in promoting police militarization are additionally discussed.<br />\n  Ali Issa explains the now expanding ‘Urban Shield’ government program now growing throughout the USA. <br />\nRasmus discusses the recently released ACLU report on police militarization in the USA, and asks if there is today also a trend toward ‘privatization’ of police forces as well, as in the US Military, as police agencies refuse to provide information about their militarization trend by claiming their new cross-city coordinating bodies formed under Urban Shield are not government agencies (as the Boston area NEMLEC is doing) and therefore don’t need to provide information to the public.  The consequences and outcomes of militarization of police in terms of violation of civil liberties, property destruction, rising personal injuries, and its disproportionate impact on communities of people of color, are described by Issa, as is the growing International trend of police militarization, as police globally share experiences how to militarily control crowds and public protests.<br />\n   Ali Issa is National Field organizer for the War Resisters League and Co-Coordinator for the ‘Facing Teargas Campaign’. <br /></p>\n\n<p>For more information on the topic of militarization of police in the USA, Urban Shield, NEMLEC, go to warresisters.org, facingteargas.org, and ACLU.<br />\norg.\n<br /></p>\n"
}
