{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-102114/",
    "podcast": {
      "developer-note": "",
      "length": "58:39",
      "note": "",
      "size": 21117090,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/4d8zcf/PCH_102114.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-10-22 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>The mass destruction of Iraq and Afghanistan, who’s responsible, and why - with Dahr Jamail and Dr.\n&lt;!--more--&gt;\nAnn Jones.<br />\n \nDahr Jamail has become a world renown investigate journalist for documenting the human cost of the Iraq and the growing misery in the lives of Iraqi citizens. <br />\nIn 2003, frustrated with media reporting on the middle east by embedded journalists, Dahr went to Iraq to report on the realities of the war himself hence becoming one of the very few independent journalists in the country. <br />\nHe has also reported from Syria, Lebanon, Turkey and Jordan. <br />\nHe has been a journalist for Al-Jazeera’s human rights department and was its online news producer based in Qatar. <br />\nHis stories appear on Truthout, TomDispatch, The Guardian, Le Monde, The Nation and other progressive news outlets.   He has received many prestigious awards including the Martha Gellhorn Award for Journalism, the James Aronson Award for Social Justice, the Joe Callaway Award for Civic Courage and four Project Censored awards.<br />\n Dahr has written several books. <br />\nHis most recent, co-written with William Rivers Pitt, is “The Mass Destruction of Iraq: The Disintegration of a Nation, Why it Happened and Who is Responsible”    His website is DahrJamail.<br />\nnet\nDr Ann Jones is seasoned war journalist and investigative reporter, a photographer and the author of eight books, now translated into ten languages. <br />\nSince 2002, Ann has reported from conflict zones in Afghanistan – where she was an embedded journalist –  South Asia, Sub Sahara Africa and the Democratic republic of Congo.<br />\n  Her focus has been on the impact of America’s wars upon civilians and the American soldiers who fight our wars. <br />\nHer most recent book is “They Were Soldiers:  How the Wounded Return from America’s Wars – The Untold Story,” which was supported by a fellowship from Harvard University, and paints a horrid picture of the dead, wounded and mutilated, brain damaged and drug addicted, and suicidal causalities within our military ranks and its effect on families and loved ones.  Her articles frequently appear in the Nation and TomDispatch.  Ann resides in Norway and her website is AnnJonesOnline.com<br /></p>\n"
}
