{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-key-trends-in-the-slowing-global-economy-011015/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:25",
      "note": "",
      "size": 22114079,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/a5827z/AlternativeVisions_011015.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Key Trends in the Slowing Global Economy"
  },
  "title": "Key Trends in the Slowing Global Economy",
  "date": "2015-01-12 00:00:00 -0700",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus surveys the most critical trends today in the global economy that continue to reveal a fragile condition,<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nreflective in recessions in Europe, Japan, Russia-Ukraine, and a growing number of emerging market economies as of year-end 2014. <br />\nA short list of trends discussed include a long run slowdown in the rate of growth of ‘real’ investment globally; a drift toward deflation in goods and services prices; a sharp rise in private sector debt—especially corporate debt and in particular corporate junk bond debt; the continued expansion of shadow banks and their ultra high net worth finance capital elite who keep financial asset bubbles brewing worldwide by diverting investment from real goods and services and therefore real jobs, wages, and consumer income growth; a shift toward a greater proportion of part time and temp workers as share of the total work force; wage stagnation and continued rise in income inequality worldwide, as capital incomes continue to accelerate while wages stagnate. <br />\nJack also gives a preliminary analysis of the USA’s 3rd quarter 2014 reported 5% GDP rise, explaining how the surge was due to temporary factors that have already begun to disappear in 2015, ensuring the USA’s return to its 5 year long ‘stop-go’ scenario.\n<br /></p>\n"
}
