{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-12-02-11/",
    "podcast": {
      "developer-note": "",
      "length": "1:03:42",
      "note": "",
      "size": 1000,
      "type": "audio/mpeg",
      "url": "http://www.podbean.com/empty/GaryNullShowl120211.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-12-02 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guest: Dr. Nancy Banks\nDr.\n&lt;!--more--&gt;\nNancy Banks was trained in OBYN medicine and gynecological oncology at Harvard Medical School and practiced general obstetrics and gynecology for over twenty-five years and as well pursuing practices in homeopathy and naturopathy. <br />\nDr Banks also has an MBA in Finance and conducts cutting edge research into the history of medicine. <br />\nShe currently resides in Guadalajara Mexico as a medical consultant and works with the Office of Medical and Scientific Justice, a private research firm founded by Clark Baker, that investigates allegations of medical and scientific corruption by government agencies, drug makers and research centers and their dissemination of junk science.\n<br />\nHer “AIDS, Opium, Diamonds and Empire: The Deadly Virus of International Greed” is a meticulously researched and documented tour de force that sheds like on the history of the financial and corporate oligarchic elites’ 100 year control of the medical pharmaceutical complex, the hidden motives behind the war on drugs, the diamond industry and the globalization of the false science behind AIDS\n<br /></p>\n"
}
