{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-010814/",
    "podcast": {
      "developer-note": "",
      "length": "1:04:36",
      "note": "",
      "size": 15504823,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/fyg9cw/GaryNullShow010814.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-01-08 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Are we falling off the climate precipice? How much time is left for humanity?\n&lt;!--more--&gt;\nDahr Jamail has become a world renowned investigate journalist for documenting the human cost of the Iraq and the growing misery in the lives of Iraqi citizens. <br />\nHe has been a journalist for Al-Jazeera’s human rights department and is currently the al-Jazeera’s Online News Producer based in Doha, Qatar. <br />\nHis reports and stories have are published frequently by The Nation, the Guardian, Foreign Policy in Focus, Le Monde Diplomatique, TomDispatch and other progressive news outlets. <br />\nHe has received many awards for his journalism, including four Project Censored awards.\n<br />\nDahr is the author of several books including “Will to Resist: Soldiers Who Refuse to Fight in Iraq” and “Beyond the Green Zone: Dispatches from an Embedded Journalist in Occupied Iraq”\nMore recently, Dahr has been focusing his attention on the future impact of climate change and global warming, highlighting the research and prognosis of leading climatologists who are warning of humanity’s dire future ahead. <br />\nHis website is DahrJamail.net<br /></p>\n"
}
