{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/the-infectious-myth-032415/",
    "podcast": {
      "developer-note": "",
      "length": "58",
      "note": "",
      "size": 20884046,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/gqr579/TIM_032415.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 24 Mar 2015 21:03:42 +0000",
        "timestamp": "1427249022"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "The Infectious Myth"
  },
  "title": "The Infectious Myth",
  "date": "2015-03-24 00:00:00 -0400",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>In Episode 52 of “The Infectious Myth” David talks about freedom of speech.\n&lt;!--more--&gt;\n“Je ne suis pas Charlie Hebdou” (I am not Charlie Hebdou) but that doesn’t mean that he is in favor of terrorism either. <br />\nFreedom of speech is a complicated issue, and despite all the rhetoric that followed the horrible massacre in January, the liberal west is not as open about freedom of speech as we’d like to think. <br />\nWe routinely censor hateful discussions against Jews and Blacks, because we saw where that led. <br />\nBut attacking muslims, who are a reviled minority with little power in most western countries, is fair game.\n<br />\n \nDavid also points out that suppression of speech extends to medical issues, particularly the HIV=AIDS dogma and vaccination. <br />\nHe ends with the discussion of the Dalhousie Dental students, who have been raked over the coals for vile sexist commentary on a private facebook group, commentary that nobody defended as freedom of speech, even though it occurred at about the same time as Charlie Hebdou.\n<br />\n \nBut the good thing is that the university handled the situation, not by strict punishments, to make an example of the men, but by a process of restorative justice. <br />\nWhich, David believes, is how we should deal with each other rather than always trying to divide the world into good and evil.<br /></p>\n"
}
