{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-061713/",
    "podcast": {
      "developer-note": "",
      "length": "58:47",
      "note": "",
      "size": 14109362,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/6xdb4z/PCH061713.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2013-06-18 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>21st Century Globalization, the legacy of past free trade agreements and the future EU and Pacific trade<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\npartnerships\nThea Lee is Deputy Chief of Staff at the AFL-CIO, where she has served as Policy Director and Chief International Economist. <br />\n Previously, she worked as an international trade economist at the Economic Policy Institute in Washington, and as an editor at Dollars &amp; Sense magazine in Boston. <br />\n Her research projects include reports on the North American Free Trade Agreement, the impact of international trade on US wage inequality, and on the domestic steel and textile industries. <br />\n She has testified before several Congressional and Senate committees on a variety of economic policy issues. <br />\n She also serves on the State Department Advisory Committee on International Economic Policy, where she co-chairs the Subcommittee on Investment and sits on the Board of Directors of the National Bureau of Economic Research.\n<br />\nMs Lee has appeared on numerous television and radio shows, including the PBS News Hour, CNN, Good Morning America, NPR’s All Things Considered and Marketplace. <br />\n She is co-author of “A Field Guide to the Global Economy” (New Press), an easy guide explaining free trade, the institutions such as the World Bank, IMF and WTO and these treaty agreements adverse impact upon citizens and American workers.\n<br />\nTimothy Wise is Director of the Research and Policy Program at the Global Development and Environment Institute at Tufts University in Medford Massachusetts, where he leads the Institute’s Globalization and Sustainable Development Program. <br />\nProf. <br />\nWise’s research focus has been on trade policies and treaties, global food security and rural development. <br />\nHe has written extensively on the impacts of the North American Free Trade Agreement (NAFTA) on Mexico and what lessons the NAFTA experience offers regarding future US trade agreements as well free trade impacts upon the global food crisis and commodity price speculation. <br />\nPrior to joining the Institute in 1999, he was the Executive Director of the international aid agency Grassroots International.\n<br />\nTim has written and co-written several books agricultural trade liberalization and global food security, including “Resolving the Food Crisis: Assessing Global Policy Reforms Since 2007”, and many articles on US trade policy and food security. <br />\nHis articles can be found on the Triple Crisis Blog at TripleCrisis.com\n<br /></p>\n"
}
