{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-081313/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:05",
      "note": "",
      "size": 14663158,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/5pmjjx/GaryNullShow081313.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-08-13 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The science supporting Tai Chi’s mental and physical health benefits, with Professor Peter Wayne. </p>\n\n<p> Professor Peter<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nWayne is an Assistant Professor of Medicine at the Harvard Medical School and the Director of Research at the Osher Center for Integrative Medicine, a joint institute founded by Harvard and Brigham and Women’s Hospital in Boston. <br />\n He is the founder and director of the Tree of Life Tai Center and during the past 35 years has trained with many internal martial arts masters. <br />\nDr Wayne’s work at Harvard focuses on clinical research to evaluate Tai Chi’s effectiveness as an alternative medical therapy for treating numerous medical conditions, including equilibrium disorders, cardiovascular health, osteoporosis, depression and pulmonary disease. <br />\nHis research, which has been supported by over 20 NIH grants, has been published in leading medical journals and he is the co-author of the recent book, “The Harvard Medical School Guide to Tai Chi: 12 Weeks to a Healthy Body, Strong Heart and Sharp Mind” published by Shambala Press.<br /></p>\n"
}
