{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-052812/",
    "podcast": {
      "developer-note": "",
      "length": "54:4",
      "note": "",
      "size": 13122769,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/dsegxb/PCH052812.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-05-29 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>The first in our weekly program that will feature important documentaries and their director – beginning with the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\ndocumentary Economics of Happiness by world renown environmental and social activist Helena Norberg-Hodges\nHelena Norberg-Hodges is an author, activist and filmmaker who is regarded by many as a pioneer of the “new economy” global movement. <br />\nEarth Journal included Helena among the 10 major environmentalists and she has appeared worldwide in the media.\n<br />\nEducated in Sweden, Germany, Austria, England and the United States, she specialized in linguistics, including studies at the University of London and at MIT. <br />\nSince 1975, she has worked with the people of Ladakh, or “Little Tibet” in the western Indian Himalayas, to find ways of enabling their culture to meet the modern world without sacrificing social and ecological values. <br />\nFor these efforts she was awarded the Right Livelihood Award, or ‘Alternative Nobel Prize’.\n<br />\nHelena is the founder and director of the International Society for Ecology and Culture based in the US and UK, an organization that examines the root causes of our current social and environmental crises, while promoting more sustainable and equitable patterns of living. <br />\nShe is also a founding member of the International Commission on the Future of Food and Agriculture, and a co-founder of both the International Forum on Globalization and the Global Ecovillage Network.\n<br />\nHelena’s book, Ancient Futures, has been described as “an inspirational classic”. <br />\nShe is also the producer and co-director of the award-winning film, “The Economics of Happiness”, which sheds on the failures and destruction wrought upon societies from corporate globalization and outlines a new economics based upon localization to rebuild communities.<br /></p>\n"
}
