{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/bill-and-hillary-clinton-must-answer-for-their-roles-in-the-iraq-crisis-061914/",
    "podcast": {
      "developer-note": "",
      "length": "57:4",
      "note": "",
      "size": 13843331,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/3hiwrz/LeidStories_061914.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Bill And Hillary Clinton Must Answer For Their Roles In The Iraq Crisis"
  },
  "title": "Bill And Hillary Clinton Must Answer For Their Roles In The Iraq Crisis",
  "date": "2014-06-19 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Even as President Barack Obama wrestles with an “appropriate” response to the crisis in Iraq, he knows he’s in a no-win<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nsituation. <br />\nThe fact that he’s reminded congressional leaders that he doesn’t need their signoff on any action he might take confirms that the push-and-pull of vested interests is intense.\n<br />\nObama and his administration are being called to account, even being blamed, for ending the bogus, nine-year, US-instigated war he didn’t start. <br />\nAnd he’s been saddled with the nightmare of doing damage control on the history of the nation’s outrageous conduct and foreign policy in the region.\n<br />\nPresident George Bush was a chief actor in this regard. <br />\nBut, says Leid Stories, it was President Clinton who started the war as “dual containment,” in behalf of Israel, of Iraq and Iran. <br />\nOn Hillary’s presidential campaign trail, he would lie and say he opposed the war [by Bush]. <br />\nAnd it was Hillary Clinton who not only supported the war as a US senator, but continued as secretary of state to push hardline policies against these and other emerging Muslim states—including the use of nuclear weapons against Iran.\n<br />\nThe Clintons must answer for their roles in the Iraq crisis.<br /></p>\n"
}
