{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-072914/",
    "podcast": {
      "developer-note": "",
      "length": "57:24",
      "note": "",
      "size": 20664504,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/hte2py/LeidStories_072914.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-07-29 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Strong-Arming Justice: The NYPD, Chokeholds and the Law\n \nIn the aftermath of the July 17 death of 46-year-old Eric<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nGarner—the Staten Island, NY, man who died after an aggressive arrest by police in which an illegal chokehold was used to subdue him—Mayor Bill de Blasio and Police Commissioner William Bratton are promising reforms of police procedure and retraining of the city’s 35,000-member police force.\n<br />\nBut Garner’s death is not the first to bring the continued use of chokeholds by police, outlawed since 1993, to light. <br />\nSome 1,022 chokehold complaints were filed with the city’s Civilian Complaint Review Board between 2009 and 2013; it investigated 462 of them, the CCRB said, but substantiated only nine of them. <br />\nSince Garner’s death, chokehold allegations have been made by at least three other individuals.\n<br />\nThe CCRB’s statistics highlight a longstanding problem—the prevalence of the outlawed maneuver and the rarity of police officers using it being caught and punished. <br />\nThis because there are many legal loopholes that favor police officers, says our guest, “Attorney-at-War” Alton H. <br />\nMaddox Jr. <br />\nThese loopholes and the culture of the law-enforcement and criminal-justice systems, he says, stack the deck against civilians seeking justice.\n<br /></p>\n"
}
