{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-011915/",
    "podcast": {
      "developer-note": "",
      "length": "55:28",
      "note": "",
      "size": 19969909,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/h7e2n3/BAR011915.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2015-01-19 00:00:00 -0500",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>MLK Would be “Shutting It Down”\nIf Dr. Martin Luther King Jr.\n&lt;!--more--&gt;\nwere alive, he would have joined in the 96-hour direct action and civil disobedience campaign coordinated by the ONYX Organizing Committee, in Oakland, California, this past weekend, according to activist Cat Brooks. <br />\n“He’d be shutting it down” at federal buildings and taking over freeways,” said Brooks. <br />\n“As in the later part of his life, he’d be connecting, loudly, the bloody dots of capitalism and gentrification with the systematic oppression and violence against Black and brown people in the cities.<br />\n”\nMan Who Recorded Eric Garner’s Death Has Court Date\nRamsey Orta, the Staten Island, New York, man who videotaped Eric Garner’s death by chokehold at the hands of a cop, appears in court January 25 on weapons charges. <br />\nOrta maintains police set him up in retaliation. <br />\nHis lawyer, Alton Maddox, said “It’s time for a reawakening of the people in New York City as to how grand juries should be employed.<br />\n” As it stands, prosecutors use grand juries as an excuse NOT to indict cops, said Maddox, whose license to practice law was revoked in 1990, in the wake of the Tawana Brawley case.\n<br />\nFrench Celebrate White Supremacy and Racist Values\n“’Je Suis Charlie’ has become an arrogant rallying cry for white supremacy,” wrote Ajamu Baraka, editor and columnist for Black Agenda Report and co-founder of the US Human Rights Network. <br />\nThe French “values” that are supposedly under attack are, in reality, “grounded in a colonial division between people who are recognized as humans, and those who have been consigned to the category of sub-humans and are eligible to be murdered, to have their lands taken, to be enslaved,” said Baraka. <br />\n“Those are the values that many of those people who embraced ‘Je Suis Charle’ were, in fact, upholding.<br />\n”\nRight On! <br />\nto Franz Fanon on His 90th Birthday\nDr Lewis Gordon, professor of philosophy and African American Studies at the University of Connecticut, spoke at the Pan-African Bazara, in Nairobi, Kenya, on the 90th birthday of Franz Fanon, the psychiatrist from Martinique who fought alongside the Algerians against French colonialism and wrote The Wretched of the Earth and Black Skin, White Masks. <br />\nFanon taught that “every group has to understand that it has the responsibility to set the conditions for its own freedom and emancipation,” said Dr Gordon. <br />\n“He argues that it is not enough to fight for material change; you need also to set the conditions for very new concepts” of human existence. <br />\nFanon died of leukemia in 1961.\n<br />\nBlack Colombian Women Defend Ancestral Land Rights\nIllegal gold mining operations are poisoning the environment and infringing on the land rights of African-descended people in Colombia, South America. <br />\nCharo Mina-Rojas, an organizer of women’s resistance to the incursions, said local authorities are collaborating with the mechanized mining operators. <br />\n“They are armed, but we have to expose ourselves to make sure that these people understand that these are our territories, we have rights there, and we are ready to protect them by all means necessary,” said Mina-Rojas.<br /></p>\n"
}
