{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-russ-baker-ray-mcgovern-072914/",
    "podcast": {
      "developer-note": "",
      "length": "58:22",
      "note": "",
      "size": 21013128,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/ihxgcy/ProgressiveCommentaryHour_072914.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Russ Baker & Ray McGovern"
  },
  "title": "Russ Baker & Ray McGovern",
  "date": "2014-07-30 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Russ Baker is an award-winning investigative reporter and journalist in the alternative media and founder of the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nindependent progressive news and analysis site, WhoWhatWhy.<br />\ncom. <br />\n Over the past two decades, he has produced over a thousand stories on a broad range of topics, from political revolutions to revolutionary humor. <br />\nAmong Russ’s breaking investigations were the Hutu-Tutsi massacres in Central Africa, the fall of the Berlin Wall and the overthrow of Romanian dictator Nicolae Ceausescu. <br />\n He has received Society of Professional Journalists, the Mencken and the Common Cause awards, and has served on the adjunct faculty at Columbia University’s Graduate School of Journalism. <br />\n His research into the rise and election of George W Bush led to his bestseller, “Family of Secrets: The Bush Dynasty, America’s Invisible Government and the Hidden History of the Last 50 Years.” His website is www.WhoWhatWhy.<br />\ncom \nRay McGovern served as an Army intelligence officer and a CIA analyst under 7 presidential administration, from the John F. <br />\nKennedy White House to that of George H. <br />\nW. <br />\nBush. <br />\nAmong his duties was preparing the President’s Daily Brief, which was a one-on-one to President Ronald Reagan’s most senior national security advisers.<br />\n  He was responsible for the analysis of Soviet intelligence regarding Vietnam. <br />\nSince retiring from government service, he has been one of our nation’s most vocal peace activists and journalists. <br />\nIn 2003, he helped create Veteran Intelligence Professionals for Sanity (VIPS) to expose the way intelligence was being falsified to “justify” war on Iraq.     \nRay’s opinion pieces appear in many leading newspapers here and abroad, including a major section in an important book, “Neocon’d Again” dealing with America’s war in Iraq.  He holds degrees in theology and philosophy from Fordham University, is a graduate from Harvard Business School and has a certificate of theology from Georgetown University.   His website is RayMcGovern.com<br /></p>\n"
}
