{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-the-resurging-immigrants-rights-movement-in-the-us-042614/",
    "podcast": {
      "developer-note": "",
      "length": "57:59",
      "note": "",
      "size": 13919922,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/h7sgf2/AlternativeVisions_042614.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "The Resurging Immigrants Rights Movement in the US"
  },
  "title": "The Resurging Immigrants Rights Movement in the US",
  "date": "2014-04-26 00:00:00 -0600",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nJack Rasmus welcomes grass roots immigrants’ rights leaders, Nativo Lopez and David Bacon, to discuss the new resurgence in the immigrants rights movement in the US  With deportations under the Obama administration now exceeding 2.<br />\n5 million since 2008—including half a million of legal US citizens (youth &amp; children or deported parents)—Jack and guests discuss the key demands of the immigrants rights groups today and the resurging activity at the grass roots. <br />\nJack asks guests why the Obama administration has not introduced executive orders to defend immigrants, while continuing to hide behind the failure to pass any legislation by Congress. <br />\nDavid Bacon explains that while millions are being deported, the administration has increased the numbers of ‘guest workers’ coming into the US to work in agriculture and elsewhere under sub-wage and sub-working conditions and bringing hundreds of thousands of skilled tech workers to the US while deporting record level millions back to Mexico, central America and elsewhere. <br />\nJack’s guests explain how free trade agreements, like NAFTA and CAFTA (and soon the TPP) play a key role in driving emigration to the US. <br />\nNativo Lopez discusses the key demands of the movement today, and in conclusion raises the question why 22,000 US agents are needed on the border today, developing new procedures for mass roundup and mass incarceration and detention in camps and rapidly expanding the use of drones and other technology. <br />\nIs the border control strategy in development today perhaps a ‘dress rehearsal’ for something yet to come throughout the US down the road?’\n \nDavid Bacon is a California writer and photojournalist, documenting the impact of the global economy, migration, and human rights..He was a founder of the Labor Immigrant Organizers Network, and board chair of the Northern California Coalition for Immigrant Rights, and a union organizer for two decades with the UFW and the ILGWU.<br />\nHis books include Illegal People – How Globalization Creates Migration and Criminalizes Immigrants (Beacon Press, 2008), The Children of NAFTA (University of California Press, 2004) and Communities Without Borders (Cornell University Press, 2006). <br />\nHis new book is The Right to Stay Home (Beacon Press, 2013), and is about the social movements seeking alternatives to displacing communities and criminalizing the migrants produced by displacement.\n<br />\n \nNativo Lopez is a leader of the immigrants rights organization, Hermandad Mexicana, and has been active in Mexican and Latin American undocumented workers’ rights groups and movements in the southern California area for decades.<br /></p>\n"
}
