{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-071513/",
    "podcast": {
      "developer-note": "",
      "length": "58:4",
      "note": "",
      "size": 14081463,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/r3w58x/PCH071513.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2013-07-15 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Democratizing our economy from the ground to build community and strengthen local sustainable economies that allow<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\npeople to be more locally self sufficient\nProf. <br />\nGar Alperovitz is the Lionel Bauman Professor of Political Economy at the University of Maryland and the founder of the Democracy Collaborative. <br />\nHe is a former fellow of politics at Harvard and Cambridge Universities and has served as a legislative director for the House of Representatives, the US Senate, and as a special assistant to the State Department. <br />\nProf. <br />\nAlperovitz has published numerous articles in peer reviewed journals and major media such as the New York Times and Washington Post. <br />\nHis focus has been on political economics that deal with class struggle and the conflict between government economic policies and democracy.\n<br />\nHis most recent book is What Then Must We Do?<br />\n: Straight Talk about the Next American Revolution,” which has been praised by Richard Wolf, Daniel Ellsberg, Naomi Klein and others for offering bottom up solutions for systemic economic change. <br />\nHis website is GarAlperovitz.com AND DemocracyCollaborative.<br />\norg\nSarah van Gelder is co-founder and executive editor of YES! <br />\nMagazine and YesMagazine.<br />\norg, one of the few remaining progressive publications challenging current dominant paradigms and offering feature powerful ideas and practical solutions for building a more just and sustainable world. <br />\nThe magazine, which was founded in 1996, recently won the Utne Reader Media Award for General Excellence.<br />\n  Sarah also sits on the board of the Positive Futures Network, and has founded and co-founded local community projects for low-incoming house, and building cooperative operations and ventures linking organic farmers to urban markets. <br />\nShe is also a board member of the Suquasmish Tribe and is part of the efforts to stop anti-Indian hostility and return lands where Chief Seattle once lived to the Suquamish people. <br />\nShe is the lead author of “This Changes Everything: Occupy Wall Street and the 99% Movement. <br />\nThe Website is YesMagazine.org\n<br /></p>\n"
}
