{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-corporate-strategy-part-ii-092714/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:2",
      "note": "",
      "size": 22080851,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/qkdseu/AlternativeVisions092714.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Corporate Strategy Part II"
  },
  "title": "Corporate Strategy Part II",
  "date": "2014-09-27 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus revisits and continues the discussion of the evolution and consequences of Corporate Strategies introduced<span class=\"ellipsis\">…</span>\n<!--more-->\nin the late 1970s-early 1980s (sometimes called Neoliberalism) that continue to evolve and intensify today.  In Part II of the discussion on Corporate Strategy in America (for Part 1 see the Alternative Visions show two weeks ago), Jack explains how the destruction of union labor membership since 1980 has also resulted in the near-collapse of collective bargaining as a means workers and unions to raise their wages and standard of living.  The transformation of collective bargaining from a tool to benefit Labor to a tool that increasingly benefits management and corporations is explained.  The elimination of National Bargaining and Pattern Bargaining in the 1960s-early 1970s and its replacement with Concessions Bargaining—first  wages and then benefits— is traced.  Unions’ ineffective strategic response to concessions bargaining in the 1990s with the introduction of Maintenance of Benefits Bargaining (MOB)–and the imminent demise of MOB today as corporate America and politicians together cooperate to phase out negotiated pensions and employer health coverage– is described.  The destruction of union membership ranks (Part 1 show) and the ‘inversion’ and destruction of collective bargaining (Part 2 show today) are one and the same event, Rasmus explains, both products of the corporate offensive launched in the 1970s that continues to evolve and gain momentum today.  With MOB at a dead end, and concessions bargaining expanding and deepening in the 21st century, workers and unions will have to devise a new approach and strategy to resurrect collective bargaining, Rasmus argues.<br />\n’ (In Part 3 future show, the political dimensions of the Corporate Strategy will be discussed, as well as Union Labor’s failed political counter strategy response since the 1970s).\n<br /></p>\n"
}
