{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-021813/",
    "podcast": {
      "developer-note": "",
      "length": "56:59",
      "note": "",
      "size": 13678655,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/agsq4h/PCH021813.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2013-02-18 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Paul Levy is a pioneer in the postmodern psycho-spiritual movement.\n&lt;!--more--&gt;\nHe has an academic background in economics and conducted economic research at Princeton. <br />\n Later he was the manager of the CG Jung Foundation Book Service, which provided him with the opportunity  toimmerse himself in the psychoanalytics and metaphysics of Carl Jung. <br />\nFor over 25 years he has studied with many accomplished Tibetan and Burmese Buddhist teachers, and been a serious student of Native American and world mythology\nPaul is the author of a truly groundbreaking and courageous book that explores the deeper psycho-spiritual dynamics behind our global madness and attempts to explain why so many are more willing to deny it rather than challenge it.  The book is “Dispelling Wetiko (Wet-eeko): Breaking the Curse of Evil”\nHis website is www.AwakenInTheDream.<br />\ncom\nDr Carolyn Baker has been an adjunct professor in history and psychology for over 7 years and a psythotherapist in private proactice for 17 years. <br />\n  She is among the few progressive writers who look at the unfolding of our global crises such as peak oil, the structural cracks in our free market capitalist system, and the US domestic and foreign policies from a psycho-spiritual perspective.   Her articles are frequently posted on the global blog Countercurrents\nCarolyn has written several books critiquing America’s religious fundamentalist culture and modern education.<br />\n  Her most recent books Navigating the Coming Chaos: Handbook for Inner Transition”  and before that “Sacred Demise: Walking the Spiritual Path of Industrial Civilization’s Collapse” – that together provide a compelling map of the economic, social, climatic and political terrain we are embarking upon and how to remain awake through it.\n<br />\nHer website is CarolynBaker.<br />\nnet\nDr Jim Garrison is the co-founder and president of Wisdom University – an innovative university offering masters and doctoral degrees based upon the model of full spectrum transformational learning. <br />\nAs the co-founder and President of the Gorbachev Foundation, he was instrumental in the founding of the State of the World Forum in 1995, which generated a global network of leaders and visionaries from all walks of life to define a template for a more sustainable global civilization.<br />\n  In 2000, he initiated the launch of the Commission on Globalization that challenged the existing global governance system and gathered leaders together to define viable alternatives.\n<br />\nJim has graduate degrees in religion and theology from Harvard and Cambridge universities. <br />\nAmong his books are “Civilization and the Transformation of Power “and “America as Empire: Global Leader or Rogue Nation”.\n<br />\nWEBSITE:  www.WisdomUniversity.org\n<br /></p>\n"
}
