{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-081413/",
    "podcast": {
      "developer-note": "",
      "length": "",
      "note": "",
      "size": 14904320,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/m5wn2c/GaryNullShow081413.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-08-14 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Surveillance tools developed and used in the Middle East and now employed against Americans and Washington’s war<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nagainst whistleblowers with Peter Van Buren.<br />\n </p>\n\n<p>Peter Van Buren has served with the Foreign Service for over 23 years. <br />\nHe received a Meritorious Honor Award for assistance to Americans following the Hanshin earthquake in Kobe, a Superior Honor Award for helping an American rape victim in Japan, and another award for work in the tsunami relief efforts in Thailand. <br />\nPrevious assignments include Taiwan, Japan, Korea, the UK and Hong Kong. <br />\nHe volunteered for Iraq service and was assigned as a Provincial Reconstruction Team or ePRT leader from 2009-10. <br />\nHis tour extended past the withdrawal of the last combat troops.\n<br />\nVan Buren worked extensively with the military while overseeing evacuation planning in Japan and Korea. <br />\nThe Marine Corps selected Van Buren to travel to Camp Lejeune in 2006 to participate in a field exercise that included simulated Iraqi conditions and later spent a year on the Hill in the Department of State’s Congressional Liaison Office.\n<br />\nHis recent book is “We Meant Well: How I Helped Lose the Battle for the Hearts and Minds of the Iraqi People” has greatly upset the bureaucrats in the state department and Washington for revealing the truth behind America’s failing reconstruction programs in Iraq. <br />\nHis website is WeMeantWell.com<br /></p>\n"
}
