{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-us-grass-roots-anti-war-protests-and-the-syrian-war-%e2%80%93-062814/",
    "podcast": {
      "developer-note": "",
      "length": "59:4",
      "note": "",
      "size": 14322625,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/qzvmdr/AlternativeVisions_062814.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "US GDP Drop & Shadow Banks"
  },
  "title": "US GDP Drop & Shadow Banks",
  "date": "2014-06-28 00:00:00 -0600",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nJack Rasmus continues his analysis of the growing influence and instability in the global shadow banking system, including a look at the major role being played by shadow banks in China today. <br />\nRasmus explains how shadow banks have been behind the historic $5 trillion in China municipal and provincial real estate (commercial, residential, industrial) debt boom since 2008 and China currency speculation. <br />\nRasmus provides a deeper historical analysis of shadow banks in US depressions since the 1830s, and the parallels with China today. <br />\n Continuing a key point from last week, its not just the shadow banks as institutions, but the ultra high net worth investors globally—the new financial global elite—that are behind the new financial instability building in the global financial system again. <br />\nShadow banks + Ultras + proliferating liquid financial asset markets and securities traded in these markets are at the heart of the next debt-deflation-default nexus. <br />\nRasmus concludes arguing that money capital flows in a capitalist system cannot be effectively regulated long term, and that’s why financial crises keep returning. <br />\nThe bigger the liquidity explosion, the greater the debt and financial speculation, and the more frequent and greater magnitude the financial crises. <br />\n Dr Rasmus concludes the show with an indepth look at the composition of the just announced -2.9% decline in first quarter US GDP, and debunks the mainstream view that the -2.<br />\n9% was due to the ‘weather’ and that the US economy and GDP will soon ‘snap back’ with a 4%-5% GDP growth rate, as now touted in the mainstream business press. <br />\nJack shows how business inventories, net exports, and consumer spending will continue to fare poorly, or modestly at best, in coming quarters—and that the US economy will continue its ‘stop-go’ economic trajectory that is characteristic of an epic recession and its aftermath.\n<br /></p>\n"
}
