{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg"
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/david-healy-and-pharmageddon-061714/",
    "podcast": {
      "developer-note": "",
      "length": "59:29",
      "note": "",
      "size": 14277277,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/2tqg73/InfectiousMyth_061714.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "David Healy and Pharmageddon"
  },
  "title": "David Healy and Pharmageddon",
  "date": "2014-06-18 00:00:00 -0400",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nDavid Healy (http://davidhealy.<br />\norg) is an insider to the psychiatric drug business, a psychiatrist and psychopharmacologist, as well as a scientist and author. <br />\nYet this did not stop him from pursuing the problem of  suicidal (and violent) behavior caused by SSRI antidepressants many years ago. <br />\nHis criticisms, and his appearances as an expert witness in trials of violent acts occurring after the prescription of these drugs, did not earn him any friends within the major pharmaceutical companies, which are making billions of dollars from these drugs, but somehow he managed to survive without his career being totally destroyed.\n<br />\n \nThe two Davids talk about some of the most shocking parts of his 2012 book, “Pharmageddon” (http://www.ucpress.edu/book.php?<br />\nisbn=9780520270985), such as his claim that anti-depressants are about as useful as alcohol in combatting depression and are very similar to the over-the-counter anti-histamines, and that if the drugs weren’t prescribed, people would probably stop taking them before they get to the point of no return. <br />\nThey discuss some of the ways that the pharmaceutical companies can bias clinical trials, by spinning negative trials into positive, by publishing only the trials that have positive results, and more darkly, possibly criminally, suppressing or manipulating data to avoid a negative finding against a drug (such an elevated risk of suicide or birth defects).\n<br />\n \nDr Healy holds surprising views on medicine, feeling that Evidence Based Medicine, Randomized Clinical Trials and Prescription-only medicines were only well-intentioned, but have all backfired.\n<br />\n \nPeople can push back against the system by using his website, http://wp.rxisk.<br />\norg, to find out about adverse events on drugs they are being prescribed, and even to report adverse events, much more easily than directly through official channels. <br />\nHe feels that a patient that goes to a doctor with evidence about adverse events is much more likely to have an adult conversation about the best drug to use, or even whether a drug is needed.\n<br /></p>\n"
}
