{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-the-demise-of-american-media-042913/",
    "podcast": {
      "developer-note": "",
      "length": "56:1",
      "note": "",
      "size": 13482423,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/pdnnqr/PCH042913.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "The Demise of American Media"
  },
  "title": "The Demise of American Media",
  "date": "2013-04-29 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nRobert McChesney is Gutgsell Endowed Professor of communications at the University of Illinois in Urbana.<br />\n  He specializes in the political economy of communication, the history of 20th century media and communication policy. <br />\nHe is the co-founder of Free Press, a national media reform organization and was the host of the weekly radio program “Media Matters” until 2012. <br />\nHe has written extensively on the death of American journalism. <br />\nHe has received many rewards from progressive forums. <br />\nUtne Reader listed him among the 50 visionaries changing the world in 2008.<br />\n  Right wing pundits have listed him as among America’s most dangerous academics, which is an honor we commend on this program.\n<br />\nHe has authored over 15 books on communications and the media. <br />\nTwo released this year are “Digital Disconnect: How Capitalism is Turning the Internet Against Democracy” and  “Dollarocracy: How the Money-Media Election Complex is Destroying America”\nWEBSITE:  www.RobertMcChesney.com\nRobert Parry is one of our leading progressive investigative journalists best known for his uncovering Iran-Contra story and Oliver North’s involvement which earned him the George Polk Award for National Reporting in 1984.  He current writes for Consortium News, and has covered many important stories on domestic and foreign affairs issues including the Nicaragan contra-cocaine connection, right wing terrorism, the demise of American media, the Bush and Obama presidencies, the rise and influence of the Neocons and our wars overseas.<br />\n  He has worked as a journalist for the Associated Press, Newsweek and PBS Frontline.\n<br />\nHe has written several books, his latest being “America’s Stolen Narrative: From Washington and Madison to Nixon, Reagan and the Bushes to Obama”\nWEBSITE:  www.ConsortiumNews.<br />\ncom\nMaria Armoudian is a fellow at the University of Southern California’s Center for International Studies and the host of The Scholars’ Circle and The Insighters heard on KPFK in Los Angeles and other stations as well as the Progressive Radio Network. <br />\nShe is the author of “Kill the Messenger: The Media’s Role in the Fate of the World” which details the power and influence of the media to shape the human condition.  For five years, Maria served as the environmental commissioner for the city of Los Angeles, working on civil rights issues, environmental protection and corporate reform.  Her writings have through the New York Times Syndicate, and on Alternet, The Progressive and other publications.  Her website is www.Armoudian.com\nBOOK:    “Kill the Messenger: The Media’s Role in the Fate of the World”\n<br /></p>\n"
}
