{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-040115/",
    "podcast": {
      "developer-note": "",
      "length": "57:19",
      "note": "",
      "size": 20633270,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/c9z6be/GaryNullShow_040115.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Wed, 01 Apr 2015 19:30:09 +0000",
        "timestamp": "1427934609"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2015-04-01 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Conversations with Remarkable Minds\nA view on the impact and results of climate change denialism from historians in the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nfuture – what brought about the collapse of Western civilization?\n<br />\nProf Naomi Oreskes is a professor in the history of science, specializing in earth and planetary sciences, at Harvard University.<br />\n  She holds degrees in mining geology from the Royal School of Mines at the University of London and a doctorate in Geological Research and the History of Science at Stanford. <br />\nIn the past she has consulted for the US EPA and the US National Academy of Sciences and has authored many essays and technical reports on economic geology.<br />\n  Prof. <br />\nOreskes received international attention on her critiques of scientific denialism with a focus on climate change and global warming. <br />\nHer book Merchants of Doubt, co-written with Erik Conway drew attention to the climate change debate as having parallels with debates over tobacco, acid rain and holes in the ozone layer and how vested interests manage to confuse the debate by casting unsubstantiated doubt. <br />\nHer most recent book is “The Collapse of Western Civilization: A View from the Future” – a short book that looks back at our time today and in the near future from the perspective of historians writing in the year 2393. <br />\nHer website is MerchantsOfDoubt.org<br /></p>\n"
}
