{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-102914/",
    "podcast": {
      "developer-note": "",
      "length": "58:08",
      "note": "",
      "size": 20932143,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/ux2rzg/LeidStories_102914.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-10-29 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>The Battle for Benton Harbor, Michigan, Unfolds in Weird Court Case\nSpooky!\n&lt;!--more--&gt;\nSharpton Plays A Trick on Ferguson As A Treat for Democrats\nWhirlpool Corporation has its eyes on Benton Harbor, Mich.<br />\n, an almost all-Black town of just over 10,000 on the shores of Lake Michigan that looks nothing like the toney estates and swank shops the company wants instead. <br />\nWhirlpool’s plan to gobble up the town was going well—until the Rev. <br />\nEdward Pinkney rallied the locals not only against the corporation, but also against co-opted elected officials, including the mayor, willing to execute its plan.\n<br />\nIn the aftermath of a Pinkney-led recall of the mayor, the fiery pastor found himself charged with five counts of election fraud—allegedly for changing dates on five petitions. <br />\nA report from the courthouse yesterday said none of the prosecution’s witnesses could say Pinkney altered any petitions. <br />\nLeid Stories gets an update today from Pinkney, who says his trial is “punishment” for organizing against Whirlpool and political corruption.\n<br />\nBloviator in Chief Al Sharpton swoops into Ferguson, MO, on a four-day mission, starting on Halloween (Oct. <br />\n31), to mine votes for the Democrats in the name of Michael Brown, killed by local police officer Darren Wilson on Aug. <br />\n9. <br />\nIt’s also a pacification program to keep the lid on growing outrage over the handling of the case and speculation that a grand jury will find no reason to indict Wilson.\n<br />\nLeid Stories discusses Sharpton’s trick-and-treat mission. <br /></p>\n"
}
