{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-081814/",
    "podcast": {
      "developer-note": "",
      "length": "56:3",
      "note": "",
      "size": 20341670,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/bkem38/BAR081814.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-08-18 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Police Brutality is Built into the System \n </p>\n\n<p> </p>\n\n<p>“Police brutality is not caused by a few aberrant, rogue cops.\n&lt;!--more--&gt;\nIt is a systemic problem that arises from the system of social, economic and political oppression that we live under,” said Larry Hamm, chairman of the Newark, New Jersey-based Peoples Organization for Progress. <br />\nAbuses persist, even in those cities that have community police review boards “because the use of violence against Black people has been necessary and condoned since the creation of the United States of America.<br />\n” You can’t keep people in slavery, or commit genocide against Native Americans, without massive applications of violence, said Hamm, speaking at the annual conference of the Black Is Back Coalition for Social Justice, Peace and Reparations, in Philadelphia.\n<br /></p>\n\n<p>Black Is Back Coalition to March on White House\n </p>\n\n<p>The police response to Black protest in Ferguson, Missouri, has called attention to the massive militarization of US police behavior and equipment. <br />\n“They call it surplus military equipment that they have given to police departments, but that’s not surplus,” said Black Is Back Coalition chairman Omali Yeshitela. <br />\n“The military budget includes the resources they are shooting into communities to control African people. <br />\nIt’s not surplus when you understand that the local police department is an extension of the same state apparatus that’s functioning today in places like Afghanistan. <br />\nThat’s colonialism,” said Yeshitela. <br />\nThe Coalition announced plans to march on the White House, on November 1, under the banner “Peace Through Revolution.<br />\n”</p>\n\n<p>Justice Department Should Review Every Police Killing of Unarmed Blacks\n </p>\n\n<p>The NAACP Legal Defense and Educational Fund called on the US Justice Department to mount a “comprehensive review of all police-involved assaults and killings of all unarmed individuals, with a particular focus on the killings of unarmed African Americans,” said associate director Janai Nelson. <br />\nThe review is one of four recommendations outlined by the LDEF in a letter to the Justice Department. <br />\n“There are concerns of over-policing in these communities, of ‘broken windows’ policing, of racial profiling, that has led to this disparate number of killings among African Americans,” said Nelson.\n<br /></p>\n\n<p>Mumia: “We are All Michael Brown”\n </p>\n\n<p>The Black people of Ferguson, Missouri, “have resisted every attempt to sidetrack or silence their efforts to achieve the arrest, prosecution and conviction of the white cop who shot and killed Mike Brown,” said Mumia Abu Jamal, the nation’s best known political prisoner, in a report for Prison Radio. <br />\n“The face of sweet-talking politicians promising peace; police with dark faces promising protection; preachers praying for placidity,” did not deter the protesters. <br />\n”They kept on marching for justice.<br />\n”</p>\n\n<p>“Broken Windows” Policing Must Go\n </p>\n\n<p>Robert Gangi, director of New York City’s Police Reform Organizing Project, has documented the racial bias inherent in the NYPD’s pursuit of so-called “quality of life” offenses. <br />\n“Police in New York arrest people for occupying two seats on the subway, even though it’s 2 o’clock in the morning and there’s nobody else in the subway car,” said Gangi. <br />\n“Far too much of the NYPD’s resources focuses on activities that are not criminal, that are not dangerous, that are not predatory; activities that are engaged in by people of color,” like selling loose cigarettes. <br />\n“The senseless death of Eric Garner at the hands of the NYPD is a worst-case scenario of what can happen with the aggressive application of broken windows po licing.”</p>\n\n<p><br /></p>\n"
}
