{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-the-affordable-care-act-obamacare-and-destruction-of-union-negotiated-health-plans-053114/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:34",
      "note": "",
      "size": 14536620,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/4vh32u/AlternativeVisions_053114.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "The Affordable Care Act (Obamacare) and Destruction of Union Negotiated Health Plans"
  },
  "title": "The Affordable Care Act (Obamacare) and Destruction of Union Negotiated Health Plans",
  "date": "2014-05-31 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n<!--more-->\nJack Rasmus and guest, Deb Silverstein, discuss how the ACA (Obamacare) program is now increasingly undermining union negotiated employer health insurance plans. <br />\nUnion contract negotiations now in progress, with expiration dates in 2018, face the imposition of a 40% tax beginning 2018 per the ACA. <br />\nEmployers are already responding by insisting union workers pay for the tax hike in their new contracts by reducing benefits, deleting coverage for spouses, converting full time workers to part time (who will have no coverage), and introducing other means of ‘cost shifting’ from employers to workers. <br />\n Union multiemployer health plans are being hit with an additional, second tax now as well. <br />\n Meanwhile, pleas by unions (Laborers International and others) to Obama that he allow their low paid members, to begin to receive government health insurance subsidies under the ACA are rejected by the administration. <br />\n Jack and Deb discuss why national union leaders allowed themselves to be maneuvered into this strategic dead end with the passage of the ACA in 2010 in the first place. <br />\nJack predicts the now emerging crisis for union negotiated health plans as a result of the ACA (which he predicted last year in a prior Alternative Visions show) will result in more strikes, more union contracts being unsigned, new contracts with less coverage for spouses and dependents, and more workers shifted from full time to part time status by employers in order to ‘cut and shift the costs’ to accommodate the coming 40% tax increase required by the ACA. <br />\nJack suggests local union leaders should convene a national convention of local union leaders to begin discussing solutions to the now intensifying attack on union health benefits, and to relaunch a national movement to replace ACA with  ‘Medicare for All’. <br />\n  Deb Silverstein has taught in public schools in Ohio for 30 years, and is the Ohio state director for SPAN, ‘Single Payer Action Network’, for the state of Ohio.”\n<br /></p>\n"
}
