{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-110314/",
    "podcast": {
      "developer-note": "",
      "length": "55:06",
      "note": "",
      "size": 19841997,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/gem9iw/BAR110314.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-11-03 00:00:00 -0500",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Black Agenda Report Celebrates Its 8th Anniversary\nThe internal struggle over political direction is a “primary<span class=\"ellipsis\">…</span>\n<!--more-->\nstruggle” for Black America, said Black Agenda Report executive editor Glen Ford, at BAR’s anniversary celebration at New York City’s historic Riverside Church. <br />\nMany activists understand the threat posed by “the capitalist state,” but are unclear about “how we deal with a Black Misleadership Class which acts in collaboration with the powers-that-be,” said Ford. <br />\n“For example, four out of five members of the Congressional Black Caucus this summer voted to continue Pentagon transfers of weapons and military gear to local police departments.<br />\n”\nUS Wages War on Blacks\n“I’m a revolutionary because I came to the conclusion a long time ago that America and capitalism and imperialism have no redeeming qualities at all,” said Omali Yeshitela, chairman of the Black Is Back Coalition for Social Justice, Peace and Reparations and an honored guest at the BAR affair. <br />\n“Twice a week a white policeman kills an African in this country,” according to the FBI’s own data, said Yeshitela. <br />\nYet, “somebody wants to convince us that Barack Hussein Obama represents some kind of progress in the struggle of our people. <br />\nIt is nonsense.<br />\n”\nFree All Political Prisoners!\n<br />\nLynne Stewart, the people’s lawyer who served 28 months in federal prison for the crime of zealously defending her client, was an honored guest and speaker at BAR’s anniversary. <br />\n“Is the ice beginning to crack” under the pressures of a growing movement against the U.<br />\nS criminal justice system? <br />\n“I sure hope so, because I dedicated the rest of my life to fighting for prisoners, and particularly, for political prisoners,” said Stewart, who was incarcerated at Carswell federal prison, in Texas, until her release for treatment of breast cancer, last New Year’s Eve. <br />\n“I told the women at Carswell, never give up. <br />\nFight, fight, fight!<br />\n”\nObama and Holder Uphold Status Quo\n“The first Black president and attorney general hold their positions precisely because they have no intention of rocking the boat or changing the status quo,” said BAR editor and senior columnist Margaret Kimberley. <br />\nThe corporate media are spreading Justice Department “leaks” that a grand jury does not have enough evidence to indict the Ferguson, Missouri, cop that killed Michael Brown. <br />\n“The narrative has changed from ‘hands up, don’t shoot’ to ‘Brown had it coming, he deserved it,’” said Kimberley. <br />\n“Their hope is to poison the well of public opinion and dampen expectations of Black people that anything resembling justice will come about.<br />\n”\nEject the Police from Black Communities\nWhistleblower, author and BAR editor and columnist Dr Marsha Coleman Adebayo said US police forces are direct descendants of pre-Civil War slave patrols, and Black people should view them as such. <br />\n“Would it really be a surprise that 92 percent of all arrests in Ferguson and 83 percent of all arrests in Washington, DC, are of Black folks, carried out by 21st century slave patrols,” asked Adebayo? <br />\n“When will we begin to demand that these communities come under some kind of receivership until they can develop their own system of civilian protection? <br />\nBecause, we need to get rid of the police in these communities, immediately.<br />\n”\nSellouts, Old and New\n“Our Black political class has made an historic deal with the devil,” said Bruce Dixon, BAR managing editor. <br />\nBooker T. <br />\nWashington and his ilk “agreed that there would be no disturbing of the economic and social peace for at least a generation or two” – a betrayal that elevated them to Black leadership at the turn of the 20th century. <br />\n“The current Black leadership class has a deal that they will not challenge capitalism, they will not acknowledge apartheid in Israel, they will not question America’s imperial wars,” said Dixon. <br />\n“They put all their eggs in the basket of electing Black faces to high places.<br />\n” Does Ferguson represent a new movement? <br />\nIt depends on whether young activists are able to organize alternatives to the current Black political class.\n<br />\nThe 500-Year Continuum of White Supremacist Violence\n“It was the conjoining of race and violence that resulted in the hegemony of the West,” said Ajamu Baraka, a BAR editor and columnist and former director of the US Human Rights Network. <br />\n“So, for us, Ferguson is not something that is unique. <br />\nWhat makes Ferguson different is that, for the first time in 15 or 20 years, we had an effective fight-back. <br />\nWhen they did that, the rest of us stood up, also,” said Baraka. <br />\nThe “end-game” is, “we’ve got to believe in the possibility of us winning. <br />\nRevolutionary change is still on the table.<br />\n”\nWe Charge Genocide\nDr Anthony Monteiro, a frequent BAR contributor who was fired from his position at Temple University’s Department of African American Studies because of his activism, hopes that “Ferguson will be the beginning of what WEB. <br />\nDubois called ‘the dusk of dawn,’ the end of the dawn and the beginning of the full daylight of resistance and struggle.<br />\n” The US should be charged with genocide under international law, as was advocated by Black left activists more than 60 years ago. <br />\n“Extreme poverty, lack of education, imprisonment, murder in the streets and gentrification…when you put all of this together, what we’re looking at is genocide against African American,” said Monteiro.\n<br />\nPoetic Justice\nBAR Poet-in-Residence Raymond Nat Turner threw down lines of struggle:“Drawing unemployment is like drawing strawsWe came up short under rich folks lawsLiving on nothing while hunger works full timeNo wonder some brothers stumble into crimeAnd the rich cry crime, crime, CRIME every dayWhile cocaine is being trafficked by the CIA.”<br /></p>\n"
}
