{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-chris-hedges-110612/",
    "podcast": {
      "developer-note": "",
      "length": "59:11",
      "note": "",
      "size": 14204343,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/djg6j/GaryNullShow110612.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Chris Hedges"
  },
  "title": "Chris Hedges",
  "date": "2012-11-06 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today, Gary begins with guest Chris Hedges. Later in the program: Are we headed back to the dustbowl of the 30s?\n&lt;!--more--&gt;\nAlso, a new study predicts a 6 degrees centigrade increase in temperature.\n<br />\nChris Hedges is one of our nation’s most insightful cultural critics and authors. <br />\nFor almost 20 years he was a foreign correspondent in war zones and conflicts in Central America, the Middle East, Africa and the Balkans, having reported for The New York Times, Christian Science Monitor and other news outlets. <br />\n While at the Times, Chris received the 2002 Pulitzer Prize for reporting on global terrorism. <br />\nThe same year he received Amnesty International’s Global Award for Human Rights Journalism.\n<br />\nChris’ most recent book, co-written the renowned cartoonist and author Joe Sacco, is “Days of Destruction, Days of Revolt”  – which takes a hard look at areas in the US that are the “sacrifice zones” – where the well being of people have been most impoverished in the name of profit and progress. <br />\n He also writes a weekly column for the award winning political blog Truthdig\n<br /></p>\n"
}
