{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-which-way-for-independent-political-action-part-ii-101814/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:3",
      "note": "",
      "size": 21784740,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/mfdi6u/AlternativeVisions101814.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Which Way for Independent Political Action: Part II"
  },
  "title": "Which Way for Independent Political Action: Part II",
  "date": "2014-10-18 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus invites presidential candidate of the Green Party, Jill Stein, to discuss the second in the series of shows<span class=\"ellipsis\">…</span>\n<!--more-->\non ‘which way for independent political action’.  Jill provides her party’s view of what strategies and tactics are on the agenda today in the USA to engage in independent political action, and how the Green Party’s approach differs from other progressive parties and other approaches that reject a political party form of organization for engaging in independent politics.<br />\n  Jill explains how the Green Party’s strategy is both electoral and orientation toward mass movements, which are expanding and growing on a number of ‘fronts’ in the USA—immigrants, low wage workers, community protests against fracking, anti-police repression, and so forth. <br />\nThe focus of the discussion is not on what’s wrong with the mainstream Republican-Democrat parties. <br />\nThat is assumed to be evident. <br />\nThe focus of today’s show is a discussion  on ‘how best to engage in independent political action’—and what strategies, tactics and organizational forms are today most relevant to building independent politics. <br />\nNext week’s third interview in the 4 part series on independent politics in the runup to the November elections will welcome former lead organizer for the Labor Party initiative that was launched by the AFLCIO in the 1990s, Mark Dudzic. <br />\nDudzic will discuss the history of that effort, its successes and eventual failure and whether another Labor Party initiative is on the agenda.\n<br /></p>\n"
}
