{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-010214/",
    "podcast": {
      "developer-note": "",
      "length": "1:06:35",
      "note": "",
      "size": 15982864,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/av7pyj/GaryNullShow010214.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-01-02 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>CONVERSATIONS WITH REMARKABLE MINDS\nWhere we are today at the start of 2014 in light of climate change, political,<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\neconomic, domestic militarization, and the collapse of the social order in the context of a spiritual renewal.\n<br />\nDr Jim Garrison is the co-founder and president of Wisdom University in San Francisco. <br />\nAs the co-founder and President of the Gorbachev Foundation, Jim was instrumental in the founding of the State of the World Forum in 1995, which gathered a global network of leaders and visionaries from all walks of life to define a template for a  more sustainable global civilization.<br />\n  More recently, Jim founded and serves as the President of Ubiquity University, an online international university offering affordable batchlors and advanced degrees to students unable to acquire a higher education and based upon integral and holistic educational modeling. <br />\nUbiquity works with partners in the EU, Brazil, India and Pakistan, Russia, Vietnam and other nations. <br />\nIn the late 80s he served as the executive director of the Esalen Institute Soviet-American Exchange, and founded the International Foreign Policy Association in collaboration with Secretary of State George Schultz and Georgian President Edward Shevardnadze to provide humanitarian relief to children in former Soviet republics.<br />\n  Jim has graduate degrees in religion and theology from Harvard and Cambridge universities. <br />\nAmong his books are Civilization and the Transformation of Power and America as Empire: Global Leader or Rogue Nation.  The websites are WisdomUniversity.org and UbiquityUniversity.org\n </p>\n\n<p><br /></p>\n"
}
