{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-061212/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:2",
      "note": "",
      "size": 14482333,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/yrcsks/GaryNullShow061212.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-06-12 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Why we need to pay attention to the FDA and its regressive policies\nJonathan Emord is one of the nation’s leading free<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nspeech attorneys who has remarkably defeated the Food and Drug Administration in federal court more than any other American attorney, earning him the title, “FDA Dragon Slayer.”  In 2007 he received the Cancer Control Society’s Humanitarian Award for “winning and preserving our great civil rights to life, to liberty, and to health freedoms.<br />\n”  Jonathan is the Chair of the Certification Board for Nutrition Specialists and a member of the Governing Council of the International Society of Regulatory Toxicology. <br />\n Formerly an attorney in the Reagan Administration’s Federal Communications Commission, Emord has practiced constitutional and administrative law in Washington, DC for the past twenty-five years. <br />\n He is routinely consulted by industry, Congress, and the media on regulatory issues that affect health freedom. <br />\n He is the author of several critically acclaimed books including The Rise of Tyranny (2008); Global Censorship of Health Information (2010) and “Restore the Republic (2012)” and is the American Justice columnist for USA Today Magazine.\n<br />\nScott Tips has been the General Counsel for the National Health Federation, the world’s oldest health freedom organization protecting citizen health rights since 1989. <br />\n In 2007 he became its acting president and is the organization’s editor of “Health Freedom News”. <br />\n He is the sole person representing health freedom to sit on the Codex Alimentarius commission, and has authored the book “Codex Alimentarius: Global Food Imperialism”\nScott is a graduate magna cum laude from UCLA and studied at the Sorbonne in Paris, and received his Juris Doctorate from the University of California Berkeley Law School.\n<br /></p>\n"
}
