{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-061112/",
    "podcast": {
      "developer-note": "",
      "length": "53:57",
      "note": "",
      "size": 12951719,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/fpm3j8/NaturalNurse061112.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "The Natural Nurse"
  },
  "title": "The Natural Nurse",
  "date": "2012-06-11 00:00:00 -0400",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Host, Dr.\n<!--more-->\nEugene Zampieron, www.drznaturally.com, interviews  Will Johnson.<br />\n”Will Johnson, the author of several books, including Breathing Through the Whole Body, The Posture of Meditation, Yoga of the Mahamudra, The Sailfish and the Sacred Mountain, and the award-winning The Spiritual Practices of Rumi, is the founder and director of The Institute for Embodiment Training in British Columbia, Canada. <br />\nHe received his BA, magna cum laude, in Art and Archaeology from PrincetonUniversity in 1968. <br />\nAfter working for several years as an art critic in New York, he moved to the west coast of North Americawhere, in 1972 he became a Buddhist practitioner and, in 1976, was trained as a Rolfer. <br />\nEmbodiment Training is a path of awakening that views the body as the doorway, not the obstacle, to personal growth and spiritual transformation. <br />\nThrough combining the orientation of western somatic therapy with eastern meditational practices, the multiple practices of Embodiment Training lead you to the discovery of your natural, embodied state that, like the Dzogchen rigpaor the Buddhist sunyata, has been described as “like coming home at last.” His website is www.embodiment.<br />\nnet.\n<br /></p>\n"
}
