{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/december-2-2010/",
    "podcast": {
      "developer-note": "",
      "length": "55:14",
      "note": "",
      "size": 13257360,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/ntbkxg/GaryNullShow120210edit.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "December 2, 2010"
  },
  "title": "December 2, 2010",
  "date": "2010-12-02 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Prof.\n&lt;!--more--&gt;\nHenry Pollack and his colleagues on the Intergovernmental Panel on Climate Change shared the 2007 Nobel Peace Prize with former vice president Al Gore. <br />\nPollack has been a professor of geophysics at the University of Michigan for more than forty years, travels regularly to Antarctica, and has conducted scientific research on all seven continents. <br />\nHe now serves as a science adviser to Al Gore’s Climate Project. <br />\nHe is the author of “Uncertain Science , Uncertain World”, and his most recent book is “A World Without Ice” which explores how for the first time in human history, the delicate relationship between human growth, rising industrial economies and what remaining ice there is in the world is at a dangerous precipice.\n<br />\nQUESTION:  First, explain to us how we need to stretch our imaginations to envision a world without ice as being similar to trying to imagine a world without trees or animals. <br />\n What would such world be like, and what does it tell us about a sustainable’s planet’s need for ice?\n<br />\nQUESTION:  What role does ice play in atmospheric conditions and the current debate over climate change. <br />\nIn short, in what ways do our lives depend on the earth’s ice regions?\n<br />\nQUESTION:  There is still a heated debate over rising sea levels with the melting of the polar caps and Greenland. <br />\n Review with us the two extremes of this debate and what does the most recent scientific data seem to confirm? <br /></p>\n\n<p>QUESTION:  There are those climate change skeptics, while maintaining there is in fact global warming, it is not due to human activity. <br />\n In your research and analysis in measuring ice flows and glaciers, what is some of the most compelling scientific evidence contained in the ice itself that proves human responsibility for global warming?\n<br />\nQUESTION:  According to most climate change activists, the Copenhagen was an extreme disappointment, and perhaps the only thing accomplished was adding to greenhouse gas levels by flying all the participants to Denmark. <br />\nNow the UN’s 2 week climate conference will commence on Monday, and already expectation for any kind of truly constructive international agreement to reduce carbon emissions is very low. <br />\n The US pledges at Copenhagen are almost laughable if it weren’t so sad – essentially offering only a 3-4 percent reduction by 2020 since it is based on 1990 levels. <br />\n At least the UNEP recognizes these pledges are unsustainable to prevent a 4 degree C increase by the end of the century.\n<br />\nSome analysts observe a war between two camps of nations: those who want to extend the Kyoto Protocol (by the way, which Japan just backed out of this week) and those who want to push forth the lame Copenhagen agenda, which is pretty much only a backroom deal between the US, China, India, Brazil and South Africa. <br />\n So I would like to hear your views on what we might expect from the Cancun summit, and then in the long term where do you think it will lead us in addressing climate change threats?\n<br />\nQUESTION:  What solutions do you see lying ahead before us? <br />\n And what kind of time frame do you envision governments need to agree on to reduce the greenhouse gas levels?\n<br />\nBOOK:   “A World Without Ice”\nWEBSITE:  www.WorldWithoutIce.com<br /></p>\n"
}
