{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "image",
      "url": "http://blackagendaradio.podbean.com/mf/web/zy85dj/BlackAgendaRadio_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-121012/",
    "podcast": {
      "developer-note": "",
      "length": "55:13",
      "note": "",
      "size": 13255602,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/ukxzu/BAR121012.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2012-12-10 00:00:00 -0700",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Wal-Mart-Free Newark\nAs “the leader in the retail industry in paying its workers the lowest wages,” Wal-Mart should be<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nbarred from doing business in Newark, New Jersey, said Larry Hamm, chairman of the People’s Organization for Progress. <br />\n“We need living wage jobs,” said Hamm. <br />\n“The minimum wage is a slave wage.<br />\n”\nWal-Mart Exploits Obamacare\nPresident Obama’s health care legislation has been a special boon to Wal-Mart, the world’s biggest corporation. <br />\n“What changes with Obamacare is that anybody making up to 133 percent of the federal poverty level now qualifies for Medicaid,” said journalist Mary Wheeler. <br />\nIn recent months, Wal-Mart has cut the hours of large numbers of workers. <br />\n“There’s a big incentive for Wal-Mart to make sure that as many of their employees are below the federal poverty level” as possible, said Wheeler.\n<br />\nMultinationals Super-Exploit Third World Workers\nLabor unions, elected officials and grassroots activists in New York demanded that multinational corporations be made accountable for working conditions at factories in the developing world. <br />\n“We must push them to sign the international Fire Safety Act and follow international labor laws,” said Fazi Foezia, a member of DRUM – Desis Rising Up and Moving – and a Bengladesh national. <br />\n“They exploit our workers and don’t pay taxes to our governments.<br />\n” Garment factory fires in Bengladesh and Pakistan have killed hundreds in recent months.\n<br />\nRaising Retail Wages Would Boost Economy\nA study by Demos finds that “raising wages in the retails sector at the largest employers to a threshold of $25,000 a year for full-time, year-round workers would bring a million and a half people out of poverty, generate between $11 and $15 billion in GDP, and create between 100,000 and 132,000 new jobs.<br />\n” Corporations would benefit, too, from a more loyal work force and greater consumer spending power.\n<br />\nDisaster Officials Offer Loans, Not Aid\nFederal officials are more concerned with generating loans to fatten the $1 billion a year disaster loan service industry, than in providing direct aid to victims of Hurricane Sandy, according to a study by Strike Debt, an offshoot of the Occupy Movement. <br />\nCredit-worthiness, rather than need, becomes the watchword, said Strike Debt spokesperson Pamela Brown. <br />\n“By using the lens of debt, they are exacerbating any kinds of inequalities that are already existing” in disaster-struck areas, “putting renters and minority communities” in additional jeopardy.\n<br />\nNo Charge, No Trial, No Justice\nCivil and human rights activists gathered at Central Connecticut State University, at New Britain, for a conference on preventive detention, last weekend. <br />\nPresident Obama’s preventive detention law, part of the National Defense Authorization Act, was designed to target “those who are engage in dissent,” said conference organizer Daniel Adams.<br />\n  Activists should also oppose more recent legislation that might exempt US citizens from detention without charge or trial. <br />\n“It’s got to be all of us or none of us,” said Adams.\n<br /></p>\n\n<p><br /></p>\n"
}
