{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/dr-erick-turner-explains-how-clinical-trials-can-be-biased-to-make-drugs-seem-better-than-they-really-are-111114/",
    "podcast": {
      "developer-note": "",
      "length": "57:22",
      "note": "",
      "size": 20655663,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/kh7vs2/InfectousMyth_111114.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 24 Feb 2015 20:00:00 +0000",
        "timestamp": "1424826000"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Dr. Erick Turner explains how clinical trials can be biased to make drugs seem better than they really are"
  },
  "title": "Dr. Erick Turner explains how clinical trials can be biased to make drugs seem better than they really are",
  "date": "2014-11-11 00:00:00 -0500",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>Drug companies have several methods to make drugs look better, but these organizations do not act alone.\n&lt;!--more--&gt;\nDrug researchers are also more interested in trials that show a positive effect with a new drug, and journals want to publish studies that change clinical practice. <br />\nThe mainstream media pick only a few studies as newsworthy, generally those that claim something earthshatteringly positive (or occasionally negative).\n<br />\nDr Erick Turner of the Department of Psychiatry, Oregon Health and Science University and also the Veterans Affairs Medical Center in Portland describes how these forces combine to reduce the likelihood that non-positive results (either showing no effect of a drug, or a negative effect) are ever published. <br />\nDr Turner also describes how statistical tricks can be used to find an effect after the trial is completed. <br />\nHe also describes how the FDA is putting much more information about clinical trials on its website, but it is not easy to find.<br />\n \nThe consequence of hiding neutral or negative data, known as publication bias, is that when a researcher does a meta-analysis that combines together all the published data, they may document a false benefit, because of the data that has hidden from them. <br />\nSince this process helps drug companies, researchers and journals, it continues, even though it does great harm to drug consumers.\n<br />\nAnother technique is known as outcome reporting bias or HARKing (Hypothesizing After the Results are Known) which involves changing the primary outcome measure to another type of measurement that gave more favorable results, such as switching from one scale of measuring depression to another. <br />\nThis can be planned ahead by collecting more data than you plan to use, and then picking and choosing based on the results each measurement produces.\n<br />\nOne of the ways to find out what has been hidden is to work with all the data. <br />\nThe FDA, for example, has virtually all the data on relevant studies, because clinical trials have to be registered. <br />\nThis data has been publicly available for many years, but is difficult to find. <br />\nA newer development is clinicaltrials.<br />\ngov, which also includes clinical trials that occur after drug approval and that are therefore inaccessible to the FDA. <br />\nSince Dr Turner once worked at the FDA he knows his way around the system.\n<br />\nTo see more information about the work of Dr Turner, and some useful figures, see: http://archive.sciencewatch.<br />\ncom/inter/aut/2009/09-may/09mayTurner/. <br />\nA presentation that describes some of his findings, entitled “Truth Telling and Suppressed Drug Research Data”, can be found at: http://www.ohsu.edu/xd/education/continuing-education/center-for-ethics/ethics-education/continuing-education/upload/Kinsman-Turner-talk-2.pdf<br /></p>\n"
}
