{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-obama-on-the-ropes-reeling-from-major-body-blows-070714/",
    "podcast": {
      "developer-note": "",
      "length": "59:07",
      "note": "",
      "size": 14190550,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/mdh257/LeidStories_070714.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Obama On The Ropes, Reeling From Major Body Blows"
  },
  "title": "Obama On The Ropes, Reeling From Major Body Blows",
  "date": "2014-07-07 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>A Gallup poll published last week found that approval of President Barack Obama has tanked to a six-year low, with<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nonly 29 percent of Americans saying he’s doing a good job. <br />\n(The poll also found that only 30 percent thought well of the US Supreme Court, and a paltry 7 percent gave Congress a passing grade.<br />\n)\nThe Gallup poll coincided with a Quinnipiac University survey that found one-third of American voters rated Obama the worst US president since World War II. <br />\nObama’s presidency began its downward spiral even before the halfway point of his first term.\n<br />\nPolls, of course, are not objective, nor are they necessarily fact-based. <br />\nBut they are useful indicators of attitudes, opinions and varying interpretations of reality, and, often, reasonable predictors of behavior and action.\n<br />\nWith this in mind, Leid Stories conducts its own poll today, asking listeners to rate Obama; identify the cause(s) of the president’s precipitous drop in popularity; whether he can rebound, and what impact, if any, the crisis of confidence in the president is having on their political attitudes and decisions this midterm election year.\n<br /></p>\n\n<p><br /></p>\n"
}
