{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-the-us-postal-service-african-americans-and-the-fight-for-jobs-justice-and-equality%e2%80%9d-031914/",
    "podcast": {
      "developer-note": "",
      "length": "56:34",
      "note": "",
      "size": 13578136,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/4i8jbe/LeidStories031914.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "The U.S. Postal Service: African Americans and the Fight for Jobs, Justice and Equality”"
  },
  "title": "The U.S. Postal Service: African Americans and the Fight for Jobs, Justice and Equality”",
  "date": "2014-03-19 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>The U.S. Postal Service: African Americans and the Fight for Jobs, Justice and Equality”\nThe U.S.\n&lt;!--more--&gt;\nPostal Service currently is the target of congressional committees seeking to implement “reforms” that will “right-size” and “modernize” its operations, they say, and put an end to its inefficiency and, most particularly, its reputed losses.\n<br />\n(The USPS is the only federal entity that is required, under the constitutionally questionable Postal Accountability and Enhancement Act of 2006, to prefund 75 years worth of retirees’ health benefits with current payments—amounting to $5.5 billion a year for the next 10 years.<br />\n)\nBut as was revealed in Leid Stories’ first edition on a series on the USPS (March 13), the government itself is the cause of the USPS’s fiscal woes, and the committees now pressing for “reforms” refuse to address, let alone investigate, how their own colleagues have used the USPS and its assets as a multibillion-dollar gift that keeps on giving. <br />\nThe push is for wholesale privatization, Leid Stories’ guests said, and the “reforms” calls for massive layoffs, closing post offices and selling the real estate, and increasing costs to consumers.\n<br />\nIn this edition, ex-letter carrier Philip F. <br />\nRubio, now associate professor of history at North Carolina A&amp;T State University in Greensboro and author of the award-winning There’s Always Work at the Post Office:African American Postal Workers and the Fight for Jobs, Justice and Equality and A History of Affirmative Action, 1619-2000, discusses the USPS as the epicenter of a struggle that yielded for African Americans social and economic mobility. <br />\nThe generational benefit of this struggle, he says, is threatened.<br /></p>\n"
}
