{
  "header": {
    "category": "the-wake-up-call",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thewakeupcall.podbean.com/e/wake-up-call-america-bankrupt-011714/",
    "podcast": {
      "developer-note": "",
      "length": "56:54",
      "note": "",
      "size": 13658593,
      "type": "audio/mpeg",
      "url": "http://thewakeupcall.podbean.com/mf/feed/iqshpg/WakeUpCall_011714.mp3"
    },
    "show": {
      "category": [
        "Business",
        "Investing"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/276914/Richard_Martin_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 23 Feb 2015 21:03:15 +0000",
        "timestamp": "1424743395"
      },
      "subtitle": "Your Economic Survival?  They're Not Looking Out For You.  We are.",
      "title": "The Wake Up Call"
    },
    "tags": [
      "Business",
      "Investing",
      "the-wake-up-call"
    ],
    "title": "America: Bankrupt!"
  },
  "title": "America: Bankrupt!",
  "date": "2014-01-17 00:00:00 -0700",
  "categories": [
    "the-wake-up-call"
  ],
  "content": "<p>America didn’t have to go bankrupt and it wouldn’t have done so if the American people had risen up and demanded<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nserious action. <br />\nBut most Americans are too willfully ignorant and/or intimidated by the size and scope of the problem to demand major changes to the irresponsible way the government does business. <br />\nWithout the American people insisting that Congress move, it remains so intent on increasing spending that it wouldn’t be behaving any other way if their goal had been to create a debt-driven economic collapse. <br />\nAnd if the country’s not bankrupt, how do you justify the concept of injecting more of the disease (ie debt) to the already-existing disease itself (yes, debt) hoping to cure the disease. <br />\nWhere’s the non-bankruptcy in all that? <br />\nThe US is facing a serious shortage of scientists (science, technology, engineering and math: STEM, for short). <br />\nRome also increased taxes and drove the people to poverty and desperation. <br />\nDidn’t work too well for them, did it?<br />\n  7 democrats are trying to pressure the media into giving more airtime to global warming. <br />\nGlobal temperatures have been cooling for 17 years and, according to a Russian scientist we could be looking at a new cooling period staring this year. <br />\nBen Bernanke indulges in a final orgy of self-congratulation to “demolish the skeptics”. <br />\nPoor, misguided fool. <br />\nYou can go home now, Benny-boy! <br />\nDrunk judge in Florida faces no legal consequences…<br /></p>\n"
}
