{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-billionaires-vs-teachers-the-vergara-court-decision-in-california-%e2%80%93-061414/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:2",
      "note": "",
      "size": 14482704,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/c3awkf/AlternativeVisions_061414.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Billionaires vs Teachers: The Vergara Court Decision in California"
  },
  "title": "Billionaires vs Teachers: The Vergara Court Decision in California",
  "date": "2014-06-14 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n<!--more-->\nJack Rasmus and guest, 40-year experienced teacher, Gretchen Lipow, discuss last week’s ‘Vergara’ legal decision in California—the latest example of a long series of efforts by politicians and corporate elites to blame teachers for the decline in the quality of K-12 public education in America. <br />\nDr Rasmus explains how David Welch, Silicon Valley tech billionaire, has been behind funding the movement and the legal suit that led to last week’s Vergara decision identifying teacher tenure as the cause of inner city schools’ student underachievement. <br />\nLipow explains how Teacher Tenure is just a diversionary tactic by opponents of teachers and public education, and why eliminating it will not change urban schools students’ underperformance, which is the consequence of many cultural-socio-economic factors. <br />\nLipow also points out the many procedures that already exist to eliminate poor performing teachers and how ‘tenure’ does not mean a guaranteed lifetime job but just the right to due process. <br />\nRasmus explains the bigger context of the Vergara decision: How Vergara is just the latest element in an intensifying decade long attack on teachers and public schools. <br />\nVergara is the latest element in a long term Corporate strategy to remake the public education system into a major new profit center for tech companies: No Child Left Behind, Race to the Top, Core Curriculum, Charter Schools are all examples, Rasmus explains, of the long term plan to standardize K-12 ‘product’ into pre-packaged software and hardware, that will de-professionalize the teacher profession in the process, eventually turn teachers into ‘technology monitors’ in the classroom, and cut education costs by eliminating teachers and lowering wages. <br />\nRasmus notes that lower costs from teacher de-professionalization means more spending on K-12 technology and more profits for the David Welch’s, the Bill Gates’, and other tech billionaires who are driving this long term strategy for K-12 education. <br />\nHowever, first teacher job security, unions, and bargaining rights must be gutted, Rasmus argues. <br />\nThe Vergara decision therefore represents the latest offensive in this longer term corporate initiative to recast public education into a new multi-billion dollar corporate profit center. <br />\n(For more on Dr Rasmus’s view on this theme, see posted on the PRN website his chapter, ‘The Privatization of Public Education’, from his forthcoming book, ‘America’s Ten Crises’). <br />\n  </p>\n\n<p>Gretchen Lipow has been a public school teacher for 40 years in New York City and Alameda, California. <br />\nShe has been an officer in her teachers union in Alameda and a member of the California Teachers Association (CTA) State Council, which determines union policy for 300,000 California teachers, and is currently President of the Retired Teachers Association in Alameda and Contra Costa County, California. <br />\nShe is also active in various Alameda Community initiatives and political activities.”<br /></p>\n"
}
