{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-072214/",
    "podcast": {
      "developer-note": "",
      "length": "58:39",
      "note": "",
      "size": 21119616,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/6n2yud/LeidStories_072214.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-07-22 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Fast Only When Furious?: U.S.\n&lt;!--more--&gt;\nMoves on War and Foreign Conflicts, Not So Much on Pressing Domestic Matters\nSight Unseen: Liberals Still Color-Blind to Centrality of Racism in American Life\nPresident Obama and Congress are uniformly fast, decisive and resolute in their response to wars and conflicts abroad—US interests and humanitarian concerns, they maintain, always at front and center of their actions. <br />\nGlobal conflicts are high-priority items on the legislative agenda, and the president and his detractors in Congress are able to hammer out policy decisions and multibillion-dollar allocations to support them in a hurry. <br />\nThey’re fast when they’re furious.\n<br />\nWhen it comes to domestic matters, however, it’s quite another story. <br />\nThey’re deliberate in their lack of speed while social and economic indicators suggest a rapid downturn for most Americans. <br />\nLeid Stories discusses the irony.\n<br />\nSen. <br />\nElizabeth Warren (D-MA), a progressive being prodded into a 2016 presidential bid, was a keynoter at the recent Netroots Nation convention in Detroit. <br />\nHer speech to the mostly white gathering of liberal-left organizers was a clarion call for action on a number of hot-button issues.\n<br />\nBut, says Leid Stories, Warren’s speech also pointed up a continuing problem with liberal-left politics—the refusal to acknowledge the centrality of racism to life in the United States, and the obligation of all progressive movements to condemn it and commit to fighting it. <br /></p>\n"
}
