{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-010713/",
    "podcast": {
      "developer-note": "",
      "length": "56:08",
      "note": "",
      "size": 13474197,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/kzmtfs/BAR010713.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2013-01-07 00:00:00 -0500",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Both Parties Sabotaging Entitlement Programs\nSocial Security, Medicare and Medicaid “have been set up to take the fall<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nfor the nation’s deficit,” said Dr Maya Rockeymoore, president of Washington-based Global Policy Solutions. <br />\nPresident Obama “views it as his legacy to rein in entitlement programs while creating this grand bargain” with the Republicans. <br />\nThose who expected a more progressive Obama in his second term are mistaken. <br />\n“I think that the president did not make a Freudian slip in his first debate when he said that he and Mitt Romney actually agree on Social Security.<br />\n”\nEPA Chief Used Alias\nLisa Jackson was forced to resign as chief of the Environmental Protection Agency because she conducted some of her public duties under an alias, said famed whistleblower Dr Marsha Coleman-Adebayo, of the NO FEAR Coalition. <br />\nJackson was “extremely upset” with the Occupy Movement, which staged demonstrations against “her cowardly behavior” as guardian of the environment. <br />\nDr Coleman-Adebayo believes Jackson used her alias to cloak her role in government spying on movement activists.\n<br />\nEnd Stop-and-Frisk\n“We feel that 2013 has to be a year of rising resistance to stop-and-frisk in the streets and in the courtrooms,” said Carl Dix, a founder of Stop Mass Incarceration Network. <br />\n“We’re not talking about mending an injustice; we’re talking about ending it.<br />\n” The capitalist system is incapable of providing a “future for millions and millions of young people growing up in the urban areas of the country,” said Dix. <br />\n“You can put Black faces in high places, but if it’s the same system that has oppressed and exploited you, it’s not going to change. <br />\nRevolution is the solution.<br />\n”\nBig Brother Obama Hears All\nPresident Obama has shown himself to be a more aggressive foe of civil liberties than George Bush. <br />\n“Absolutely, we’ve seen this to be true from the FISA authorization, to the use of drones, and with the NDAA” preventive detention bill, said Samantha Peetros, spokesperson for the Bill of Rights Defense Committee. <br />\nJust before New Years, Obama signed a five-year extension of legislation allowing warrantless phone and email surveillance.\n<br />\nCharters Crowding Out Public Schools in Philly\n“I think that there is a growing movement among decision makers to shut the door on public education,” said W. <br />\nCurtis Thomas, a Black state lawmaker from Philadelphia. <br />\nThe city has targeted 60 public schools for closing, while expanding charter schools by 5,000 seats. <br />\n“The decision to move kids towards these charter schools is really an effort to resegregate a system that was never totally integrated, anyway,” said Rep. <br />\nThomas.\n<br /></p>\n"
}
