{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-060914/",
    "podcast": {
      "developer-note": "",
      "length": "56:35",
      "note": "",
      "size": 13583778,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/62qb37/ProgressiveCommentaryHour_060914.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-06-10 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nAndrew Wakefield (Andy) is an gastroenterologist and academician specializing in inflammatory bowel disease and the measles-mumps-rubella vaccine or MMR. <br />\nHe is a former Fellow of the Royal College of Surgeons and has published over 130 original scientific papers and book chapters. <br />\nIn 1998, he and his colleagues at the Royal Free Hospital in London reported a novel inflammatory bowel disease in children with developmental disorders such as autism. <br />\n Dr Wakefield resisted pressure to stop his investigations into a possible link between vaccinations, intestinal inflammation and autism. <br />\nIn 2001 he was awarded the fellowship of the Royal College of Pathologists and he has been a board member of the American charity Medical Interventions for Autism. <br />\n  Dr Wakefield is the co-founder and director of the Autism Media Channel which has been airing on different television stations – www.AutismMediaChannel.<br />\ncom. <br />\nHis book “Callous Disregard: Autism and Vaccines, The Truth Behind the Tragedy” published by Skyhorse Press recounts his research into autism, the MMR vaccine and GI illnesses and his legal struggles by government and medical health authorities to discredit him and his work.\n<br /></p>\n\n<p>Dr David Lewis is a former senior research microbiologist with the US Environmental Protection Agency’s Research and Development department and the only EPA scientist to be a lead author on research published in Nature, the Lancet and Nature Medicine. <br />\nHe was responsible for discovering that HIV could be transmitted through certain dental equipment, which led to the standardization of heat-sterilization in dentistry. <br />\nHis research also forced the EPA to abandon the policy of promoting sewage sludge on farms, which subsequently forced him to lose his job when he turned his attention to studying illnesses and deaths associated with this practice – including biosolids link to autism. <br />\n Dr Lewis has received many awards and is currently the Senior Science Advisor to the national Whistleblowers Center. <br />\nHe has also reviewed the research of Dr Wakefield, which was provided to him personally by Andy, and has his own case going with Brian Deer. <br />\n He is the author of a recently published book:  “Science for Sale” which details how the US government uses powerful corporations and leading universities to support policies, silence top scientists, jeopardize public health and protect corporate profits. <br />\n </p>\n\n<p>Dawn Loughborough is the President of the DAIR Foundation, a non profit organization dedicated to defending the interests of physicians and scientific researchers working in the best interest of public and environmental health, and whose research has been suppressed. <br />\n DAIR has been supporting and generating funds for Dr Wakefield’s legal case. <br />\nShe is also the Principal of the Enterprise Solutions Group, a consulting firm providing IT solutions to the healthcare industry. <br />\n Dawn has three children, two who were injured following vaccination. <br />\n She has a Masters degree in Law Education from the University of Baltimore and a degree in journalism from Indian University. <br />\n Her website is DairFoundation.<br />\norg.\n<br /></p>\n"
}
