{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-conversations-with-remarkable-minds-072213/",
    "podcast": {
      "developer-note": "",
      "length": "59:11",
      "note": "",
      "size": 14207373,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/eypaez/PCH072213.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Conversations with Remarkable Minds"
  },
  "title": "Conversations with Remarkable Minds",
  "date": "2013-07-22 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Poverty in America and how Corporate America and the financial elites benefit from our ever-increasing inequality<span class=\"ellipsis\">…</span>\n<!--more-->\ngap\nProfessor Frances Fox Piven is a professor of political science and sociology at the Graduate Center of the City University of new York where she has taught for 30 years.  She served as the president of the American Sociological Association until 2007.  Prior to her arrival at City University, she was on the faculty at Boston University with Howard Zinn and Murray LevinMuch of Frances’ career has been a commitment to addressing those conditions leading to poverty.<br />\n  Her theory of ending  social reform, devised with her late husband Richard Cloward, became known as the Cloward-Piven Strategy – a plan to increase enrollment in social welfare programs designed to collapse the system that would force reforms leading to guaranteed annual income.\n<br />\nA life long social activist and public advocate, Frances has received many honors and awards and has written important books dealing with America’s wars against  it own people – including, “Challenging Authority: How Ordinary People Change America” and “The War at Home: The domestic Costs of Bush’s Militarism.”\nHer last book published in 2011 is “Who’s Afraid of Frances Fox Piven: The Essential Writings of the Professor Glenn Beck Loves to Hate”\n<br /></p>\n"
}
