{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-%e2%80%93-special-on-aids-%e2%80%93-010713/",
    "podcast": {
      "developer-note": "",
      "length": "54:11",
      "note": "",
      "size": 13004069,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/56zk74/PCH010713.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "special on AIDS"
  },
  "title": "special on AIDS",
  "date": "2013-01-07 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Prof.\n&lt;!--more--&gt;\nPeter Duesberg is  professor of Molecular and Cell Biology at the University of California at Berkeley.<br />\n  He was the first to isolate a cancer gene through his work with retroviruses back in 1970and mapped the genetic structure of this class of viruses. <br />\nHis work in retrovirus research awarded him an election to the National Academy of Sciences and Outstanding Investigator Grants from the National Institutes of Health.  Based upon his knowledge of retroviruses, he has been at the forefront in challenging the virus-AIDS hypothesis and has published in the world’s leading medical journals.<br />\n  As a consequence, Dr Duesberg’s hypothesis has won support from many scientists who have been outcast from publishing their views, including nobel laureates such Kary Mullis, inventor of PCR technology.\n<br />\nCelia Farber is a journalist who covered the HIV wars extensively since 1987, in various magazines. <br />\nSome of these writings are collected in her book: “Serious Adverse Events: An Uncensored History of AIDS” published by Melville House Press, (now Random House) in 2006.\n<br />\nActivist Michael Callen called Farber “..the best AIDS journalist in the world.”   Her 2006 article for Harper’s magazine detailing the corruption of HIV/AIDS research was titled “Out of Control: AIDS And The Corruption of Medical Science.<br />\n” Attacks from the AIDS industry on Celia’s research have been predictable and fierce. <br />\nNevertheless, she still won the 2008 Semmelweis Clean Hands Award for Outstanding Investigative Journalism.\n<br /></p>\n\n<p>Clark Baker is a retired officer of the LAPD in Los Angeles, who left in 2000 to become an independent writer and private investigator.  He is now the founder of the Office for Medical and Scientific Justice in Southern California, which spearheads investigations into the politics and fraud of various medical related groups and individuals, including the pro-AIDS industry and academia.  Clark serves on the Board of the Semmelweis Society International, a foundation that awards individuals for their scientific independence in innovative research and critical thought in the absence of invested interests.  He has written extensively on his investigations into the activities of the pro HIV community.<br /></p>\n"
}
