{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/the-infectious-myth-kristine-mattis-on-cancer-causes-100714/",
    "podcast": {
      "developer-note": "",
      "length": "58:36",
      "note": "",
      "size": 21097498,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/zrvwfi/TIM_100714.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Kristine Mattis on Cancer Causes"
  },
  "title": "Kristine Mattis on Cancer Causes",
  "date": "2014-10-07 00:00:00 -0600",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>Kristine Mattis is a PhD scientist who is concerned that the debate on cancer focuses on genes that might increase<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nsusceptibility rather than carcinogenic chemicals and radiation that are known to cause cancer. <br />\nIt’s not that she believes that genes are irrelevant, she doesn’t believe they are a cause, and that the presence or absence of carcinogens is more important. <br />\nPeople with genes might want to take actions to increase susceptibility, but then we are all susceptible, so that goes for all of us.\n<br />\nThere are personal actions that can be taken, such as eating organic and avoiding known carcinogens, but larger societal changes are needed, especially in the United States where industrial and economic interests are given much higher priority than the overall health of “We, The People”.<br />\n  It is perhaps old-fashioned to ask politicians to represent us, but this is a matter of life and death.\n<br />\nDavid was motivated to interview Kristine by this article in Counter Punch: http://www.counterpunch.org/2014/09/17/time-to-talk-frankly-about-cancer/\nI am sure you will enjoy this discussion and hopefully it will get you thinking differently about cancer as well. \nFor more useful information on preventing cancer, personally or societally, see the following links suggested by Kristine: \nhttp://www.ewg.org/skindeep/\nhttp://www.ewg.org/guides/cleaners\nhttp://www.preventcancer.com/\nhttp://www.silentspring.org/\n<br /></p>\n"
}
