{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-activists-111412/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:2",
      "note": "",
      "size": 12360516,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/fav3ks/AlternativeVisions111412.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Activists"
  },
  "title": "Activists",
  "date": "2012-11-14 00:00:00 -0500",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n<!--more-->\nJack Rasmus today introduces long time AFL-CIO union activists, Alan Benjamin and Donna Dewitt, to discuss the potential for independent labor political action in 2013 and  beyond. <br />\n Now that the November elections are over, voters will be surprised, Dr Rasmus predicts, how harshly the new economic program called the ‘fiscal cliff’ will result in deep cuts in programs like Medicare, Social Security, Education and middle class tax hikes—while big corporations will be even more tax cuts and subsidies. <br />\n Is this the time to begin independent political action, led by union and community activists? <br />\nIs it the time to consider building a third party? <br />\n Jack will discuss those questions with Benjamin and Dewitt.\n<br />\nDonna Dewitt is the just recently retired, former president of the South Carolina state AFL-CIO federation of labor. <br />\nDonna has been involved in South Carolina union and labor politics for 45 years. <br />\nAn activist in her union, the CWA local 3719, for thirty years, she then served as a member of the board of the South Carolina AFL-CIO, subsequently thereafter elected as the first woman to head the state’s AFL-CIO in 1996.\n<br />\nAlan Benjamin is a member of the Executive Board of the San Francisco Labor Council, AFL-CIO, a member and delegate from OPEIU Local 3. <br />\nHe’s a member of the National Steering Committee of US Labor Against the War, the International Coordinating Committee of the International Liaison Committee of Workers and Peoples, and a past organizer for Labor Party Advocates and the Labor Party in the US, as well as editor of ‘The Organizer’ labor newspaper. <br />\nBoth Ms. <br />\nDewitt and Mr Benjamin are members of the recently organized, ‘Emergency Labor Network’ of grass roots local union leaders in the US\n<br /></p>\n"
}
