{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/healthy-with-hiv-without-aids-drugs-031015/",
    "podcast": {
      "developer-note": "",
      "length": "57:17",
      "note": "",
      "size": 20624198,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/9kbfzs/InfectiousMyth031015.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Healthy with HIV without AIDS Drugs"
  },
  "title": "Healthy with HIV without AIDS Drugs",
  "date": "2015-03-10 00:00:00 -0600",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>In episode 50 of “The Infectious Myth”, David Crowe talks about long-term non-progressors, people who have lived with a<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\npositive HIV diagnosis, for many years, without taking drugs, or with taking them only for a short time. <br />\nAs well as people who stopped the drugs after several years, and whose health never completely recovered.\n<br />\n \nThe episode includes two interviews that were recorded for a recent AIDS special co-hosted by David and Gary Null. <br />\nThe first interview is with a man David calls Peter. <br />\nHe was diagnosed in a major American city in 1986, along with many other hemophiliacs. <br />\nHe was unusual in that his mother refused to give him AZT when first offered in 1987, and when he came of age, he continued this refusal. <br />\nAnd he’s happy today. <br />\nBut mad as hell, because he feel his life has been taken from him. <br />\nWhat if people knew he was HIV-positive? <br />\nWould he be shunned, or worse? <br />\nHis voice has been disguised.\n<br />\n \nFollowing this interview David gives some scientific information indicating that hemophiliacs were being diagnosed with HIV and with low CD4 cell counts from the immunosuppressive effects of lower-purity clotting factor, something that disappeared with higher purity factor, not with the elimination of HIV from the blood supply, although that took credit.\n<br />\n \nThe second interview is with German Film Maker Anne Sono who documented the lives of 6 women who were all, at the time of filming, HIV-positive and healthy. <br />\nThis didn’t last, unfortunately. <br />\nTragedy dogs HIV+ people. <br />\nOne of them couldn’t get treatment for non-AIDS conditions without going on AIDS drugs. <br />\nOne was murdered under mysterious circumstances. <br />\nOne had a healthy child without HIV, and then had a child taken from her. <br />\nOne of them was savagely attacked by the judicial system.\n<br />\n \nDavid ends with some information on the drug AZT, which was given to all HIV positive people in the 1980s and to most in the 1990s, but that is forced on HIV-positive pregnant women and their children. <br />\nThis is one of the big, but little known, tragedies of the HIV era.<br /></p>\n"
}
