{
  "header": {
    "category": "the-news-dissector",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenewsdissector.podbean.com/e/the-news-dissector-in-the-halls-of-justice-041813/",
    "podcast": {
      "developer-note": "",
      "length": "53:21",
      "note": "",
      "size": 12806269,
      "type": "audio/mpeg",
      "url": "http://thenewsdissector.podbean.com/mf/feed/myrrbp/NewsDissector041813.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://thenewsdissector.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Fri, 19 Sep 2014 16:24:15 +0000",
        "timestamp": "1411161855"
      },
      "subtitle": "h",
      "title": "The News Dissector"
    },
    "tags": [
      "News & Politics",
      "the-news-dissector"
    ],
    "title": "In The Halls of Justice"
  },
  "title": "In The Halls of Justice",
  "date": "2013-04-18 00:00:00 -0600",
  "categories": [
    "the-news-dissector"
  ],
  "content": "<p>One reporter had the scoop on the day after the 2012 election, when the lawyer for Bradley Manning, the young Army<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nprivate accused of leaking more than 500,000 classified documents to WikiLeaks, stood up in the courtroom and announced that Manning would be taking responsibility for providing some of the documents.\n<br />\n“This was an incredible development in the court-martial,” recalls Kevin Gosztola, an independent journalist covering the hearings for the websiteFiredoglake. <br />\nWith no mainstream reporter in attendance, suddenly, Gosztola was being called upon and linked to by news organizations all over the world, including FRONTLINE.\n<br />\n“That’s when I realized that I, as a more independent journalist, had a critical role to play,” he says.\n<br />\nWeeks later, on the two days Manning himself took the stand to testify about his treatment in military prison, more news organizations were represented, but most left shortly afterwards. <br />\nCritics turned up the heat on news organizations for not paying closer attention to the hearings.<br />\n  The New York Times own ombudsman took the paper to account.\n<br />\nGosztola is reluctant to beat up on the established news organizations — he says he recognizes many are strapped for resources these days — but still thinks the lack of coverage overall has been “shameful.”\nHe doesn’t let other independent journalists off the hook though.<br />\n  “We’re missing established journalists, but we’re missing independent journalists” Gosztola says. <br />\n“We’re missing other journalists from organizations based in the DC area who could be covering this story. <br />\n I don’t understand why there aren’t more journalists covering these proceedings.<br />\n”\nThe military justice system is not always easy to report on. <br />\nThere’s no rule that requires the military to make it easy for court reporters, and the amount of access can vary wildly.<br />\n  In the Manning proceedings, the government does not provide access to court filings, motions, or transcripts. <br />\nIn this regard, the military commissions at Guantanamo are a model of transparency in comparison.\n<br /></p>\n"
}
