{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-021813/",
    "podcast": {
      "developer-note": "",
      "length": "55:46",
      "note": "",
      "size": 13385770,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/mvihmf/BAR021813.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2013-02-18 00:00:00 -0500",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Blacks Rally to Save Camden NJ Police Department\n“This is a public safety issue, it’s a labor issue, and it’s a<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\npolitical issue,” said Larry Hamm, chairman of the People’s Organization for Progress and featured speaker at a rally to prevent the shutdown of the police department in mostly Black and Latino Camden, New Jersey. <br />\nThe financially distressed town would be patrolled by police from the surrounding, mostly white county. <br />\nIt’s a matter of self-determination, said Hamm. <br />\n“They’re not going to stop with taking over the finance department; they’re not going to stop with taking over the schools; they’re not going to stop with the police force.”\nObama’s Orwellian Peace\nPresident Obama’s claim that he will end the US war in Afghanistan in 2014 makes sense only in the language of George Orwell’s 1984, said David Swanson, publisher of the influential website WarIsACrime.<br />\norg. <br />\nThe president is actually planning to take US troop strength “down to almost what it was when he moved into the White House, and calling it ‘peace,’” said Swanson. <br />\n“And we’re calling drone wars ‘peace.<br />\n’”\nRIP. <br />\nRule of Law\n“There’s been a very steady dismantling of the rule of law, both domestically and internationally, begun by the Bush administration and furthered by the Obama administration,” said veteran journalist Chris Hedges, one of the plaintiffs challenging the law allowing preventive detention of American citizens. <br />\nUS lawlessness abroad “has been accompanied by a savage assault on our most basic constitutional rights,” said Hedges, “giving the executive branch the right to kill Americans.<br />\n”\n“Blowback” Coming After Dorner’s Demise\nChris Dorner, the former Los Angeles policeman and NAVY special operations officer who died in a fiery shootout, last week, was a “universal soldier,” said investigative journalist Mike Rupert. <br />\n“I don’t think the LAPD or any police department will now so cavalierly terminate any combat veteran, for any reason,” said Rupert, who is also a former LAPD cop.\n<br />\nA friend and former athletic teammate of Dorner, identified only as “Ben,” told KPFA radio’s Davey D: “We watched this brother be assassinated on TV. <br />\nThere will be a blowback from this.<br />\n”\nResolved: Corporations are Not Citizens\nMove to Amend activist George Friday appeared with Rep. <br />\nRick Nolan (D-MN) at a press conference following Nolan’s introduction of a constitutional amendment to deny corporations the rights of citizens. <br />\nMany millions of Americans, said Friday, “are ready to stand up against the inappropriate, illegitimate use of corporate power and corporate constitutional rights.”<br /></p>\n"
}
