{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-218/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:43",
      "note": "",
      "size": 14572080,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/qm2g6h/GaryNullShow101411.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-10-14 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guests: Mickey Huff and Peter Phillips\nMickey Huff is an Associate Professor of History at Diablo Valley College in<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nCalifornia where he specializes in the history of the American media, critical thinking and popular culture. <br />\nHe is also the Associate Director of the Media Freedom Foundation and Project Censored, which was the recipient of the 2008 PEN Oakland National Literary Censorship Award\nAlong with Peter Phillips, is the primary editor of the recent annual edition of Project Censored – Censored 2012 – which presents the top censored sorties and media analysis for the years 2011.\n<br />\nPeter Phillips is a professor of Sociology at Sonoma State University in California where he teaches courses in political sociology, media censorship, and the sociology of power and the media. <br />\nHe is the former founding director of Project Censored, an internationally known research program and watch organization that annually identifies the “Most Censored” news stories not appearing in mainstream media\nProf. <br />\nPhillips has written many oped investigative pieces for news soures such as Counterpunch, Common Dreams, Social Policy, Free Inquiry and others, and appears frequently as a guest on TV shows such as Talk of the Nation, the World Radio Network and Jim Hightower’s program<br /></p>\n"
}
