{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-082714/",
    "podcast": {
      "developer-note": "",
      "length": "56:44",
      "note": "",
      "size": 20429928,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/ypundg/LeidStories_082714.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-08-27 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Ferguson, MO: What It’s Saying to America and the World\nProtest over the Aug.\n&lt;!--more--&gt;\n9 police killing of Michael Brown continued yesterday, a day after his burial, but with a change of venue, to City Hall in downtown St. <br />\nLouis. <br />\nThere protesters demanded the arrest and prosecution of Police Officer Darren Wilson for killing Brown, and a transparent investigation of another police killing 10 days after Brown’s death—that of 25-year-old Kajieme Powell, just four miles from Ferguson.\n<br />\nWitnesses described Powell as pacing and acting erratically outside of a convenience store. <br />\nCell phone video recorded two officers firing several rounds at Powell within seconds of arriving on the scene. <br />\nPolice reports said he had taken two power drinks and donuts from the store and was holding a knife when they encountered him outside. <br />\nEyewitnesses said he posed no threat to the officers or anyone else.\n<br />\nFerguson has become a stark symbol of the dissonance between the America that is pridefully talked about and the America that is. <br />\nIn this month of August, the predominantly African American small town has jarred the conscience and attention of the nation, placing  at front and center, once again, the centrality of race and race oppression in America. <br />\n \nLeid Stories asks listeners: What has Ferguson taught you?<br /></p>\n"
}
