{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-100114/",
    "podcast": {
      "developer-note": "",
      "length": "54:11",
      "note": "",
      "size": 19510632,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/bsxdgm/LeidStories_100114.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-10-01 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>In the Matters of Ferguson, MO: The Unseen Legal Battles Over Rights\nDetroit: Yet Another Round of Court for Activists<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nWanting Their City Back\nTwo months since Ferguson, Missouri, erupted in protest over the shooting death of 18-year-old Michael Brown by Police Officer Darren Wilson, and the small predominantly African American city remains taut and on edge as it tries to reassemble itself with a template of its own making. <br />\nMeanwhile, the old one still is in effect, and it continues to wreak havoc.\n<br />\nTony Rothert, legal director of the American Civil Liberties Union of Missouri, discusses cases his office has litigated that provide a snapshot of the root of long-simmering tensions in Ferguson and in other communities of color across the state.\n<br />\nWithout even a functioning court in their forced-into-bankruptcy city to hear their case, a group of activists must travel an hour out of town to Ingham County Circuit Court to legally challenge the state’s takeover and decimation of Detroit’s public-school system.\n<br />\nElena Herrada, a member of the Detroit School Board and an activist with Detroiters Resisting Emergency Management, gives an update on their third battle with the state.<br /></p>\n"
}
