{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "image",
      "url": "http://leidstories.podbean.com/mf/web/vb9b/Utrice-Leid-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-020514/",
    "podcast": {
      "developer-note": "",
      "length": "53:13",
      "note": "",
      "size": 12774191,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/g3t9yx/LeidStories020514.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-02-05 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Really, Really Sick!\n&lt;!--more--&gt;\n Racial Disparities in Health Care\n In practically every area of life in the United States, race-based inequality remains significant, persistent and devastating. <br />\nA stark illustration is health care. <br />\nAfrican Americans today are sicker than whites at almost every income level, and if the death rate were about the same for both groups, between 80,000 and 100,000 African Americans would not die each year.\n<br />\nIn the first of a two-part presentation, law professor emerita Vernellia Randall (University of Dayton), author of Dying While Black, discusses the health status of African Americans and how a history of slavery, legal apartheid, racism and racial re-entrenchment have led to health problems that merely eating right and exercising will not correct.<br />\n What is needed, she argues, is a human rights act for the 21st century that outlaws all forms of discrimination, including negligent and nonintentional discrimination.\n<br />\nProfessor Randall writes extensively on and speaks internationally about race, women’s issues and health care. <br />\nShe is the recipient of the Ohio Commission on Minority Health Chairman’s Award.<br />\n A public-health professional as well, she administered a statewide health program in Alaska. <br />\nFor the past 15 years, she has focused on eliminating disparities in health care for minorities and the poor.<br /></p>\n"
}
