{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-022714/",
    "podcast": {
      "developer-note": "",
      "length": "58:09",
      "note": "",
      "size": 13957329,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/jrutpg/LeidStories_022714.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-02-27 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Obamacare Could Cost Low-Income and Poorer Americans Their Homes\nNullification: The Power of Jurors to Balance the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nScales of Justice\nJurors also are judges of the facts in a case and should exercise their power in the interest of justice, says our guest, Kirsten Tynan, executive director of the Fully Informed Jury Association. <br />\nThe organization has ramped up awareness of a central theme of its “juror education” program—a controversial concept called jury nullification, which says that jurors “must protect fellow citizens from the tyrannical abuses of power by government” by refusing to convict when the letter of the law conflicts with their consciences. <br />\n  \nAnd noted economist Paul Craig Roberts, former editor of The Wall Street Journal, reveals a very scary downside to the Affordable Care Act (Obamacare): Estate recovery.\n<br />\nIt sounds incongruous—considering that it applies to Americans who hardly consider themselves as having “estates.” But low-income and poorer Americans are especially at risk of total financial ruin with the ACA, because they are herded into Medicaid, which will require many enrollees to forfeit their homes and other assets they might have to the state to cover the cost of their medical care. <br /></p>\n"
}
