{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-us-health-care-costs-again-rising-not-slowing-32914/",
    "podcast": {
      "developer-note": "",
      "length": "55:51",
      "note": "",
      "size": 13406668,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/taqwe8/AlternativeVisions032914.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "US Health Care Costs Again Rising–Not Slowing"
  },
  "title": "US Health Care Costs Again Rising–Not Slowing",
  "date": "2014-03-29 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr Jack Rasmus welcomes as his guest, Tom Moore, a nationally known expert on health care costs with 30 years<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nexperience in medical cost analysis in government and as a consultant, to discuss rising health insurance premiums and costs today in the US.  Jack and Tom discuss why health care premiums and deductibles are again on the rise, and projected to escalate at double digit annual rates further in 2015 under Obamacare.<br />\n  Dr Rasmus notes the sharp contradiction between national consumer polls and surveys that show health care insurance premiums and deductibles rising again at double digit levels vs. <br />\ngovernment and Obama administration reports that claim total healthcare spending in the US is slowing. <br />\nSo what is it? <br />\nAre personal out of pocket costs rising and about to escalate even more—or are the government reports of total healthcare spending slowing correct? <br />\nAre health insurance companies, that have become big finance companies expanding worldwide, about to rip off the US public again with double digit further premium and deductible hikes once Obamacare is implemented?<br />\n  What can you expect in coming months. <br />\nJack and Tom discuss the details and the real data.<br />\n’\n Guest Tom Moore, Jr. <br />\nis the co-founder of Community Campaigns for Quality Care and serves as its Board Chair and Chief Financial Officer.  He brings over 30 years’ experience in health policy and program management, having held major federal and state government positions including the Director of California Department of Social Welfare, Director of the Office of Legislation for the US Public Health Service, and Deputy Director of the California Department of Health Services for the Prepaid Health Plan program in Medi-Cal.  Tom was also a Senior Health Policy and Program Consultant to the California Health Care Coalition, where he represented CHCC members on the board of the California Hospital Assessment and Reporting Task Force (CHART), recognized as a national model for health care quality measurement and reporting.<br />\n  He has consulted with the International Longshore and Warehouse Union and the California State Council of the Service Employees International Union on health benefits, including serving as SEIU’s liaison to CalPERS. <br />\nWorking with his CCQC partner, Sally Covington, he has participated in development of projects to identify and improve questionable variations in utilization of clinical services in Montana, Oregon, and California and currently supports delivery system improvement projects with IBEW L1245 (Northern California). <br />\n \n<br /></p>\n"
}
