{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-100614/",
    "podcast": {
      "developer-note": "",
      "length": "54:24",
      "note": "",
      "size": 19588770,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/25qcwj/LeidStories_100614.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-10-06 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Sharpton Lawyer’s Sex-Assault Probe Revives Tawana Brawley Case\nDictator’s Death Closes One Chapter, Opens Another, In<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nHaiti’s Life\nThe Rev. <br />\nAl Sharpton has gone silent—“no comment at this time,” says his PR flak—about the allegation by a top executive of his National Action Network that she was sexually assaulted by his attorney friend Sanford Rubenstein after a star-studded 60th-birthday bash for Sharpton at the posh Four Seasons restaurant in Manhattan last Wednesday.\n<br />\nRubenstein, who has made millions litigating police-brutality cases literally delivered to him by Sharpton, is the lawyer for the family of Eric Garner, killed by police chokehold in Staten Island, NY, on July 17.\n<br />\nLeid Stories in a commentary notes several reasons why the bloviator-in-chief’s self-imposed silence and media coverage of the Rubenstein probe are stunning—and not.\n<br />\nThe death of Jean-Claude “Baby Doc” Duvalier in Haiti on Saturday has set in motion a new wave of political machinations in the beleaguered country to which the ousted dictator had returned three years ago, hoping for a comeback after 25 years in exile in France.\n<br />\nKim Ives, a prizewinning documentarian and editor of Haïti Liberté, a news weekly serving the Haitian diaspora, discusses the fallout.<br /></p>\n"
}
