{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-011413/",
    "podcast": {
      "developer-note": "",
      "length": "1:07:2",
      "note": "",
      "size": 16163422,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/s2znn/GaryNullShow011413.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-01-14 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Irradiation of Food with guest Alexis Baden-Mayer, and Human Design forecasting with guest Peter Roth.\nAlexis<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nBaden-Mayer is a Washington-based awyer and activist now serving as the Political Director of the Organic Consumers Association. <br />\nShe is the co-editor with the organization’s director Ronnie Cummins of its newsletter Organic Bytes, which reaches nearly 300,000 subscribers. <br />\nShe has organized many grassroots campaigns, including Millions Against Monsanto, Coming Clean (to remove false “organic” claims from cosmetics), Safeguard Organic Standards (to keep USDA organic standards high), USDA Watch (to close the revolving door between federal regulatory agencies and the biotech lobby), and Organic Transitions (to shift from climate-destabilizing industrial food production to carbon-sequestering sustainable agriculture). <br />\nBefore joining OCA, Alexis was the Government Relations Director for Vote Hemp, the National Field Director for the Marijuana Policy Project, and a lobbyist for a coalition to restore federal loan access to students with drug convictions.\n<br />\nPeter Roth is the host of the program Energy Stew – broadcast every Saturday at Noon (Eastern Time) over the Progressive Radio Network, which explores the human potential and humanities mysteries and higher faculties. <br />\nPeter is a life long runner who has worked with me in the past coaching other runners and helped with the founding of the Natural Living Club that has helped 1000s of people to live healthier lives. <br />\nOver the decades he has studied with many prominent spiritual teachers and provides intuitive counseling services for others.\n<br /></p>\n"
}
