{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-121712/",
    "podcast": {
      "developer-note": "",
      "length": "1:03:3",
      "note": "",
      "size": 15240777,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/v2injj/GaryNullShow121712.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-12-17 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The Sandy Point school tragedy – another case of prescription psychiatric drug based murder?\n&lt;!--more--&gt;\n Will violence increase in the future after the release of DSM5?\n<br />\nDr CE Gant has practiced integrative and functional medicine and more recently genomics for over 35 years. <br />\nHe is best known for his work in the treatment of mental and substance use disorders. <br />\nHe received his medical degree from the University of Virginia Medical School, and his PhD in psychology from Columbia Pacific University.\n<br />\nFor two decades, Dr Gant pioneered many of the nutritional, metabolic, neurotransmitter and hormonal balancing, and detoxification treatments for substance use and other mental disorders while serving as the medical director of Tully Hill Hospital, as medical consultant at Syracuse Behavioral Healthcare and as a psychiatric consultant at many substance abuse and mental health, clinics and hospitals, throughout Central New York. <br />\nDr Gant currently practices functional medicine, genomics and mindfulness-based psychotherapy at the National Integrated Health Associates in Washington, DC and teaches these cutting-edge, science-based, methodologies at the Academy of Functional Medicine, Dentistry and Psychology.\n<br /></p>\n"
}
