{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-090214/",
    "podcast": {
      "developer-note": "",
      "length": "54:32",
      "note": "",
      "size": 19635264,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/q6trup/LeidStories_090214.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-09-02 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>The Eric Garner Case Takes A Major Turn This Week; Maddox Defends Chokehold Videographer Ramsey Orta Against ‘Malicious<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nProsecution’\nThis week marks a potentially dramatic turn in the Garner police-chokehold case, as Ramsey Orta, who captured Garner’s fatal encounter with a group of police officers on his cell phone, goes to court on a contentious gun-possession charge that put him in jail on a $75,000 bond, thereby making him unavailable to testify before a grand jury as a material witness.\n<br />\nCommunity donations, however, secured Orta’s release on Aug. <br />\n23, and he has asked “Attorney at War” Alton H. <br />\nMaddox Jr. <br />\nto represent him on Sept. <br />\n5 in state Supreme Court in Staten Island.\n<br />\n Maddox, who has been critical of the unwillingness of the Rev. <br />\nAl Sharpton to press for a special prosecutor in the Garner case (and in the police killing of Michael Brown in Ferguson, Missouri; Sharpton has taken a leadership position in both cases), says Orta’s charges and trial are an example of how police abuse of power and authority typically accompanies excessive use of force.\n<br />\nLeid Stories updates Maddox’s analysis of legal actions that have been taken by grassroots and public-interest groups in response to police brutality and militarization in communities of color across the United States, and whether the Garner and Brown cases can deliver justice on the prosecutorial tracks they currently are on.<br /></p>\n"
}
