{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "image",
      "url": "http://thenaturalnurse.podbean.com/mf/web/er7x3/EllenKamhi_AlbumArt2.jpg"
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-food-security-091812/",
    "podcast": {
      "developer-note": "",
      "length": "54:48",
      "note": "",
      "size": 13152026,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/63a4mc/NaturalNurse091812.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "Food Security"
  },
  "title": "Food Security",
  "date": "2012-09-18 00:00:00 -0400",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Cornell Cooperative Extension, Organic and Local Agriculture and Food Security</p>\n\n<p>Host Ellen Kamhi, PhD, RN,<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nwww.naturalnurse.<br />\ncom, interviews Laura K. <br />\nHunsberger, MS . <br />\nLaura Hunsberger is the Executive Director of Cornell Cooperative Extension, Nassau County, NY. <br />\nShe is past president of the Northeast American Society of Horticultural Scientists (NEASHS) and received a Master’s degree in plant and soil sciences from the University of Massachusetts(Amherst). <br />\nShe has authored several scholarly journal articles and been successful obtaining grants and contracts since 1996.<br />\n   She joined Cornell in 2010 as a plant pathology research support specialist as a member of the Long Island Horticultural Research Center (LIHREC) research team. <br />\nOne of Laura’s goals is “to lead a more concentrated effort of encouraging Long Islanders to include more healthy food, produced right here on the island, as a regular part of their diets.<br />\n” Those goals include the support of organic and local agriculture. <br />\nHunsberger noted “NassauCounty’s population has a proud agricultural past, but today the county’s needs are much more about gaining access to good nutrition, known as “food security,” and educational programming opportunities about topics such as gardening, landscaping and sustainability, empowering the people of NassauCounty to better care for themselves and their families in the long run.” Cornell Cooperative Extension of Nassau County (CCE-NC) is committed to building healthy lifestyles and healthy communities by conducting educational programs that connect CornellUniversity resources to community needs for all people in the county.  Contact: 516-433-7970 ext 16 ,   http://blogs.cce.cornell.edu/nassau/\n<br /></p>\n"
}
