{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-threats-and-awareness-101012/",
    "podcast": {
      "developer-note": "",
      "length": "1:02:09",
      "note": "",
      "size": 14918844,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/dpfcaf/GaryNullShow101012.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Threats and Awareness"
  },
  "title": "Threats and Awareness",
  "date": "2012-10-10 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Newsmaker:  Independent study into NY metropolitan’s air quality and its diverse foreign particles\nWilliam Bryant Logan<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nis a certified arborist and president of Urban Arborists, Inc.<br />\n, a Brooklyn-based tree company. <br />\nLogan has won numerous Quill and Trowel Awards from the Garden Writers of America and won a 2012 Senior Scholar Award from the New York State chapter of the International Society of Arborists. <br />\nBill is currently on faculty at the New York Botanical Gardens and is the author of “Oak” and “Dirt”, the latter of which was made into an award-winning documentary. <br />\nThe same filmmakers are currently planning a documentary based upon his most recent publication “Air: The Restless Shaper of the World” which probes the scientific research into the many ways we interact with air and the effects of global warming.\n<br />\nVaccine Awareness Month, and the progressive political agenda moving into the future</p>\n\n<p>Sallie Elkordy is a progressive activist and citizen lobbyist running for Congress to fill the vacancy in my district, New York’s 9th District in Brooklyn and Queens. <br />\nFor almost two decades she has been active in establishing a U. <br />\nS. <br />\nDepartment of Peace, promoting Anti-trafficking legislation and opposing Vaccine increases and mandates. <br />\nThe most recent trip I made to Albany, was to advocate against health insurance legislation, written to the detriment of the Autistic people it was supposed to have helped.\n<br />\nShe campaigns to gain support for legislation that promotes U. <br />\nS. <br />\nmilitary withdrawal from Afghanistan and Libya, and is trying to stop Senate bill #S.<br />\n981-The National Defense Authorization Act and is campaigning against both the Food Modernization Act (genetically modified organisms in our food) and against The National Patriot Act (searches without a judge’s warrant, wiretaps, and all without recourse for those targeted).\n<br />\nShe is one of the primary promoters of the Billion Toddlers March for Survival, a worldwide effort to bring awareness of the threats that Thermo-Nuclear War, Vaccines, Chemtrails, GMOs pose to children worldwide.<br /></p>\n"
}
