{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-072613/",
    "podcast": {
      "developer-note": "",
      "length": "1:02:34",
      "note": "",
      "size": 15019677,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/pabxkc/GaryNullShow072613.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-07-26 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>CONVERSATIONS WITH REMARKABLE MINDS\nHow modern medicine is leading us to a medical Pharmageddon and a new initiative<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nfor patient-doctor blowblack against Big Pharma’s cover up and denial drugs’ sever adverse effects\nDr David Healy is a Professor of Psychological Medicine at Cardiff University School of Medicine in Wales UK, the director of North Wales School of Psychological Medicine, and is a former Secretary of the British Association for Psychopharmacology. <br />\nOver the years he has developed a reputation for being one of the pharmaceutical industry’s leading nemesis for his criticisms on the serious adverse effects of prescription drugs and the means by which companies cover up severe drug health risks to health officials, doctors and the public. <br />\n Dr Healy was one of the first psychiatric scholars and researchers to publicly raise the alarm about Prozac and other SSRI’s association with suicide risks, which led to his dismissal at the University of Toronto, known as the Toronto Affair. <br />\nAt the time Eli Lily, the maker of Prozac, was contributing over 50% to the budget of the university’s mood disorder clinic he was connected with. <br />\n He has been one of the few researchers to investigate in a clinical trial the suicide risks due to disinhibition of an SSRI, in that case Zoloft.\n<br />\nDavid has published over 175 peer-reviewed papers, 200 other articles, and has written 20 books, including “The Antidepressant Era”, “Let Them Eat Prozac”, and most recently “Pharmageddon, one of the most blazing indictments against so-called “evidence based medicine” that dictates the failure and corruption of pharmaceutical clinical trial research, skewed and manipulated scientific data, drug marketing, rigged treatment guidelines, endemic ghostwriting, and how companies get away with it.\n<br />\nHe is also the founder of Rxisk.<br />\norg, which may well become one of the most effective patient-doctor-pharmacist based blowbacks against the pharmaceutical industry’s denial of their drugs most grave dangers.\n<br /></p>\n"
}
