{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-022613/",
    "podcast": {
      "developer-note": "",
      "length": "54:49",
      "note": "",
      "size": 13156415,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/ge5x76/NaturalNurse022613.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "The Natural Nurse"
  },
  "title": "The Natural Nurse",
  "date": "2013-02-26 00:00:00 -0500",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Host Dr. Eugene Zampieron, ND, MH, interviews Dr. Leonard Oestreicher.\n&lt;!--more--&gt;\n Dr Oestreicher received his Bachelor of Science from University of Wisconsin, Madison in1970 and his MD from University of California  in 1974. <br />\nHis career choice of Family Practice prepared DrOestreicher for writing the book, The Pied Pipers of Autism. <br />\nFamily practitioners have to synthesize the findings from many medical specialties to form a coherent rational practice for the benefit of patients. <br />\nFor thirty five years Dr O has been involved with the lives of his patients and their families, and has broad personal and professional experience on the nature and norms of child rearing and how they have changed. <br />\nDuring that time Autism Spectrum Disorder has emerged from being a very rare to a very common disorder, with a 2,500% increase in the number of children acquiring this disorder over the last 50 years. <br />\n On today’s show, Dr Oestriecher shares information about the cause of the increase in Autism, from the development of  human social networks to influences of modern life on brain neuron conduction. <br />\nHe feels his best understanding comes from being a participant in the beautiful process of development in infants and children that has gone so astray because of the Pied Pipers of Autism. <br />\nDr Leonard Oestreicher continues to practice medicine in Merced, California where he lives with his wife and their three year old daughter.\n<br /></p>\n"
}
