{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-deconstructing-obamacare-040113/",
    "podcast": {
      "developer-note": "",
      "length": "57:55",
      "note": "",
      "size": 13900591,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/rkp9dk/PCH040113.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Deconstructing Obamacare"
  },
  "title": "Deconstructing Obamacare",
  "date": "2013-04-01 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nMargaret Flowers is a pediatrician in Maryland who is currently working full time on the reform on America’s health care in favor of a single payer or Medicare for All system.<br />\n  She is a co-chair of the Maryland chapter of the Physicians for a National Health Program, and one of its advisory board members. <br />\nThe national organization of PNHP now has over 18,000 physician members who support single payer universal health coverage. <br />\nMargaret also sits on the board of the organization Healthcare Now!<br />\n  She received media attention after her first arrest during the Senate Finance Committee meeting on healthcare in 2009, and then a second arrest for attempting to deliver a letter to the White House in response to President Obama’s state of the union address.\n<br /></p>\n\n<p>WEBSITE for Articles:  ClearingFOGRadio.org\nPhysicians for a National Health Program WEBSITE:  www.PNHP.<br />\norg\nProf. <br />\nJerry Friedman is a professor of economics at the University of Massachusetts in Amherst where he has taught since 1984.<br />\n  He has specialized in economic and labor history as well has the economics of healthcare. <br />\nIn addition to publishing reviews of the economic impact of our current private insurance based healthcare model and the economic benefits of single payer, he has also conducted financial analyses for single payer initiatives in individual states including Maryland, Colorado and Pennsylvania.\n<br />\nHis articles can be found on the Dollar and Sense website and Real TV interviews on Youtube\nDr Michael Huntington is a retired oncologist and the former Medical Director of the Radiation Oncology Department at Good Samaritan Hospital in Corvallis Oregon where he currently resides. <br />\nHe is a founder of the Oregon Chapter of Physicians for a National Health Program  – that now has over 18,000 member physicians who favor single payer universal health coverage. <br />\nIN 2009 Dr Huntington helped create the Mad as Hell Doctors, who toured the US speaking in favor of single payer healthcare  reform before the passing of Obama’s plan. <br />\nHe is currently the president of the Health Care for All Oregon Education Fund.\n<br /></p>\n\n<p>Mad as Hell Doctors WEBSITE:  www.MadAsHellDoctors.com\n<br /></p>\n"
}
