{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-100614/",
    "podcast": {
      "developer-note": "",
      "length": "57:56",
      "note": "",
      "size": 20861400,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/kqi5sn/BAR100614.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-10-06 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>New Youth Party Demands West Finance Ebola Fight\nEvents in Ferguson, Missouri, have inspired formation of “an<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nalternative party of young people of color” in Minneapolis-St. <br />\nPaul, Minnesota. <br />\nIn its first major demonstration, set for October 16, the Young people’s Freedom and Justice Party is “demanding that the US government and the western world provide the funding for drugs for treatment” of Ebola “and that they move with all deliberate speed,” said Sara Osman, one of the organizers. <br />\nThe party is comprised of college and high school students as well as youths who are not in school.\n<br />\nBlack Is Back Coalition to March on White House November 1\nIn November, 2009, President Obama’s first year in office, the newly formed Black Is Back Coalition for Social Justice, Peace and Reparations held its first rally and march on the White House. <br />\n“I think, five years later, even the most die-hard Obamites would have a serious problem trying to ignore the criminality of this regime, or to separate what the United States government is doing under Obama from anything it’s done under George W. <br />\nBush or any of the other criminals who have occupied that office,” said Coalition chairman Omali Yeshitela. <br />\nThe Coalition holds a rally and march on the White House on November 1, followed by a teach-in at Howard University the next day under the theme “Peace Through Revolution.”\nUS Intelligence Agencies Were Aware of ISIS’s Plans\nFar from being in the dark about ISIS’s capabilities and goals, the CIA was well aware of the jihadist’s plans to attack the Iraqi city of Mosul and seize much of the country, according to journalist Nafeez Ahmed, author of the Guardian newspaper article “How the West Created the Islamic State.<br />\n” The US, Britain and the Gulf oil monarchies were plotting regime change in Syria even before the outbreak of demonstrations against the government, in 2011. <br />\nThe same countries that have been “supporting and financing and manipulating” Islamist militants are now “being mobilized to fight the very enemy they created,” said Ahmed, author of Zero Point, a novel that actually predicted the events now unfolding in Iraq.\n<br />\nWashington’s Incessant Lies\nUS foreign policy seems full of contradictions because “they are at war with the world and have to constantly hide their aims and their goals, and can turn on the very forces that they create,” said Sara Flounders, of the International Action Center. <br />\nBut, said Flounders, “what they’re telling the people of the world is always a lie. <br />\nAlways.<br />\n”</p>\n\n<p>Rally Makes Connection Between African American and Palestinian Struggles\nOn October 11, hundreds will gather at the Malcolm X and Betty Shabbaz Center, in Harlem, to affirm their solidarity with Palestinians under the Israeli apartheid regime. <br />\n“The World Stands with Palestine” rally will highlight parallels in the plight of Blacks in the US and Palestinians under occupation. <br />\nThe Center is housed on the site of Malcolm X’s assassination, in 1965. <br />\n“Malcolm would have been an African internationalist,” said hip hop artist and activist M-1. <br />\n“To have the rally in the former Audubon Ballroom completes the cycle.<br />\n”\nBlack Politicians Silent and Ineffectual: Throw Them Out\nOne looks at the images from Ferguson “and sees in an instant that there is a war against Black people,” said Mumia Abu Jamal, the nation’s best known political prisoner. <br />\nWhat are Black politicians doing? <br />\n“Many, if not most, have been silent,” said Abu Jamal, in a report for Prison Radio. <br />\n“A new, militant, responsive politics must arise, built by the young who are clear-eyed and committed.<br />\n”\nDetroit: Water Cut-Offs Lead to Evictions\nPastor Ray Anderson, of the House of Help church and community center, joined with the grassroots Water Brigade to halt the water cut-offs that have affected hundreds of thousands. <br />\nBefore long, the city cut off the House of Help’s water, too. <br />\n“A lot of people are losing their homes when their house goes into foreclosure because of the water bill,” said Pastor Anderson. <br />\n“I believe it’s a God-given right for us to have water,” especially since Detroit sits on the Great Lakes, the greatest reservoir of fresh water in the world.<br /></p>\n"
}
