{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-122314/",
    "podcast": {
      "developer-note": "",
      "length": "56:19",
      "note": "",
      "size": 20275581,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/heat5m/NaturalNurse_122314.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "The Natural Nurse"
  },
  "title": "The Natural Nurse",
  "date": "2014-12-23 00:00:00 -0500",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Host, Eugene Zampieron, ND, www.drznaturally.com, interviews Dr. Michael Posner.</p>\n\n<p> </p>\n\n<p>Dr.\n&lt;!--more--&gt;\nMichael Posner is director of the Wholistic Wellness Center in Huntington Village NY, where he has maintained a successful practice for over 30 years. <br />\nWell known as a gifted healer, Dr Posner has helped thousands of people restore their health and vitality through his synergistic approach to chiropractic, combined with massage therapy, acupuncture, nutrition, meditation, infra-Red, LED healing light therapy and effective weight loss programs. <br />\nAn internationally certified Healing Tao instructor since 1983, Dr Posner is passionate about teaching Tai Chi, Chi Kung, The Inner Smile and Microcosmic orbit meditations as taught by Grand Master Mantak Chia’s Universal Healing Tao system.<br />\n Dr Posner is dedicated to sharing his vast knowledge and repertoire of practices which harmonize emotions, quiet the mind and return attunement to the sacred spaces within. <br />\nThis helps to generate vibrant health and wellbeing with minimal effort. Along with his wife Lois, Dr Posner wrote “Well Adjusted, A Journey of Transformation for Body, Mind and Spirit.<br />\n” In this book, he weaves the story of his personal journey to regain health, and supports you to be a creator and not a victim. <br />\nIt is a must read blueprint for anyone who wants practical, easy and effective ways to reduce stress and to take control of their lives. <br />\nDr Posner is always available for complimentary consultations to discuss your health concerns.\n<br /></p>\n\n<p>Contact: www.HuntingtonChiropractor.com\n<br /></p>\n"
}
