{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-121514/",
    "podcast": {
      "developer-note": "",
      "length": "58:05",
      "note": "",
      "size": 20912081,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/jzhiw6/BAR121514.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-12-15 00:00:00 -0500",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Sharpton Rally Rejects Young and Rebellious\nAside from relatives of police murder victims, the speakers list at<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nSaturday’s “Justice for All” event in Washington, DC, was dominated by conservative, Black establishment figures. <br />\n“We came with the genuine intention to see whose voices they would elevate,” said Erika Totten, part of a youthful contingent of Ferguson activists that briefly took to the stage. <br />\n“We kept being dismissed, so I said, ‘Stand behind me and follow me. <br />\nWe’re gonna shut it down, like we always do.<br />\n’” Totten was interview by The Real News Network.\n<br />\nDr Marsha Coleman-Adebayo, the noted whistleblower and activist with Hands Up Coalition DC, said the Sharpton rally was an attempt to co-opt the growing movement. <br />\n“The Obama administration has used a surrogate, Rev. <br />\nAl Sharpton, to help corral that kind of energy and those kinds of issues back into the political system where those kinds of passions can die an unnatural death.<br />\n”\nObama Scrapes Bottom of Barrel to Choose Task Force Leader\n“It would have been hard for President Obama to find a more inappropriate choice” for co-chair of the new White House task force on police militarization than former DC police chief Charles Ramsey, said Mara Verheyden-Hilliard, executive director of the Partnership for Civil Justice Fund. <br />\nThe Fund won $20 million in damages for police abuse of demonstrators during Ramsey’s tenure as chief, during which he committed massive violations of civil rights and instituted a military style of policing. <br />\n“Social change never comes in the United State because Congress or the White House suddenly, benevolently decided to do the right thing,” said Verheyden-Hilliard. <br />\n“It comes because there’s a people’s struggle in the streets and in the courts.<br />\n”\nNothing New in CIA Torture Report Except “Rectal Feeding”\nMost of the information in the Senate Intelligence Committee’s highly redacted report on CIA Torture was “already part of the public record,” with the exception of revelations on forced “rectal feeding” of detainees, said Dr Francis Boyle, professor of international law at the University of Illinois, at Champaign. <br />\n“It’s really rape – rape-torture,” said Dr Boyle. <br />\n“The significance of this report is that we now have a branch of the United States government making official findings of fact,” which, in legal terms, amounts to “an admission against interest.<br />\n” Boyle is preparing to demand an immediate investigation into CIA torture by the International Criminal Court.\n<br />\nMumia: CIA = Crime All the Time\n“The CIA, the executive hand of the president, has been involved deeply in every crime known to man,” said America’s best known political prisoner, Mumia Abu Jamal, in a report for Prison Radio. <br />\nThe agency commits thousands of crimes every day, but is immune from prosecution under the Intelligence Authorization Act of 2001. <br />\n“That’s American law: the law of the outlaw,” said Abu Jamal.\n<br />\nPsychologists Earn $80 Million Torturing Detainees\nA company owned by two psychologists was paid $80 million to design and oversee the CIA’s detainee torture program. <br />\nMoreover, “there’s evidence that the American Psychological Association colluded with the CIA, the Department of Defense and the White House to adjust its ethics policy so that psychologists could consult and participate in interrogations and detention operations,” said Dr Roy Eidelson, a past president of Psychologists for Social Responsibility. <br />\nBoth the American Medical Association and the American Psychiatric Association refused to allow their members to participate in the CIA’s torture programs.\n<br />\nObama Grants Bush Iraq War Immunity\nThe Obama administration filed papers granting officials of the Bush administration immunity from prosecution for waging war against Iraq. <br />\nInder Comar, a California lawyer, argues that George Bush, Dick Cheney and their crew began a conspiracy to wage an illegal war years before Bush won the presidency. <br />\nHowever, the Obama administration claims its predecessors were acting “within the legitimate scope of their employment” when they attacked Iraq, in 2003. <br />\nIn the end, said Comar, “this case is going to hinge on District of Columbia employment law.<br />\n”\nAmerica Was “Torture Empire of the World”\nThose who say torture is “contrary to US values really don’t know beans about US history, because this used to be the torture empire of the world,” said Dr Gerald Horne, the prolific professor of history and African American Studies at the University of Houston. <br />\nSpeaking on Eutrice Leid’s show on the Progressive Radio Network, Dr Horne pointed out that “the slave owner in the United States honed methods of torture against enslaved Africans to increase productivity and profit.<br />\n” Dr Horne’s latest book is titled Race to Revolution: The US and Cuba During Slavery and Jim Crow.\n<br />\nBlack Caucus and “Civil Rights” Groups in Pockets of Telecoms\nPresident Obama’s recent statement in favor of Internet neutrality went “even further than I expected,” said Kevin Zeese, a leader of net neutrality activists who set up camp outside the offices of the Federal Communications Commission. <br />\nZeese hopes to convince the FCC’s chairman to treat the Internet like a public utility. <br />\nHowever, the Congressional Black Caucus and traditional civil rights organizations remain wedded to telecom corporations. <br />\n“They are so deep in the pockets of AT&amp;T and other telecoms, they have always done their bidding,” said Zeese. <br />\n“Whether it’s mergers or neutrality, they take the wrong position” every time.<br /></p>\n"
}
