{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-112414/",
    "podcast": {
      "developer-note": "",
      "length": "55:31",
      "note": "",
      "size": 19990264,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/imeqt2/BAR112414.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-11-24 00:00:00 -0500",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Cornel West and Bob Avakian Dialogue at Riverside Church\nThe nation’s foremost Black public intellectual shared the<span class=\"ellipsis\">…</span>\n<!--more-->\nstage with the head of the Revolutionary Communist Party (RCP) at New York’s historic Riverside Church. <br />\nRCP leader Bob Avakian, an atheist “to the bone,” said: “The movement I envision is one in which people like Cornel and myself can walk together on the road of revolution and emancipation, uniting in struggle to bring about a world in which there will no longer be a wretched of the earth.<br />\n” His “Christian revolutionary” interlocutor, Dr Cornel West, of Union Theological Seminary, told the crowd: “This is a unique historical moment. <br />\nWhy? <br />\nBecause, historically, Black rage has always been the central threat to the status quo – not because Black people have a monopoly on truth, goodness or beauty, but because when Black folks wake up, all people who are subordinated and dominated can get in and wake up.<br />\n”\nRoadblocks to Community Control of Police\nActivists have been trying to set up civilian boards to oversee police for almost 50 years, with only limited success, according to Larry Hamm, chairman of northern New Jersey’s People’s Organization for Progress (POP). <br />\n“States must confer power on such boards, such as subpoena powers,” said Hamm. <br />\nWould effective controls on police get through the state legislature in New Jersey and elsewhere? <br />\n“I would dare say it would not. <br />\nIt’s gonna be a bumpy road.<br />\n”\nWho Keeps Track of Killer Cops?\n<br />\nThe Black community lacks even the capacity to keep track of abuses committed against it by police departments across the nation, said author and activist Kevin Alexander Gray, of Columbia, South Carolina. <br />\n“In the past, the NAACP in local areas was the place to report police abuse,” said Gray, an editor of the new book Killing Trayvons: An Anthology of American Violence. <br />\n“Some organization needs to take on that role again. <br />\nThe way things are now, if a person has a complaint against the police department they’ve got to take it to – the police.<br />\n”\nHaitians Protest Life Under Occupation\nThousands demonstrated in the Haitian capital of Port-au-Prince, last week, fueled by a variety of grievances, said Ezili Danto, of the Haitian Lawyers Leadership Network. <br />\n“They were asking for an end to the US occupation, behind UN guns and private military subcontractors; they were asking that the militarized, Ferguson-like police stop killing the people; and they were asking for mock elections not to continue in Haiti, but for real elections to be held.”<br /></p>\n"
}
