{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-revival-of-us-movement-for-single-payer-%e2%80%98medicare-for-all%e2%80%99-health-care-%e2%80%93-081614/",
    "podcast": {
      "developer-note": "",
      "length": "59:52",
      "note": "",
      "size": 21554208,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/qmgnbv/AlternativeVisions_081614.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Revival of U.S. Movement for Single Payer-‘Medicare for All’ Health Care"
  },
  "title": "Revival of U.S. Movement for Single Payer-‘Medicare for All’ Health Care",
  "date": "2014-08-16 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n<!--more-->\nJack Rasmus interviews Mark Dudzic, National Coordinator of the Labor Campaign for Single Payer HealthCare (aka Medicare for All), on the recently re-energized and growing national movement for Single Payer-National Healthcare. <br />\nAs the problems with Obamacare grow increasingly obvious—ie renewed double digit insurance premium hikes, excessive deductibles, limited coverage of insured (only 8 million of 50 million covered to date), corporate exemptions, insufficient subsidies, destruction of union-employer health plans, continued business ‘gaming’ of the system, etc.<br />\n—the alternative of a National Health Care Solution similar to Medicare is gaining more attention and support throughout the USA. <br />\nJack and Mark discuss the new strategic shift emerging for the movement, to be discussed and debated at the upcoming national strategy conference of labor and community groups meeting to forge new national strategies and tactics next Saturday, August 22, in Oakland, California. <br />\n Mark provides a detail explanation of the movement today, including efforts to establish Single Payer in Vermont and elsewhere today, as well as new plans and initiatives by labor and community organizations to promote Single Payer-Medicare for All. <br />\n Jack explains the significant cost advantages of Single Payer-Medicare compared to both the current Obamacare program and to right wing further privatization solutions proposed by conservatives, Paul Ryan and others. <br />\n As problems with Obamacare become more evident, without Single Payer as an alternative, Rasmus argues, even more pro-corporate solutions will be substituted for Obamacare after 2016. <br />\n Those interested in the upcoming August 22-24 Oakland conference, see the conference website, www.healthcare-now.<br />\norg. <br />\n For more information on the Single Payer movement nationally, www.laborforsinglepayer.org,  and www.pnhp.<br />\norg. <br />\n  </p>\n\n<p>Mark Dudzic is National Coordinator for the Labor Campaign for Single Payer since 2009. <br />\nHe has been a union activist for 30 years, President of the local union 149 of the Oil, Chemical &amp; Atomic Workers, and president of its district council. <br />\nMark was also a leading figure promoting the formation of a US Labor Party that was launched by the OCAW in the 1990s.<br /></p>\n"
}
