{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-bio-integrity-100512/",
    "podcast": {
      "developer-note": "",
      "length": "1:07:39",
      "note": "",
      "size": 16238237,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/ahkq6d/GaryNullShow100512.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Bio-Integrity"
  },
  "title": "Bio-Integrity",
  "date": "2012-10-05 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The US government’s blatant violation of federal food safety regulations and corruption over the approval of<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nGMOs\nSteven Druker is a public interest attorney and founder of the Alliance for Bio-Integrity – a nonprofit organization dedicated to the advancement of human and environmental health through sustainable and safe technologies. <br />\n Steven was the initiator of a major and little known  lawsuit against the US FDA over the approval of GMOs in violation of federal safety codes. <br />\nAlthough Druker and other plaintiffs in the scientific and religious communities lost the suit, it nevertheless resulted in the release of 10s of 1000s of pages from the FDA files proving illegal wrongdoing in favor of the biotech industry and Monsanto. <br />\nSteven is now international speaker on consumer interests and protections, especially against GMO and its biotechnology and meets with government heads worldwide to warn of food safety threats. <br />\nHe is the author of a recent book – “Altered Genes , Twisted Truth” which details the lawsuit over GMOs and reveals the critical issues from the damaging documentation he received during the legal proceedings. <br />\n The book is pending final completion, but the first part can be downloaded from free from Amazon.\n<br /></p>\n"
}
