{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-100812/",
    "podcast": {
      "developer-note": "",
      "length": "1:04:18",
      "note": "",
      "size": 15432620,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/4adtqy/ProgressiveCommentaryHour100812.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-10-08 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Prof.\n<!--more-->\nWilliam Black is an Associate Professor of Economics and Law at the University of Missouri in Kansas City where he specializes in financial fraud,  white collar crime, public finance, anti trust and Latin American development.  Previously, he was the executive director of the Institute for Fraud Prevention and taught at the University of Texas at Austin.  Bill was the litigation director of the Federal Home Loan Bank Board and served as the deputy director of the National Commission on Financial Institution Reform.<br />\n   He was  a key player in exposing the Keating Five during the S&amp;L scandals, and in 2010 testified before congress about the role of Alt mortgages, better known as liars loans, that played in the downfall of Lehman Brothers.\n<br />\nBill Bergman earned an MBA and another Master’s in public policy from the University of Chicago.  He worked as an economist and financial markets policy analyst for the Federal Reserve Bank of Chicago from 1990 to 2004, where his work included writing the Chicago Fed’s contribution to the Federal Reserve ‘beige book, the implications national emergency powers hold for Federal Reserve ‘independence, and ’critical analyses of the role of credit ratings in capital regulation, the Fed’s pricing of its trillion-dollar-a-day “Fedwire” interbank payment service, and a project in the money laundering area.  Bill has also worked in private sector stock market research roles, and is currently working with the Institute for Truth In Accounting, developing a database of state economic and demographic information in efforts to advance truthful government accounting practices.  He is married, with three children.<br /></p>\n"
}
