{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-011713/",
    "podcast": {
      "developer-note": "",
      "length": "1:06:21",
      "note": "",
      "size": 15924036,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/3yy639/GaryNullShow011713.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-01-17 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Review and progress of 911 investigations in 2012 – and how easy is it to conceal a conspiracy cover up?\n&lt;!--more--&gt;\nIan Henshall is a British based investigative journalist and author whose book “911 Revealed: The New Evidence” has raised a lot of voices across Europe.  The London times noted the detailed scrutiny Ian applied to the official government versions of 911 and the inconsistencies discovered throughout it.<br />\n  The US State Department must have been fully alarmed by it since only 5 days after the book’s release it went out of its way to attack it. <br />\nThe book gives clear explanations about  explosives used to bring down the towers, a military drone craft and missile hitting the pentagon, the controversy over cell-phne calls… the inconsistencies in the official stories about the hijackings.\n<br />\nNews update – recent sun spot report\nMatthew (Mat) Stein is an engineer with a degree in mechanical engineering from MIT and a National Merit Scholar.  Mat writes extensively on sustainable preparedness and self-sufficiency in the face of predictable and unpredictable catastrophic scenarios and conditions.  In addition to writing on the future of perfect storms for the Huffington Post, he is the author of several exhaustive books on how people can prepare themselves for having to rely on our own resources and ingenuity, most notably “When Technology Fails: A Manual for Self-Reliance, Sustainability and Surviving the Long Emergency” and “When Disaster Strikes: A Comprehensive Guide to Emergency Planning and Crisis Survival”</p>\n\n<p><br /></p>\n"
}
