{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-103014/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:18",
      "note": "",
      "size": 22068469,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/mvajgp/GaryNullShow_103014.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-10-30 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Breaking story on new purge of voters behind the upcoming November elections, with Greg Palast</p>\n\n<p>Greg Palast is a<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\njournalist’s journalist whose news breaking stories and investigations have appeared on BBC, the Guardian and now Al-Jazeera.  The Tribune in the UK has called Greg “the most important investigative journalist in our time.<br />\n” He runs the Palast Investigative Fund, a project of the Sustainable Markets Foundation supporting independent investigative journalism. <br />\nGreg broke the stories of voter fraud and the purging of democrat voters in Florida districts during the 2000 Bush-Gore election, and BP’s corruption over the Deep Horizon catastrophe in the Gulf. <br />\nHe has won many awards including from the Financial Times, the National Press Club and the George Orwell award for Courage in Journalism\n \nGreg holds an MBA in Finance from the University of Chicago.<br />\n  His most recent books are “Billionaires and Ballot Bandits: The Best Democracy Money Can Buy” and “Vultures’ Picnic: In Pursuit of Petroleum Pigs, Power Pirates, and High Finance Carnivores”, which traverses much of the world to uncover the corruption in the oil and nuclear industries. <br />\nYou can read Greg’s reports at GregPalast.com\n<br /></p>\n"
}
