{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-46/",
    "podcast": {
      "developer-note": "",
      "length": "54:47",
      "note": "",
      "size": 13148208,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/zeja58/GaryNullShow021411.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-02-14 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today’s guest is Ehud Sperling and he is the founder and president of Inner Traditions International, one of the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nworld’s largest publishers of books on spirituality, religion, and alternative health, and one of the true pioneers in alternative publishing starting back in 1975. <br />\n Inner Traditions has brought to print numerous important voices who otherwise would have fallen into obscurity. <br />\nIn addition, Ehud and his publishing firm have been involved in philanthropic service over the years, helping with projects in the Amazon, India, Costa Rica and elsewhere.\n<br />\nAlso, we have Dr Vatshala Sperling and she was once the chief clinical microbiologist at the Child Trust Hospital in Chen-nai India before her marriage to Ehud which has been a model of spiritual courtship and a deep exploration beyond the conditionings of East-West  obligatory rules and cultural expectations, while retaining the essential spiritual qualities of both. <br />\n She is now a doctor of homeopathy and the author of children’s books.\n<br />\nThe Sperlings deeply inspiring, autobiographical  book – “For Seven Lifetimes: An East-West Journey to a Spiritually Fulfilling and Sustainable Marriage” offers a much needed alternative of wisdom into relationships between men and women in our digital age of dating and courtship.\n<br /></p>\n"
}
