{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-092914/",
    "podcast": {
      "developer-note": "",
      "length": "57:18",
      "note": "",
      "size": 20630847,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/8jp65h/BAR092914.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-09-29 00:00:00 -0600",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>No Indictment in Cop Killing of John Crawford III at Wal-Mart\nStudent leaders in Ohio plan further mobilizations in the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nwake of the failure of a Green County, Ohio, grand jury to indict the police who shot 22-year-old John Crawford III, on August 5. <br />\nCrawford was killed while talking on his cell phone and handling a toy air rifle on display at the store. <br />\n“I’m a direct reflection of John Crawford,” said Jovan Webster, of the Ohio Student Association. <br />\n“I’m around the same age, same color, same culture. <br />\nMe holding a candy bar is threatening in America.<br />\n”\nChange of Mayor in New York, but No Change in Police Behavior\nStatistics show that New York City police arrested virtually the same number of Black and brown people on petty “quality of life” charges in 2014 as during the previous year, despite the intervening election of “liberal” mayor Bill de Blasio. <br />\n“The current NYPD is continuing the same harsh, aggressive ‘broken windows’ type of policing that characterized the [Mayor Michael] Bloomberg years,” said Robert Gangi, executive director of the Police Reform Organizing Project.\n<br />\nBias Against Black Women and Girls Not a Priority\nA new study released by the National Women’s Law Center and the NAACP Legal Defense and Educational Fund says more attention needs to be paid to specific bias against Black females. <br />\nThe report is titled “Unlocking Opportunity for African American Girls: A Call to Action for Educational Equity.” According to the law center’s Fatima Goss Graves, “the suspension rate for African American girls is around 12 percent, which is far higher than any other group of girls and higher than most groups of boys.<br />\n” Black women are the only major group for whom joblessness has not declined, and 43 percent of Black women without a high school diploma live in poverty.\n<br />\nPalestine and Ferguson: The Parallels of Oppression\nThe Malcolm X and Betty Shabazz Center, formerly the Audubon Ballroom, hosts “The World Stands with Palestine” rally on October 11, in New York’s Harlem. <br />\n“There are so many parallels” between the plight of the Palestinian people and the oppression of Blacks in the US, said Dr Robyn Spencer, professor of history at Lehman College and an organizer of the rally. <br />\n“The reality of occupation; economic underdevelopment of Palestinian territories; the ways in which daily life is militarized; the cultural appropriation – the parallels are really strong,” said Dr Spencer. <br />\nThe lineup includes Mumia Abu Jamal, Rebel Diaz and a host of other speakers and cultural icons.\n<br />\nDon’t Cheer Obama Just Because You Hate ISIS\nSpeaking to a teleconference of UNAC, the United National Anti-War Coalition, activist academic Dr Vijay Prashad said peace forces must challenge those who think “imperialism is a hammer that can be used for the purposes of the Left.<br />\n” The same argument was made in 2011, </p>\n\n<p> \nwhen the US and its allies bombed the government of Muammar Gaddafi out of existence, resulting in disaster for the people of Libya, said Prashad, a professor of history and international relations at Trinity College, in Hartford, Connecticut.\n<br />\nObama Displays Phenomenal “Chutzpah” at UN\nPaul Street, the author and activist who has followed Barack Obama’s career since the early days in Chicago, says the president reached new heights of hypocrisy and “chutzpah” at the United Nations, last week. <br />\nObama claims to be “outraged at the brutality of ISIS,” said Street, but the US “killed 500,000 Iraqi children through economic sanctions in the 1990s.<br />\n” The president cites ISIS’s “Network of Death,” but “the US maintains more than 1,000 military installations across more than 100 sovereign nations. <br />\nIs that not a ‘Network of Death?<br />\n’” Street is author of The Empire’s New Clothes: Barack Obama and the Real World of Power.\n<br />\nMumia: The US is the Architect of Destruction\nEverything Washington touches turns to chaos and death, said Mumia Abu Jamal, the nation’s best known political prisoner. <br />\nLibya and Iraq “are horrific examples of US interventions that have plunged both societies into deadly hell-scapes,” said Abu Jamal, in a report for Prison Radio. <br />\nObama’s war in Syria promises more suffering for the country’s people, who Washington treats as “collateral damage.<br />\n”\nAtlanta Hosts Celebration of Rwanda’s Criminal Regime\n“Rwanda Day” – a public relations event showcasing an economy fueled by the systematic plundering of neighboring Congo’s resources and the slaughter of six million Congolese – was nevertheless a popular destination for some Black American notables, who registered their approval of Rwandan dictator Paul Kagame. <br />\nThe warlord’s regime has amassed lots of loot, said Black Agenda Report managing editor Bruce Dixon, and the Black political class “wants a cut.”<br /></p>\n"
}
