{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-the-economics-and-sustainability-threat-of-dirty-energy-062314/",
    "podcast": {
      "developer-note": "",
      "length": "56:17",
      "note": "",
      "size": 13511680,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/9pum8c/ProgressiveCommentaryHour_062314.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "The Economics and Sustainability Threat of Dirty Energy"
  },
  "title": "The Economics and Sustainability Threat of Dirty Energy",
  "date": "2014-06-24 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Richard Heinberg is widely regarded as one of the world’s experts in peak oil, its repercussions on the world economy,<span class=\"ellipsis\">…</span>\n<!--more-->\nfood and transportation, and the need to transition away from fossil fuels and create a more sustainable future. <br />\nHe is currently the Senior Fellow at the Post Carbon Institute. <br />\nHe was featured in Leonardo DiCaprio’s film “The Eleventh Hour” and frequently appears on major media networks to address our fossil fuel based culture and the future of climate change. <br />\n  </p>\n\n<p>Richard is the author of over ten books on oil depletion, energy economics, climate change and ecological issues, including “The End of Growth: Adapting to Our New Economic Reality.<br />\n” His most recent publication is “Snake Oil: How Fracking’s False Promise of Plenty Imperils Our Future. <br />\nHis websites are RichardHeingberg.com AND   PostCarbon.<br />\norg.\n<br /></p>\n\n<p>Kurt Cobb is an author, speaker, and columnist who speaks and writes frequently on peak oil, energy and the environment. <br />\nHe is a regular contributor to The Christian Science Monitor and has written columns for the Paris-based science news site Scitizen. <br />\n </p>\n\n<p>Kurt’s writings have been featured on Resilience, The Oil Drum, OilPrice.com, Investing.<br />\ncom, Peak Oil Review, Common Dreams, Le Monde Diplomatique, and many other sites. <br />\nHe is a founding member of the Association for the Study of Peak Oil and Gas—USA, and has served on the board of the Arthur Morgan Institute for Community Solutions. <br />\n </p>\n\n<p>Kurt is a graduate of Stanford University and his novel “Prelude: A Novel About Secrets, Treachery and the Arrival of Peak Oil” is a startling reinterpretation of contemporary events and a window onto our energy future. <br />\nHis website is ResourceInsights.blogspot.<br />\ncom.\n<br /></p>\n\n<p>Kevin Kamps the specialist in Radioactive Waste Storage and nuclear facility operations for Beyond Nuclear, a non profit organization opposing nuclear power and weapons and advocating for safeguarding our future. <br />\nFor years he was a leader opposing the nuclear industry’s efforts to dump radioactive waste in Yucca Mountain Nevada and to challenge federal subsidies for new reactors and nuclear waste projects. <br />\nHe has traveled to Chernobyl which resulted in his founding a chapter of the International Chernobyl Children’s Project and continues to network with anti-nuclear groups across the nation protesting the relicensing of old decaying reactors and efforts to shut existing ones down. <br />\nHis website is www.BeyondNuclear.<br />\norg.\n<br /></p>\n\n<p>Dr Zane Selvans is a planetary geophysicist turned energy and climate policy wonk. <br />\nHe is currently the Director of Research and Policy at Clean Energy Action, a nonprofit based in Boulder Colorado where he focuses on coal supply issues, carbon and risk pricing, and renewable energy alternatives. <br />\nHe is has especially active in decarbonizing the city of Boulder’s electricity supply. <br />\n  </p>\n\n<p>Zane has a doctorate in geophysics from the University of Colorado and has worked at the university’s Laboratory of Atmospheric and Space Physics and NASA’s jet propulsion laboratory and has done research on the climate of Mars and the techonics of Jupiter’s moon Europa. <br />\nHis organization’s website is CleanEnergyAction.org and his twitter is @ZaneSelvans</p>\n\n<p><br /></p>\n"
}
