{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-the-bomb-the-fuse-and-the-dud-part-2-greece%e2%80%99s-syriza-vs-euro-bankers-013115/",
    "podcast": {
      "developer-note": "",
      "length": "57:03",
      "note": "",
      "size": 20543911,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/ha7b5c/AlternativeVisions_013115.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "The Bomb, the Fuse, and the Dud: Part 2 (Greece’s Syriza vs. Euro Bankers)"
  },
  "title": "The Bomb, the Fuse, and the Dud: Part 2 (Greece’s Syriza vs. Euro Bankers)",
  "date": "2015-01-31 00:00:00 -0500",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus continues the three part series (last week: the ECB’s QE ‘Bomb’), this week focusing on last week’s<span class=\"ellipsis\">…</span>\n<!--more-->\nelection of Greece’s Syriza party, which has promised the Euro ‘Troika’ (IMF, ECB, European Commission-SFSF Fund) forgive at least a third of Greece current 317 billion Euro debt. <br />\nHow is it that Greece ended up with 317b of debt? <br />\nWhy is 270b of that (85%) in hands of the public entities, ie the Troika, and only 15% held by private investors? <br />\nHow did Germany, Holland, and northern Euro banks benefit the most from creating the debt? <br />\nAnd why have they been insisting on continued austerity, and therefore depression, in Greece? <br />\nJack explains how the origins of Greece’s debt lie in policies that followed the creation of the Euro currency union in 1999 and how that union specifically benefited the northern Europe economies at the expense of Greece and the rest of the Eurozone periphery. <br />\nThe arrangements, Jack explains, constitute  Eurozone’s version of Neoliberalism, a now failing caricature of the USA created global neoliberal policy answer to the crisis of the 1970s. <br />\nThe USA’s ‘twin deficits’  and global money capital circular flow neoliberal solution after 1980 was replicated in Europe on a smaller scale after 1999, but Eurozone neoliberalism began to fail after 2010, as Germany and northern Europe abandoned providing capital to Greece and the Eurozone periphery in favor of focusing on China and emerging markets after 2010. <br />\nThe residue left is unsustainable debt levels in Greece and elsewhere and the prospect of never ending austerity that ensures decades more of a debt driven depression in Greece.<br />\n  The current negotiating positions of the northern Troika and banks vs. <br />\nGreece’s new Syriza government are explained, and possible scenarios in coming weeks. <br />\nMeanwhile the ‘fuse’ is lite in Greece for the Euro economy, as a 10 billion euro payment comes due in 90 days. <br />\nWhich side will ‘blink’? <br />\nHow will the standoff be resolved? <br />\nListen this week’s show for some possibilities to come. <br />\n(Next week, part 3: ‘the Dud’)\n<br /></p>\n"
}
