{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/gary-null-show-122214/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:48",
      "note": "",
      "size": 21891829,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/6u3ae9/GaryNullShow_122214.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-12-22 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>CONVERSATIONS WITH REMARKABLE MINDS\nThe path for a shift in consciousness for a new awakened paradigm of global and<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nlocal leadership\nScilla Elworthy is an international peace builder and activist and the founder of the Oxford Research Group in the UK, a non governmental organization she established in 1982 to develop effective dialogue between policy makers and nuclear weapons scientists in China, Russia and the western countries and their critics, for which she was nominated for the Nobel Peace Prize on three occasions.  In 2002, she founded Peace Direct, a charity to support and fund local peace-builders in conflict areas worldwide.  She has been an advisor to Desmond Tutu, Sir Richard Branson and Peter Gabriel in setting up a group called “The Elders” with Nelson Mandela.  She is a member of the East-West Institutes International Task Force on Preventative Diplomacy, the World Future Council, and she is currently the co-founder of Rising Women Rising World, a vibrant global community of women taking conscious responsibility for building a sustainable world.  Her most recent book is “Pioneering the Possible: Awakened Leadership for a World That Works”.  Her websites are PeaceDirect.org and RisingWomenRisingWorld.org<br /></p>\n"
}
