{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-kids-for-cash-102814/",
    "podcast": {
      "developer-note": "",
      "length": "54:09",
      "note": "",
      "size": 19494729,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/gdbk7t/PCH_102814.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Kids for Cash"
  },
  "title": "Kids for Cash",
  "date": "2014-10-29 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Kids for Cash - the movie and the corruption of the US Justice System for Juveniles. \nRobert May is an award winning<span class=\"ellipsis\">…</span>\n<!--more-->\nfilm director, producer and founder of SenArt Films, a film company dedicated to creating meaningful, commercially viable films aspiring to the highest levels of storytelling.<br />\n   He is the director of the recent documentary “Kids for Cash”, about the judicial scandal sending juveniles to prison for the financial benefit of a couple corrupt judges and their cronies associated with the prison system. <br />\nEarlier Robert produced Errol Morris’ Oscar winning film “The Fog of War: Eleven Lessons from the Life of Robert McNamara” and Tom McCarthy’s “the Station Agent” which was recognized as one of the top 10 films of 2003 by the National Board of Review.  He has also produced “the War Tapes, which won Best Documentary at the 2006 Tribeca Film Fest and more recently the feature film “Bonneville” starring Jessica Lange, Kathy Bates and Joan Allen.  Listeners can visit the website KidsForCashTheMovie.com to learn more about the documentary and visit SenArtFilms.<br />\ncom\nEmily Keller is a Staff Attorney at the Juvenile Law Center, the nation’s oldest non-profit public interest law firm for children. <br />\nIn addition to participating in the litigation of the Kids of Cash case, Emily focuses on litigation and policy efforts to improve the juvenile justice and child welfare systems.  Earlier, she was a law clerk in the US District Court for Connecticut.  She graduated magna cum laude at both Brown University with a degree in Public Policy and at the University of Michigan Law School, where she was also a founding member of the group Legal Advocates for Children and Youth.  The Juvenile Law Center’s website is JLC.<br />\norg\nHillary Transue is a former client of the Juvenile Law Center. <br />\nShe is one of the subjects in the Kids for Cash documentary having been a victim of Judge Mark Ciavarella.\n<br />\n <br /></p>\n"
}
