{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-southern-discomfort-victory-is-a-huge-loss-in-mississippi-063014/",
    "podcast": {
      "developer-note": "",
      "length": "55:27",
      "note": "",
      "size": 13309701,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/myg4tk/LeidStories_063014.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Southern Discomfort: Victory Is A Huge Loss In Mississippi"
  },
  "title": "Southern Discomfort: Victory Is A Huge Loss In Mississippi",
  "date": "2014-06-30 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Six-term Republican incumbent Thad Cochran last Tuesday fended off a serious challenge to his U.S.\n&lt;!--more--&gt;\nSenate seat by Tea Party candidate Chris McDaniel, who was favored to win. <br />\nCochran’s strategy? <br />\nGo after African American Democrats. <br />\nMississippi doesn’t require voters to list a party affiliation when they register, so even when there are party primaries voters of all stripes show up at the polls.\n<br />\nCochran’s Democrat-assisted win set off a sonic boom across the political spectrum. <br />\nRepublicans see it as political sabotage and subversion, and Democrats see it as nifty way to slow the right-wing anti-Obama momentum in Congress.\n<br />\nLeid Stories, however, sees it altogether differently. <br />\nCochran’s win is a continuum of loss in Mississippi, which has been exceptionally defiant against freedom, justice and equality for all.\n<br />\nThe Rev. <br />\nJesse Jackson is central to our discussion today. <br />\nHad he harnessed the power of the heavy investment Mississippians had made in him in his presidential runs in 1984 and 1988 (on the strength of movements sparked by stalwart leaders like Medgar Evers and Fannie Lou Hamer), Mississippi today would be the epicenter of transformative Black political power in the United States and not just the statistical anomaly as the state with the highest percentage of African American voters just waiting to help somebody win. <br /></p>\n"
}
