{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-081814/",
    "podcast": {
      "developer-note": "",
      "length": "58:19",
      "note": "",
      "size": 20994120,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/j73eqd/LeidStories_081814.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-08-18 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Ferguson Protesters See Movement Tied to Mass Leadership Change;\nThey Tell Al Sharpton and Jesse Jackson: ‘Get Outta<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nHere!<br />\n’</p>\n\n<p>Ferguson, Missouri, in its third day of a 5 am-to-midnight curfew and state of emergency imposed by Gov. <br />\nJay Nixon, remains a boiling cauldron of anger and resistance in the aftermath of the Aug. <br />\n9 police killing of 18-year-old Michael Brown. <br />\nUpping the ante, Nixon has now called in the National Guard to restore order to the predominantly African American town of 21,200 just outside St. <br />\nLouis.\n<br />\nSWIP Stop the Violence, a grassroots movement spawned by a collective of spoken-word poets and local activists, oppose almost entirely the way the crisis in Ferguson is being handled—most especially back-room political dealings they say imperil justice not only in Ferguson, but in the Fergusons of America.\n<br />\nLeid Stories talks exclusively with Yah Ammi, a key representative of the collective, from “Ground Zero,” the movement’s base of operation in locked-down Ferguson. <br />\nHe reveals shattering information about what really is happening in the beleaguered town; continued police violence against residents; the political accommodations that have already been made at the expense of justice for Michael Brown; and why one of the movement’s top goals is exposing, opposing and removing from influential positions sellout leadership at all levels nationwide.\n<br />\nPublic confrontations in Ferguson with the Revs. <br />\nAl Sharpton and Jesse Jackson over their questionable actions as political operatives and self-assigned leaders of mass movements have started the ball rolling, Ammi says.<br /></p>\n"
}
