{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-12-14-11/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:59",
      "note": "",
      "size": 14639616,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/g2bpe/GaryNullShow121411.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-12-14 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guests: Andrew Kolin, Stephen Lendman, and Shaheed Buttar\nProfessor Andrew Kolin is professor of political science at<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nHilbert College in Hamburg, New York, where he specializes in American political thought, civil liberties, US foreign policy, and constitutional law. <br />\nMuch of his recent work has focused on the conflicts between state power and democracy and the history of the US turning into a police state.\n<br />\nHis latest book published this year is “State Power and Democracy: Before and During the Presidency of George W Bush” which traces the history of American politics for sowing the seeds for a national police state from the founding of the republic to the present\nSteve Lendman is an independent , progressive economist and investigative writer who consistently tackles the most critical issues in the world as soon as they emerge. <br />\n He degrees from Harvard and the University of Pennsylvania’s Wharton School of Business and has worked as a marketing research analyst for several large US corporations before focusing his attention on small business enterprises, progressive nonprofit organizations and economic and political research on finance, war and peace issues, social equity and the humanitarian crises among Palestinians and Haitians.\n<br />\nSteve just recently received the International Journalist award from the prestigious Club of Mexico. <br />\nHe is the author of the recent publication, “How Wall Street Fleeces America: Privatized Banking, Government Collusion and Class War”, and hosts The Lendman News Hour heard on the Progressive Radio Network every Thursday at 11 AM and every Saturday and Sunday at 1 PM.\n<br />\nShaheed Buttar is the executive director of the Bill of Rights Defense Committee and the People’s Campaign for the Constitution which aims to defend civil liberties, constitutional rights and the rules of law threatened by the war on terror. <br />\n Shahid has a JD from Stanford Law School and formerly the chief editor of the Stanford Environmental Law Journal.\n<br />\nShaheed also serves on the advisory bodies of the national Coalition to Protect Civil Freedoms, the national Campaign to Restore Civil Rights and the South Asian Americans Leading Together organizations. <br />\n His articles appear in the New York Times, al-Jazeera, and Truthout.\n<br /></p>\n"
}
