{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-88/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:38",
      "note": "",
      "size": 14553792,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/bi76kx/GaryNullShow041211.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-04-12 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today’s guests are Professor Joel Primack, a Distinguished Professor of Physics and an astronomer at the University of<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nCalifornia at Santa Cruz, and his wife Professor Nancy Abrams who is a scholar in the history of science and technology.\n<br />\nProf. <br />\nPrimack has been a researcher in cosmology since the 1970s. <br />\nHis work led to the important discovery of the existence of Cold Dark Matter , which makes up about 25 percent of all matter in the Universe and has become a basic principle in astronomy. <br />\n His work has included computer simulations of cosmic evolution, and was one of the founders of the Union of Concerned Scientists. <br />\n He has been a board member of the Federation of American Scientists and initiated the Congressional section for the American Association for the Advancement of Sciences.\n<br />\nNancy Abrams specializes in the history and philosophy of science and law degree from the Univ of Michigan and a diploma of international trade from the Escuela Libre de Derecho in Mexcio. <br />\nshe has worked with the Office of Technology Assessment of the US Congress, the Swedish government on assessing the viability of nuclear energy waste storage, and was a co-creator of a method known as Scientific Mediation – a means for making informed policy decisions based on scientific evidence and credibility.\n<br />\nBoth Joel and Nancy have been at the forefront of developing a new metaphysics, a new origin story, based on the most current knowledge and science we have about the universe and the evolution of human beings. <br />\n They are authors of two invaluable and acclaimed books – “The View from the Center of the Universe” and now just released “The New Universe and the Human Future: How a Shared Cosmology Could Transform the World” which Matthew Fox has called “prophetic” – which was the basis of their Terry Lectures at Yale University.\n<br /></p>\n"
}
