{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg"
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/infectious-myth-changing-the-climate-with-madhav-khandekar-042914/",
    "podcast": {
      "developer-note": "",
      "length": "59:06",
      "note": "",
      "size": 14185430,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/2rnmq4/InfectiousMyth_042914.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Changing the Climate with Madhav Khandekar"
  },
  "title": "Changing the Climate with Madhav Khandekar",
  "date": "2014-04-30 00:00:00 -0600",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>David steps out of the arena of medicine in episode 10 and talks to retired Environment Canada climate scientist Madhav<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nKhandekar, who has about 45 years of experience in the field, about why he does not believe that CO2 is responsible for global warming. <br />\nIn fact, as he explains, he is not sure that the planet is currently warming, and that the trend of the last couple of decades may have turned around.\n<br />\n \nKhandekar makes a good case that the climate is always changing, and that extreme weather events have always been with us, and will always be with us no matter what the source of factors that drive long term climate trends is. <br />\nHe points to success in Bangladesh in providing shelters from typhoons after a devastating storm in the 1970s that was estimated to kill several hundred thousand people. <br />\nDavid identifies factors such as deforestation and poor urban planning as factors that turn a bad storm into a human disaster.\n<br />\n \nOriginally from India, Khandekar has seen from personal experience as well as scientifically, how variable climate can be, and how sometimes positive factors align to produce a comfortable and agriculturally productive year, while at other times the weather may be too wet, too dry, too hot and can cause drought and flooding. <br />\nHe has spent most of his working life in Canada, and here too the climate produces ugly surprises some years, and pleasant surprises other years. <br />\nIn some years it is a mixed bag, like 2013, in which the North American west saw both isolated but devastating flooding, while also producing bumper crops for farmers.\n<br />\n <br /></p>\n"
}
