{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-090814/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:23",
      "note": "",
      "size": 21739752,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/6ivx5t/GaryNullShow_090814.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-09-08 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nBrian Hooker is an Associate Professor of Biology at Simpson University in California, and a senior consultant for ARES Corporation, specializing in environmental restoration design.  As a bioengineer, Dr Hooker spent 16 as a team leader for the Dept of Energy’s Genomes to Life Center for Molecular and Cellular Systems at its Pacific Northwest National Laboratory where he investigated gene-protein networks, cell signaling and cellular metabolic pathways.<br />\n  He is a prominent leader in the organization Focus Autism, which is investigating the scientific evidence for a vaccine-autism connection. <br />\nBrian has a 16 year old son with autism and has been active in autism community for almost a decade, including researching and analyzing data on the association between vaccines and autism. <br />\nOver the years Brian has filed many FOIAs with federal health agencies and has received 1000s of pages of documents that support the need to question the efficacy and safety of vaccination.<br />\n  He has been the point independent researcher in the recent whistleblower case with Dr Thompson from the CDC regarding vaccine dangers. <br />\nHis website is FocusAutism.org\n<br /></p>\n"
}
