{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-the-us-empire-growing-stronger-or-weaker-%e2%80%93-072614/",
    "podcast": {
      "developer-note": "",
      "length": "58:45",
      "note": "",
      "size": 21153960,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/wtemc3/AlternativeVisions_072614.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "The U.S. Empire-Growing Stronger or Weaker"
  },
  "title": "The U.S. Empire-Growing Stronger or Weaker",
  "date": "2014-07-26 00:00:00 -0600",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p> ‘Dr.\n&lt;!--more--&gt;\nJack Rasmus welcomes guests, Kevin Zeese and Margaret Flowers, to discuss whether the US Empire today is growing weaker or stronger (or both). <br />\nJack provides background on the dimensions of US Empire today—economically, politically, and military—explaining how the US rules globally differently today than classical empires of the past. <br />\nThe US Empire’s network of multinational corporations, global economic institutions (IMF, World Bank, $ as world currency, G7, central bankers, shadow banks, etc.), political institutions (UN Security council, , and military alliances (NATO, US-Japan, US-Israel, etc.<br />\n) and the US’s 1000+ military bases and outposts around the world are described, as well as more recent US development of new methods of surveillance, security apparatuses, and technologies for protest and crowd control. <br />\nGuests Zeese &amp; Flowers argue the US Empire’s increasing aggressiveness and violence in recent decades are indications of its growing weakness, not strength, as challenges to it mount worldwide. <br />\nEvents today in the Ukraine, Middle East, and Asia are discussed as points of resistance to empire outside the US. <br />\nRecent events by China and the BRICS to establish a new ‘global development bank’ and bypass the US dollar in trade, as well as events in Latin America, are also noted as examples of growing resistance to Empire. <br />\nThe impact of Empire on the deterioration of USA democracy and 1st amendment rights at home are also addressed by Zeese &amp; Flowers, who identify points of resistance to Empire growing within the US.    \nFor more information concerning US based resistance to Empire, listeners are referred to the websites: popularresistance.org, rolllingrebellion.org, and to Zeeze &amp; Flowers’ latest article on the Alternet.org blog, ‘Why Resistance is Growing to the US Empire’.   \nKevin Zeese and Margaret Flowers are hosts of ‘Clearing the Fog’ radio (ClearingtheFogRadio.org) , members of the Green Shadow Cabinet (greenshadowcabinet.org), long time Washington DC area activists in the Occupy movement, and organizers of the blogs, Resistance.Org and ItsOurEconomy.<br />\nUS, that report on grass roots movements of resistance and opposition to attacks on democracy and inequality trends in the USA today.\n<br /></p>\n"
}
