{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-052614/",
    "podcast": {
      "developer-note": "",
      "length": "58:41",
      "note": "",
      "size": 14086269,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/hspawe/ProgressiveCommentary_052614.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-05-27 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Peter Dale Scott is a former professor of English at the University of California at Berkeley (where he was also the<span class=\"ellipsis\">…</span>\n<!--more-->\nco-founder of the Peace and Conflict Studies Program), a recognized poet, and a former Canadian diplomat and a scholar and author on the domestic and international political issues including taxation, war and conflict, the drug trade, the politics of oil and the assassination of JFK. <br />\nHis theory of “deep politics”, a term Peter coined, was descriptive as a more realistic way of objectively looking at evidence that would otherwise be characterized as “conspiratorial” in the main stream media. <br />\nHe is the author of “The Road to 911”, published in 2007, and more recently has published two volumes in a new series: “The War Conspiracy: JK, 911 and The Deep Politics of War” AND America War Machine: Deep Politics, the CIA Global Drug Connection and the Road to Afghanistan” Peter was also one of the witnesses to appear at the International Hearings on 911 in Toronto. <br />\nHis website is PeterDaleScott.<br />\nnet. <br />\n  </p>\n\n<p>Prof. <br />\nJames Tracy is an associate professor in the Department of Communications at Florida Atlantic University where he specializes in media history and analysis, the politics of communications, and the sociology behind commercial and alternative news media in communicating current events. <br />\nHe received significant notoriety for his criticism of the news coverage of the Sandy Hook Elementary School massacre. <br />\nHe holds a doctorate in Mass Communications from the University of Iowa and is closely affiliated with Project Censored and is a regular contributor to GlobalResearch as well as other alternative news outlets, academic journals and book chapters. <br />\nJames’ writings and articles can be found on his blog MemoryHoleBlog.com.<br />\n </p>\n\n<p>Kris Millegan is a publisher, writer and musician. <br />\nHe is the founder and chief editor of TrineDay Books, a publishing house founded to serve as a vehicle to get suppressed publications and controversial authors to the market and reach a wider audience. <br />\nTrineday publishes well-researched and insightful investigations and analyses on alternative interpretations to historical events that might otherwise being called conspiracy theories. <br />\nMany of Trineday’s authors have appeared on this program over the years. <br />\nIn the past Kris collaborated with investigative reporter Daniel Hopsicker on his book Barry and Boys: The CIA, the Mob and Amerca’s Secret History. <br />\nHe is also the author of “Fleshing Out Skull and Bones: Investigations into America’s Most Powerful Secret Society.<br />\n” Kris’ father was employed in secret operations with the OSS in the Pacific, primarily in the Philippines, and later served as the Branch Chief Head of the CIA’s East Asia Office before leaving the agency in 1959. <br />\nIt was through Kris’ association with his father that an interest in covert operations sparked him him early and lead to the creation of TrineDay. <br />\nThe website is TrineDay.net</p>\n\n<p><br /></p>\n"
}
