{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-120913/",
    "podcast": {
      "developer-note": "",
      "length": "57:46",
      "note": "",
      "size": 13866005,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/fftyc6/PCH120913.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2013-12-09 00:00:00 -0700",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Special on Climate Change and its very real impact on our society and civilization\nProf.\n&lt;!--more--&gt;\nTim Garret is Associate Professor of Atmospheric Sciences at the University of Utah where he specializes in cloud physics remote sensing and atmospheric radiation. <br />\nHe is also the president and co-founder of Fallgatter Technologies. <br />\nProf. <br />\nGarret more recently has been applying physical principles of thermodynamics for a deeper understanding of the relationship between global and national economies to anthropogenic carbon dioxide emissions and its impact upon civilization and society.<br />\nTim has a degree in physics from the University of Waterloo and a masters and doctorate in atmospheric sciences from the University of Washington. <br />\nHis website can be found at INSCC.Utah.<br />\nedu/~tgarrett</p>\n\n<p>Paul Beckwith is a doctoral candidate in the Laboratory of Paleoclimatology and Climatology at the University of Ottawa in Ontario, where he also teaches as a part time professor. <br />\nPaul’s research specializes in abrupt effects from climate change (such as tornados and rise in more fierce tropical storms), greenhouse gas emissions, the global implications of the melting of the Arctic icecaps, and social media for climate change advocacy. <br />\nHe is a member and blogger for the Sierra Club and participant in the Arctic Methane Emergency Group and the Canadian Meteorological and Oceanographic Society.\n<br />\nYou can read his blog at SierraClub.<br />\nca/en/blog/paul-beckwith</p>\n\n<p>Cory Morningstar is a Canadian investigative reporter, author and an environmental activist warning against the impacts of anthropogenic global warming and climate change. <br />\nWorking closely with climate change activists, she works with Canadians for Action on Climate Change, is a member of International Climate Justice Now, and was a former president of a chapter of Council of Canadians. <br />\nCory earlier worked on the People’s Agreement in Cochabamba and she has been a leading journalist in exposing the climate threats due to the XL keystone pipeline and Canada’s tar sands. <br />\nHer writings can be found on Counterpunch, Political Context and other sites. <br />\nHer website is TheArtOfAnnihilation.com<br /></p>\n"
}
