{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-062514/",
    "podcast": {
      "developer-note": "",
      "length": "58:26",
      "note": "",
      "size": 14025456,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/zmufdy/LeidStories_062514.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-06-25 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Justice Gone Wilding: Behind the Legal Lynching of the Central Park 7\nPending approval by the city comptroller and a<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nfederal judge, the City of New York will pay $40 million to five men railroaded into convictions and prison terms of between seven and 13 years as “wilding” teenagers prosecutors had charged with raping and almost beating to death Trisha Meili, a woman who went jogging in Central Park on April 19, 1989.<br />\n  \nSettlement of the controversial case is meant by Mayor Bill de Blasio to signal to communities of color that City Hall is addressing their cries for justice in this case in particular and their long-held, legitimate complaints about pervasive abuses in the criminal-justice system in general. <br />\nBut our guest today cautions that the settlement is not likely to change a deeply entrenched system of police, prosecutorial and judicial misconduct and corruption that feed and fill New York’s jails and prisons.\n<br />\nNoted “Attorney at War” Alton H. <br />\nMaddox Jr. <br />\nrepresented Michael Briscoe pro bono in the case—the only defendant to escape the predetermined outcome of the sham trial. <br />\nHe discusses the political, legal and historical significance of the case, the conspiracy to deny justice, the targeting of African American lawyers in the case, and the stark differences in treatment the case received compared to the kidnapping, rape and assault of Tawana Brawley in Wappingers Falls, NY, two years earlier.\n<br />\nAnd yes, it’s The Central Park 7, not The Central Park 5. <br />\nThat, too, explained.<br /></p>\n"
}
