{
  "header": {
    "category": "the-news-dissector",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenewsdissector.podbean.com/e/the-news-dissector-peace-and-justice-062013/",
    "podcast": {
      "developer-note": "",
      "length": "53:17",
      "note": "",
      "size": 12788193,
      "type": "audio/mpeg",
      "url": "http://thenewsdissector.podbean.com/mf/feed/g4ff5u/NewsDissector062013.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://thenewsdissector.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Fri, 19 Sep 2014 16:24:15 +0000",
        "timestamp": "1411161855"
      },
      "subtitle": "h",
      "title": "The News Dissector"
    },
    "tags": [
      "News & Politics",
      "the-news-dissector"
    ],
    "title": "Peace and Justice"
  },
  "title": "Peace and Justice",
  "date": "2013-06-22 00:00:00 -0400",
  "categories": [
    "the-news-dissector"
  ],
  "content": "<p>With Featured Guest: Nobel Peace Prize Winner Mairead Maguire from Northern Ireland.\nNobel Peace Laureate Mairead<span class=\"ellipsis\">…</span>\n<!--more-->\nMaguire, who has done peace work based in Northern Ireland for decades and who has just returned from a visit to Syria, is protesting the policies of G8 leaders.\n<br />\nBack in her native Northern Ireland, Maguire recently returned from leading a peace delegation to Syria. <br />\nShe wrote after the trip: “An appeal to end all violence and for Syrians to be left alone from outside interference was made by all those we met during our visit to Syria. <br />\n… During our visit we went to refugee camps, affected communities, met religious leaders, combatants, government representatives, opposition delegations and many others, perpetrators and victims, in Lebanon and Syria. <br />\n…\n“The Syrian State and its population are under a proxy war led by foreign countries and directly financed and backed mainly by Qatar which has imposed its views on the Arab League. <br />\nTurkey, a part of the Lebanese opposition and some of the Jordan authorities offer a safe haven to a diversity of jihadist groups, each with its own agenda, recruited from many countries. <br />\nBands of jihadists armed and financed from foreign countries invade Syria through Turkey, Jordan, and Lebanon’s porous frontiers in an effort to destabilize Syria.<br />\n”\nWe are also joined by Alice Slater, the nuclear weapons campaigner, to comment on Obama’s Nuclear weapons proposal yesterday.\n<br />\nThen, we discuss the lawsuit Filed Against NYPD for Spying on Muslims, with Deepa Kumar.\n<br />\nAP reports this afternoon: “The New York Police Department’s widespread spying programs directed at Muslims have undermined free worship by innocent people and should be declared unconstitutional, religious leaders and civil rights advocates said Tuesday after the filing of a federal lawsuit.”</p>\n\n<p>“‘Our mosque should be an open, religious, a spiritual sanctuary, but NYPD spying has turned it into a place of suspicion and censorship,’ Hamid Hassan Raza, an imam named as a plaintiff, told a rally outside police headquarters shortly after the suit was filed in federal court in Manhattan.” See New York Civil Liberties Union news release: “Rights Groups File Lawsuit Challenging NYPD’s Muslim Surveillance Program as Unconstitutional.<br />\n”\nKumar is author of Islamophobia and the Politics of Empire. <br />\nShe said today: “When the Associated Press first broke the story about the extent of the NYPD spying program in 2011 and 2012, it was roundly denounced as religious and racial profiling, with some mayors and university presidents in the northeast even calling the practice ‘un-American.<br />\n’ Yet, little has been done to dismantle this program. <br />\nThe lawsuit brought against the NYPD needs the support of ordinary Americans who have been horrified by the NSA’s mass surveillance and spying program. <br />\nMuslim Americans have been living under a nightmarish reality since the events of 9/11. <br />\nThey have faced arrests, indefinite detention, torture, deportation and surveillance. <br />\nNo human being should be treated this way through the logic of ‘guilt by association.’ This spying program — as well as the wholesale demonization of Muslims — must stop.”\n<br /></p>\n"
}
