{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "image",
      "url": "http://infectiousmyth.podbean.com/mf/web/94je52/ScreenShot2015-03-03at62513PM.png"
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/infectious-myth-patricia-goodson-on-the-frontier-of-aids-dissent-030315/",
    "podcast": {
      "developer-note": "",
      "length": "57:36",
      "note": "",
      "size": 20739974,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/rb6ijq/InfectiousMyth030315.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 03 Mar 2015 23:26:05 +0000",
        "timestamp": "1425443165"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Patricia Goodson on the Frontier of AIDS Dissent"
  },
  "title": "Patricia Goodson on the Frontier of AIDS Dissent",
  "date": "2015-03-03 00:00:00 -0500",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>In September 2014 the journal “Frontiers in Public Health” published an article, “Questioning the HIV-AIDS Hypothesis:<span class=\"ellipsis\">…</span>\n<!--more-->\n30 Years of Dissent,” and a firestorm erupted. <br />\nThe very same day that the article came out, the author, Professor Patricia Goodson of Texas A&amp;M University, was contacted by a vigorous defender of the HIV=AIDS dogma, and the journal launched an investigation.\n<br /></p>\n\n<p>The purpose of the attack on the article was to erase it entirely, but this time the attack failed. <br />\nProfessor Goodson stood firm, did not panic, and let the investigation run its course. <br />\nEventually a token victory was handed to the defenders of the dogma, Goodson’s article was downgraded from a research article to “Opinion”, and Seth Kalichman, a psychology professor who represents the defenders of the faith, was given the right to publish an article which turned out to be an attack on the personalities of major AIDS rethinkers, avoiding any discussion of the scientific issues.\n<br /></p>\n\n<p>Goodson’s article remained on the website, has received a huge amount of attention, over 18,000 views to date, and, following the investigation, it was published on the US National Library of Medicine’s PubMed database, which makes the article available to an even larger audience.\n<br /></p>\n\n<p>Seth Kalichman is an interesting character, having previously invented the name “Joseph Newton” in order to infiltrate the dissident movement. <br />\nExcept that the dissident movement is open, so no infiltration is necessary. <br />\nIt’s like wearing a stocking mask and camouflage to go grocery shopping. <br />\nOn the web page for Goodson’s article (which is freely available for download), a man with the strange name “Mika Thane” has been commenting, effusive in his praise for Seth Kalichman’s position and therefore very critical of Goodson. <br />\nThe strange thing is, that the letters in the name “Mika Thane” come entirely from the name “Seth Kalichman”, the probability of which is only about 48 out of a million. <br />\nCould it be that Professor Kalichman is using another fake name to help boost his own credibility by agreeing with himself?\n<br /></p>\n\n<p>This interview with Goodson covers the reasons she got involved in the issue, why she wrote this article, and her feelings and experiences during the investigation by the journal, as well as discussions of the role of Seth Kalichman. <br />\nDavid was joined in the interview by Elizabeth Ely, his co-host on the “How Positive Are You?” podcast.<br /></p>\n"
}
