{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg"
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/infectious-myth-eric-merola-033114/",
    "podcast": {
      "developer-note": "",
      "length": "56:57",
      "note": "",
      "size": 13668101,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/j58wu4/InfectiousMyth033114.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Eric Merola"
  },
  "title": "Eric Merola",
  "date": "2014-04-01 00:00:00 -0600",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>In Episode 6 of “The Infectious Myth” David Crowe interviews Eric Merola, director of three documentaries on people<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\ngoing outside the mainstream on cancer. <br />\nThe first two documentaries are Burzynski, the Movie (2010) and Burzynski: Cancer is Serious Business, Part II (2013), both on Dr Buzynski of Houston, who has battled for decades with the US FDA to get his non-toxic antineoplastons accepted as a legal cancer therapy. <br />\nThe most recent film, Second Opinion (2014), is about the discovery of Ralph Moss, then in Public Relations at Sloan Kettering Memorial Cancer Centre, that Laetrile was effective in cancer treatment, and that he was supposed to be putting our press releases containing lies.<br />\nDavid and Eric talk about how the highly profitable nature of mainstream cancer therapy distorts the purpose of cancer treatment from helping victims of cancer, to maintaining the profitable status quo. <br />\nEric implies that the cancer establishment will have to crumble before major changes in what is allowed for cancer treatment will change in any substantial way in the United States. <br />\nAnd that will only occur with a grass-roots revolt against the continuing War on Cancer. <br />\nThis decades only titanic struggle pits toxic treatments against tumors with the cancer patient’s body as the battlefield. <br />\nEven if the patient doesn’t die in the process of all out war, they may wonder if it was worth it at the end.<br />\nDr Burzynski’s antineoplastons are natural proteins that he found were present in lower quantities in many cancer patients. <br />\nHe does not claim a perfect success rate, but his successes in previously intractable cases, such as many brain tumors, are vastly greater than the mainstream. <br />\nSimilarly, laetrile is no magic bullet, but it has been scientifically show to have some benefits. <br />\nWhich is more, Merola points out, that can be said for mainstream cancer treatments, which are lightly studied for one type of cancer before approval, and then widely used “off label” after approval.<br />\nDavid describes the current cancer treatment system as a tumor with only one aim – to maintain it’s own viability. <br />\nLike all tumors, it is vulnerable to a change in the environment. <br />\nAnd this is where all individuals who educate themselves become antineoplastons (anti-cancer-agents).For more information on how you can watch Merola’s documentaries, see http://ericmerola.com\n<br /></p>\n"
}
