{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-082614/",
    "podcast": {
      "developer-note": "",
      "length": "57:53",
      "note": "",
      "size": 20844000,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/t6c2ai/LeidStories_082614.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-08-26 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Sharpton Urges A ‘Movement’—Just In Time to Support the Democrats\nApocalypse Soon?\n&lt;!--more--&gt;\n The Middle East’s Present As Apocalyptic Prologue\nFrom the pulpit of the Friendly Temple Missionary Baptist Church in Ferguson, Missouri, the Rev. <br />\nAl Sharpton inveighed against rogue cops as he eulogized Michael Brown, whose shooting death by a local police officer Aug. <br />\n8 touched off demonstrations across the country.\n<br />\nSolving the problem is no quick fix, he told the church packed with mourners; what is needed is “a movement.<br />\n” They rose to their feet and cheered in agreement, unaware that the good reverend had just announced the launching of his perennial voter-registration drive for the Democratic Party. <br />\nSharpton had followed his own admonition to them to turn the “chance” of Brown’s death into “change.<br />\n”\nLeid Stories lays bare Sharpton’s most recent clues that true justice in the Michael Brown and Eric Garner (July 17) killings by police is being compromised by Sharpton’s personal agendas. <br />\n \nCould the Islamist insurgency in the entire Middle East and North Africa, and repeated military interventions by Europe and the West, be setting the stage for an apocalypse of global proportions?\n<br />\nIt’s quite possible, says our guest, Dr Nafeez Ahmed, renowned investigative journalist and international security scholar, who posits the theory in a chilling sci-fi thriller, Zero Point, released this week. <br /></p>\n"
}
