{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/the-infectious-myth-professor-garth-nicolson-031715/",
    "podcast": {
      "developer-note": "",
      "length": "57:08",
      "note": "",
      "size": 20570846,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/nrica3/InfectiousMyth031715.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 17 Mar 2015 19:01:38 +0000",
        "timestamp": "1426644098"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Professor Garth Nicolson"
  },
  "title": "Professor Garth Nicolson",
  "date": "2015-03-17 00:00:00 -0600",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nGarth Nicolson, a highly credentialed and published medical scientist, became interested in what is now known as Gulf War Syndrome after his daughter came from serving in the US military in this 1991 war in Iraq with mysterious symptoms. <br />\nDr Nicolson believes that perhaps 250,000 US military members suffered from this syndrome, which include chronic fatigue, digestive problems, neurologic problems, skin disorders and breathing difficulties. <br />\nAt first the US military denied that there was a problem, but eventually it became widely accepted.Dr Nicolson believes that some of the reasons for this syndrome were chemical exposures, radiation exposures (particularly to depleted uranium which is both chemically and radioactively toxic) and exposure to about 30 different vaccines given over a few days, something that he believes overwhelmed the immune system.<br />\nHe believes that one of the common denominators is mitochondrial damage, something that we’ve heard about in other disorders, with a variety of causes. <br />\nHis institute, The Institute for Molecular Medicine, has researched the area of lipid supplements for a variety of chronic diseases. You can find out more about Dr Nicolson’s research and lipid replacement therapy at http://immed.<br />\norg. <br />\nHis research has used custom lipids from Nutritional Therapeutics http://ntfactor.<br />\ncom/#&amp;panel1-1, although there are other sources of similar lipids.\n<br /></p>\n"
}
