{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-061812/",
    "podcast": {
      "developer-note": "",
      "length": "54:03",
      "note": "",
      "size": 12972528,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/qnwcme/PCH061812.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-06-18 00:00:00 -0600",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>We have with us in the studio Dr.\n&lt;!--more--&gt;\nJohn Casti, a world renown scientist in complexity and systems theory and a futurist who is visiting the US from his home in Vienna Austria.  Dr Casti is the co-founder of the X-Center, a research institute focusing on human caused extreme events – also known as X-Events in complexity science — and how to anticipate them.<br />\n  Earlier, he was a senior scholar at the International Institute for Applied Systems Analysis in Vienna where he headed the project on Extreme Events in Human Society. <br /></p>\n\n<p>In the past Dr Casti has worked with the Santa Fe Institute, a nonprofit theoretical center devoted the study of complex adaptive systems, and he has taught on the faculties of Princeton, University of Arizona and NYU.\n<br />\nHe is the author of “X-Events: The Collapse of Everything” which outlines a variety of different scenarios of future human caused catastrophes that may be on the horizon.  His earlier book “Mood Matters: From Rising Skirt Length to the Collapse of the World Powers” looked at the science of social human behavior to determine how the collective moods of populations bias the social events that take place.<br /></p>\n"
}
