{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/lori-frasier-and-the-other-side-of-shaken-baby-syndrome-112514/",
    "podcast": {
      "developer-note": "",
      "length": "57:13",
      "note": "",
      "size": 20598141,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/da6jyp/TIM_112514.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 24 Feb 2015 20:00:00 +0000",
        "timestamp": "1424826000"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Lori Frasier and the other side of Shaken Baby Syndrome"
  },
  "title": "Lori Frasier and the other side of Shaken Baby Syndrome",
  "date": "2014-11-25 00:00:00 -0500",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>In episode 38 David interviews Lori Frasier, MD, who was “pretty concerned by your interview with Professor Tuerkheimer<span class=\"ellipsis\">…</span>\n<!--more-->\non November 4th. <br />\nShe presented a highly inaccurate picture of the medical approach to these cases.\n<br />\n \nWhile Tuerkheimer limited the discussion to “Shaken Baby Syndrome”, which she defined as cases prosecuted solely on internal medical evidence (the so-called ‘triad’ of symptoms), Dr Frasier wanted to talk about “Abusive Head Trauma”, of which about half the cases she sees also have external signs of abuse (such as bruises, scratches, burn marks).\n<br />\n \nFrasier also claimed that there are very few cases prosecuted solely on the triad, that if you look closely there are often signs of abuse, and that sometimes judges exclude the evidence of abuse, but allow the triad to be entered as evidence, and convict solely on that basis. <br />\nShe feels that the defence experts are often highly irresponsible, inventing mythical diseases to help get the accused off. <br />\nAlthough she agreed that some vaccines can cause internal brain damage (such as encephalitis), she did not agree that they ever caused internal bleeding.\n<br />\n \nOne of the major problems for Shaken Baby Syndrome is that there is still no unambiguous evidence that a human being can generate the forces necessary to cause internal brain damage in an infant without external signs of injury. <br />\nFrasier conceded this point, but did not see that this should lead to a review of all convictions made based on the assumption that this is possible.\n<br /></p>\n\n<p><br /></p>\n"
}
