{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-092214/",
    "podcast": {
      "developer-note": "",
      "length": "56:5",
      "note": "",
      "size": 20461109,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/cnqvkw/BAR092214.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-09-22 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Obama Plans “Rebel” Assault on Damascus Under U.S.\n<!--more-->\nAir Cover\nThe “real objective” of President Obama’s latest mobilization in the Middle East is to deploy US air power to support a renewed “rebel” assault on Damascus, the Syrian capital, from the south, said veteran human rights activist Ajamu Baraka. <br />\nWashington’s plan remains “to engage in regime change in Syria,” which is why it gave ISIS and other jihadist groups “the green light” to ravage that nation for the last three years. <br />\nThe US is “playing with forces that they think they can control, but history has already proven that those forces have agendas of their own” and are not controllable, said Baraka, an editor and columnist for Black Agenda Report.\n<br />\nOhio Students Press for Federal Intervention in Police Killing of John Crawford III\nTwenty-three year-old John Crawford III was shopping at a local Wal-Mart in Green County, Ohio, examining a toy air rifle on display and talking on his cell phone, when police shot him dead, August 5. <br />\nThe Ohio Students Association and two other young people’s organizations, fearing a whitewash by an “old boys network,” have launched an extended campaign to compel the US Justice Department to enter the case. <br />\nThe state attorney general was a prosecutor in Green County, as is his daughter, and the officer that shot Crawford killed another man in 2010, but was never indicted, said student organizer James Hayes. <br />\n“Young people are coming of age at a time where this violence is so common, it’s predictable,” said Hayes. <br />\n“We’re in this for the long haul; we’ve got our eyes on the prize.<br />\n”\nUS Prison Population on the Rise Again\nThe nation’s prison population increased slightly in 2013, after a three-year downward trend. <br />\nMarc Mauer, executive director of The Sentencing Project, points out that the recent period of decline “only happened after nearly 40 years of record historic rises in the inmate population to more than two million people behind bars.<br />\n” Three states – New Jersey, New York and California – were responsible for much of the previous decreases, with California under court order to reduce its prison population. <br />\nThose who thought mass incarceration could be cured by “tinkering around the edges” of the system, were wrong, said Mauer. <br />\n“This is the result of centuries of a racist history, particularly in the justice system.<br />\n”\n“Rwanda Day”: Propaganda Based on Lies\nThousands flocked to Atlanta to celebrate – or protest against – “Rwanda Day,” a yearly public relations event staged by the Rwandan government of dictator and warlord Paul Kagame. <br />\nThe minority, Tutsi-dominated regime and its western backers claim Kagame’s military stopped the Rwandan genocide in 1994, and then brought prosperity to the country. <br />\nBut the truth is far different, said Claude Gatebuke, a genocide survivor and executive director of the African Great Lakes Action Network. <br />\nRwanda’s relative prosperity is based on “billions of dollars in diamonds and coltan and other minerals stolen from” the neighboring Democratic Republic of Congo, where Rwandan and Ugandan troops uNaming, Shaming the Black Caucus, These Joes Ain’t Loyal, ISIS, Wayne Pharrnleashed a genocide that has claimed six million lives.\n<br />\nAristide Under House Arrest in Haiti\nFormer Haitian president Jean Bertrand Aristide, who was overthrown by the US in 2004, is under house arrest on orders of a judge allied with the US-backed current president, Michel “Sweet Mickey” Martelly. <br />\nThe vague charges against Aristide – of stealing public funds while in office – are “completely bogus” and create a climate reminiscent of “the bad old days” under the Duvalier dictatorship, said Pierre Labossiere, co-founder of the Haiti Action Committee. <br />\nLabossiere said it’s all part of a scheme to “smear Fanmi Lavalas,” Aristide’s political party, and once again “banish them from elections” – or to cancel elections altogether and allow Martelly to rule by decree.\n<br />\nMumia: The Lures of War\nThe 2008 version of Barack Obama looked to many “like the antidote to the bellicosity of George W. <br />\nBush,” said Mumia Abu Jamal, the nation’s best known political prisoner. <br />\nBut, once in office, “the lures of war have been almost impossible to resist.<br />\n” The US has reportedly launched 94,000 drone strikes in Afghanistan, Pakistan, Iraq, Libya, Somalia and Yemen. <br />\nHow many people have died? <br />\n“We don’t know,” said Abu Jamal – and most Americans “don’t care.”<br /></p>\n"
}
