{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-082814/",
    "podcast": {
      "developer-note": "",
      "length": "57:18",
      "note": "",
      "size": 20633008,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/fe72gv/LeidStories082814.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-08-28 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Ferguson, MO: U.N.\n&lt;!--more--&gt;\nIntervention Sought; National Youth Rally Planned\nRebuke of Cuomo Confirms Why Sharpton Won’t Demand Special Prosecutor in Chokehold Case\nIn the aftermath of the Aug. <br />\n9 police killing of Michael Brown, Ferguson has become the epicenter of related political and social action.\n<br />\nLeid Stories reports today on a human-rights initiative seeking protection under international conventions for Ferguson residents and citizens elsewhere in the United Nations engaged in lawful protest and the exercise of their democratic rights.\n<br />\nDr Mustafa Ansari, dean of the American Institute for Human Rights and point person on the initiative, discusses human-rights violations in Ferguson—which, he says, are continuing.\n<br />\nThe newly formed Justice for Michael Brown Leadership Coalition leads a “National March on Ferguson” this Saturday (Aug. <br />\n30), aimed at galvanizing the unharnessed social and political power of youth and channeling it toward actions and solutions to the myriad problems confronting this demographic. <br />\nLeid Stories gets an insider’s view of the aims and objectives of the march and, more importantly, the targets of its directed action.\n<br />\nA New York Times editorial board rebuke Tuesday of New York Gov. <br />\nAndrew Cuomo that explained its refusal to endorse him in the Sept. <br />\n9 primary because he failed at the ‘No. <br />\n1 job” of cleaning up corruption in state government also confirms why the Rev. <br />\nAl Sharpton is not demanding that he appoint a special prosecutor in the police chokehold death of Eric Garner. <br />\nLeid Stories explains.<br /></p>\n"
}
