{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-070813/",
    "podcast": {
      "developer-note": "",
      "length": "57:57",
      "note": "",
      "size": 13909159,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/6fk34/PCH070813.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2013-07-08 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>How to prepare ourselves emotionally to take on the challenge  to oppose the threats from government, corpoations,<span class=\"ellipsis\">…</span>\n<!--more-->\nmedia.\n<br />\nProfessor Robert Jensen is a professor of journalism at the University of Texas at Autism and a long time radical social activist. <br />\nHis writings cover radical feminist critiques of pornography, post-modern masculinity, race issues, and foreign policy and politics. <br />\nRecently he conducted an online personalized survey to gather emotional actions from people around the nation about the particular economic, political, environmental and social challenges and crises that most people are facing. <br />\nWe will discuss some the most common responses together in his survey.<br />\n He has written many books dealin\\g with the media and postmodern American society. <br />\nHis most recent is Arguing for Our Lives: A User’s Guide to Constructive Dialogue\nProfessor Robert Thurman holds the Jay Zong Kah-pa Robert Thurman Chair of Indo-Tibetan Studies at Columbia University. <br />\nHe is the President of Tibet House US – which is dedicated to preserving Tibetan civilization, and is President of the American Institute of Buddhist Studies. <br />\nThe New York Times has hailed Bob as the “leading American expert on Tibetan Buddhism.<br />\n”   In 1962, Prof. <br />\nThurman was ordained as a Buddhist monk by the Dalai Lama, with whom he has remained a close colleague to this day.<br />\n  He is a passionate advocate not only for the rights of Tibetans but for human rights and social justice globally. <br />\nHe has been sought by policy makers on the Tibetan holocaust, and has testified before the Senate Foreign Relations Committee.\n<br />\nProf. <br />\nThurman has written many books on Tibetan culture, art, politics and Buddhism. <br />\nHis earlier book Inner Revolution: Life, Liberty and the Pursuit of Real Happiness laid down the argument that individual happiness is interrelated with the happiness of all which can serve as a guide for social activism as well. <br />\nHis forthcoming book to released in September, and co-written with Sharon Salzberg, is Love Your Enemies: It will Drive Them Crazy</p>\n\n<p><br /></p>\n"
}
