{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour/",
    "podcast": {
      "developer-note": "",
      "length": "55:24",
      "note": "",
      "size": 13297392,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/gy9hy4/ProgressiveCommentaryHour010211.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-01-02 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Guests: Dr. David Carpenter and Joshua Hart\nDr.\n&lt;!--more--&gt;\nDavid Carpenter is a medical doctor trained at Harvard School, now serving as the director of the Institute for Health and the Environment at the University of Albany’s School of Public Health. <br />\nIn the past he served as the director of the Wadsworth Laboratory of the New York State Department of Health – an agency he worked at for 18 years — and was recently appointed to New York’s Renewable Energy Task Force to implement plans to reduce electricity use through new energy efficiency programs. <br />\nDr Carpenter has been a leading voice warning about the dangers of radiofrequency radiation associated from Electro Magnetic Field (EMF) technologies and is the author of the very comprehensive “Bioinitiative Report” about the health hazards of EMFs. <br />\nDr Carpenter has published over 220 peer reviewed papers and reviews\nFor those wishing to read the Bioinitiative Report on EMFs:  www.Bioinitiative.org/Report/index.<br />\nhtm\nJoshua Hart is the Director of Stop Smart Meters, an advocacy media organization fighting against the forced deployment and installation of wireless utility meters that harm health, violate civil liberties and endanger public safety. <br />\nJosh has an advanced degree in Transportation Planning from the University of the West of England and has worked in the energy industry as an urban planner and environmental advocate. <br />\nHis research and journalism has been covered in many media outlets including the BBC, the Guardian, the Daily Mail in the UK, Surveyor Magazine and Carbusters.\n<br />\nWEBSITE FOR MORE INFO:  www.StopSmartMeters.org\n<br /></p>\n"
}
