{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-special-on-vaccines-specifically-gardasil-032213/",
    "podcast": {
      "developer-note": "",
      "length": "1:49:26",
      "note": "",
      "size": 52529946,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/y89ekz/GaryNullShow032213.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Special on Vaccines, Specifically Gardasil"
  },
  "title": "Special on Vaccines, Specifically Gardasil",
  "date": "2013-03-22 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>A special documentary investigation on vaccines and specifically vaccination for HPV, with panelists Dr. Toni Bark, Dr.\n&lt;!--more--&gt;\nNancy Banks, Dr Meryl Nass, and Dr Lucija Tomljenovic, and Luanne Pennesi.\n<br />\nDr Toni Bark is a pediatric physician and a prestigious homeopathic doctor practicing in the Chicago area. <br />\n This year she was awarded the honor of vice president of the American Institute of Homeopathy. <br />\nIn addition to receiving her medical degree from Rush Medical College and pediatric internship at NYU, she has degrees in psychology, a masters in Healthcare Emergency Management from Boston University Medical School, is a trained hypnotherapist under Dr Ericca Fromm with the American Society for Clinical Hypnosis and has been a student and practitioner of holistic medicine since 1993. <br />\nDr Bark is a regular guest speaker at the University of Chicago and has contributed to numerous books on homeopathy. <br />\nShe has contributed to Louise Habakus and Mary Holland’s important book Vaccine Epidemic, and is featured in radio, television and continues to teach and lecture on homeopathy and health in the Chicago area. <br />\nHer website and blog is www.Disease-Revesal.<br />\ncom\nDr Meryl Nass is a board certified physician in Internal Medicine practicing at Mount Desert Island Hospital in Bar Harbor Maine, where she also runs a clinic treating patients from Gulf War Syndrome, Multiple Chemical Sensitivity conditions, Fibromyalgia, Chronic Fatigue and other related disorders. <br />\nShe regarded as expert in biological warfare and bioterrorism, which she has investigated since 1989, and in 1992 was the one who identified the use of anthrax as a biological weapon in Rhodesia’s civil war in the late 1970s. <br />\nDr Nass is a staunch opponent to the anthrax vaccine and was instrumental in the creation of a coalition to fight the Anthrax Vaccine Immunization Program. <br />\n Since 1999, she has testified to four Congressional Committees about anthrax, the anthrax vaccine and biological warfare.\n<br />\nDr Lucija Tomljenovic is an early career postdoctoral fellow. <br />\nShe received her PhD in Biochemistry, from the Comparative Genomics Centre at James Cook University in Townsville, Australia. <br />\nIn 2010, she joined the Neural Dynamics Research Group at the University of British Columbia to work on with renowned neuroscientist Prof. <br />\nChristopher Shaw’s and is currently researching the neurotoxic effects of aluminum vaccine adjuvants. <br />\nLucija is also an Associate Editor of the Journal of Alzheimer’s Disease. <br />\n  She and her colleagues are among the few courageous university researchers undertaking independent and honest experiments into vaccines\nDr Nancy Banks was trained in OBYN medicine and gynecological oncology at Harvard Medical School and practiced general obstetrics and gynecology for over twenty-five years and as well pursuing practices in homeopathy and naturopathy. <br />\nDr Banks also has an MBA in Finance and conducts cutting edge research into the history of medicine. <br />\nShe currently resides in Guadalajara Mexico as a medical consultant and works with the Office of Medical and Scientific Justice, a private research firm founded by Clark Baker, that investigates allegations of medical and scientific corruption by government agencies, drug makers and research centers and their dissemination of junk science. <br />\nHer “AIDS, Opium, Diamonds and Empire: The Deadly Virus of International Greed” is a meticulously researched and documented tour de force that sheds like on the history of the financial and corporate oligarchic elites’ 100 year control of the medical pharmaceutical complex, the hidden motives behind the war on drugs, the diamond industry and the globalization of the false science behind AIDS\n<br /></p>\n"
}
