{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-021015/",
    "podcast": {
      "developer-note": "",
      "length": "58:01",
      "note": "",
      "size": 20888414,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/u2spqb/NaturalNurse_021015.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "The Natural Nurse"
  },
  "title": "The Natural Nurse",
  "date": "2015-02-10 00:00:00 -0500",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Ellen Kamhi PhD RN, www.naturalnurse.com interviews Dr. Victoria Sweet, MD. Dr.\n&lt;!--more--&gt;\nSweet is an Associate Clinical Professor of Medicine and History at the University of California, San Francisco, and a prize-winning historian with a PhD in medical history. <br />\nShe practiced medicine for twenty years at Laguna Honda Hospital in San Francisco. <br />\nIn her prize-winning book, God’s Hotel: A Doctor, a Hospital, and a Pilgrimage to the Heart of Medicine (Riverhead, 2012), she lays out her evidence ”in stories of her patients and her hospital. <br />\n” , for some radically new ideas about medicine and healthcare. <br />\nIn our attempts to get control of healthcare costs by privileging “efficiency,” she suggests, we’ve been headed down the wrong path. <br />\nMedicine works best—that is, arrives at the right diagnosis and the right treatment for the least amount of money—when it is personal and face-to-face; when the doctor has enough time to do a good job, and pays attention not only to the patient but to what’s around the patient.<br />\n  Dr Sweet calls this approach Slow Medicine, and she believes that, put into wider practice, it would be not only more satisfying and beneficial for patient and doctor, but also less expensive for everyone. <br />\nHer Ecomedicine Project is designed to prove this. <br />\nThe New York Times calls her ideas “hard-core subversion”; Vanity Fair judges the book to be a “radical and compassionate alternative to modern healthcare,” andHealth Affairs describes Dr Sweet as a “visionary” and “subversive in all the best ways.” She was awarded a Guggenheim Fellowship (2014) for her next project, tentatively entitled, Slow Medicine, Fast Medicine: Healing in an Age of Technology.Contact: www.victoriasweet.com\n<br /></p>\n"
}
