{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-173/",
    "podcast": {
      "developer-note": "",
      "length": "1:04:33",
      "note": "",
      "size": 15494256,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/bmt3g4/GaryNullShow081011.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-08-10 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guests: Dr. Dean Baker and Professor Pte Navarro\nDr.\n&lt;!--more--&gt;\nDean Baker is co-director of the Center for Economic and Policy Research in Washington, DC. <br />\n He is frequently cited in economics reporting in major media outlets, including the New York Times,Washington Post, CNN, CNBC, and National Public Radio. <br />\n He writes a weekly column for the Guardian Unlimited (UK), and his blog, Beat the Press, features commentary on economic reporting. <br />\n In the past, Dean was a senior economist for the Economic Policy Institute and a professor at Bucknell University. <br />\nHe has also served as a consultant for the World Bank, the Congressional Joint Economic Committee and the OECD’s Trade Union Advisory Council.\n<br />\nDean has written several books, his latest being False Profits: Recovering from the Bubble Energy, which chronicles the failure of top regulators and our political system that led to trillions of dollars loss in wealth, housing and our current recession.\n<br />\nProf. <br />\nPeter Navarro is a professor of economics and public policy at the University of California at Irvine. <br />\n He has received his doctorate in economics from Harvard, and has worked as a policy analyst for the Department of Energy and taught at several universities.\n<br />\nHis recent research has been to investigate the increasing role of China’s domination in the global economy and its trends as a rising military and technological powerhouse. <br />\n His research has recently been published in a new book –“Death By China: Confronting the Dragon” which defines much of the darker side of China’s global strategic directions that are not be covered by the corporate media and our politicians.<br /></p>\n"
}
