{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-071414/",
    "podcast": {
      "developer-note": "",
      "length": "55:54",
      "note": "",
      "size": 13416594,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/bh9pxj/BAR_071214.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-07-14 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Global Capitalist Champion Barack ‘Insane’ Obama\n </p>\n\n<p>“If African people are going to be free, it’s going to be because<span class=\"ellipsis\">…</span>\n<!--more-->\nwe’ve made a revolution,” said Omali Yeshitela, chairman of the African People’s Socialist Party (APSP), at its headquarters in St. <br />\nPetersburg, Florida. <br />\nThe APSP kicked off a month-long period of intensive study for party cadre from around the Diaspora. <br />\n“Finance capital presides over a world economy where 80 percent of human beings on Earth are trying to exist on far less than ten US dollars a day,” said Yeshitela. <br />\n“This is the relationship that Barack Hussein Obama – we ought to call him Barack ‘Insane’ Obama – is protecting” with his drone strikes, military aggressions and sanctions campaigns.\n<br /></p>\n\n<p>Marissa Alexander Supporters to Hold “Stand Our Ground Week”\n </p>\n\n<p>Supporters of Marissa Alexander, the Black mother sentenced to a long prison term for using a firearm to warn off an attack by her estranged husband, will hold a “Stand Our Ground Week” in Jacksonville, Florida, July 25 through August 1. <br />\nAlisa Bierria, one of the organizers, said the issues at stake go beyond the injustice done to one Black woman. <br />\n“Her case reflects many different kinds of urgent issues,” she said, “including the need to end domestic violence and to take a serious look at the impact of mass incarceration and mandatory minimums in Black communities.<br />\n”</p>\n\n<p>Beyond Innocence: Excessive Sentencing\n </p>\n\n<p>The Beyond Innocence Project – not to be confused with Barry Scheck’s Innocence Project – is a national coalition of family members of imprisoned people. <br />\nOrganizer Carolyn Esparza, in El Paso, Texas, said the group’s main concern isn’t guilt or innocence, but sentences that far outweigh the crime. <br />\n“Families are frightened to speak out,” said Esparza, “because when we speak out against the system there’s retaliation against our loved ones in prison.\n<br /></p>\n\n<p>Millions Press for Internet Neutrality\n </p>\n\n<p>“It’s the plutocrats versus the people,” said Kevin Zeese, of Popular Resistance, assessing the battle to keep the Federal Communications Commission from turning the Internet over to huge corporations. <br />\nMillions of people have registered their outrage and demanded that the FCC treat the Internet as a “common carrier,” like a public utility. <br />\n“We have to get mobilized in the streets and show them that we’re going to stop government if they destroy th e Internet,” said Zeese.\n<br /></p>\n\n<p>Mumia: Palestinian “David” versus Israeli Goliath\n </p>\n\n<p>The story of David and Goliath depicted the biblical Jews as underdogs, but the opposite is true in today’s Middle East, said Mumia Abu Jamal, America’s best known political prisoner. <br />\n“Israel has the most powerful military in the region, and Palestine – an occupied people, a captive people – is David,” said Abu Jamal, in a report for Prison Radio. <br />\n“David has little more than a stone and a prayer.<br />\n”</p>\n\n<p>Obam a Lets Mass Killers of Africans Off Hook\n </p>\n\n<p>The Obama administration claims it will sanction all those guilty of destabilizing the Democratic Republic of Congo, where at least six million people have died since 1996. <br />\nHowever, Kambale Musavuli, of Friends of Congo, said the administration is only going after “small time players” and giving immunity to high officials of Rwanda and Uganda, the US allies most culpable in the slaughter. <br />\nObama’s Africa policy, said Musavuli, “is even worse than the Republicans, bringing AFRICOM onto the continent, supporting ‘strong men’ and inviting dictators to  the White House.”</p>\n\n<p><br /></p>\n"
}
