{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-diana-082213/",
    "podcast": {
      "developer-note": "",
      "length": "59:13",
      "note": "",
      "size": 14214269,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/d3kunu/GaryNullShow082213.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Diana"
  },
  "title": "Diana",
  "date": "2013-08-22 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>New evidence for a murder of Princess Diana - a look at the controversies surrounding the official report of Diana’s<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\ndeath - with John Morgan.\n<br />\n John Morgan is an investigative journalist living near Brisbane Australia. <br />\nAfter being diagnosed with Multiple System Atrophy and retiring, he has devoted many years researching and writing about the circumstances surrounding her death in a car accident in 1997. <br />\n He has become the go-to forensic expert in analyzing the British and French records and the Paget investigation report that concluded Diana’s death as an accident. <br />\n In 2009, John received a large volume of unpublished documentation from within the British police Paget investigation, which the court jury never saw, and further revealed a British cover-up to protect the royal family and British military intelligence, suggesting the accident was a planned assassination. <br />\nFor the past six years, John has published a series of books, under the heading “Diana Inquest” including copious official documentation and transcripts of interviews and legal testimonies. <br />\n Among the series are Cover Up of a Royal Murder, The French Cover-up, The British Cover-up, How and Why Did Princess Diana Die, and Who Killed Princess Diana. <br />\n  John’s recent “The Paris-London Connection: The Assassination of Princess Diana” released in 2012 is a condensed version of the entire series.<br /></p>\n"
}
