{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-157/",
    "podcast": {
      "developer-note": "",
      "length": "65:58",
      "note": "",
      "size": 15654240,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/zfvsbb/GaryNullShow072011.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-07-20 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Mike Adams is perhaps the most important voice of the generation to have emerged in alternative medicine and public<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nhealth issues. <br />\nEarlier he was immersed in the common mindset of most Americans – living a high-powered life under extreme stress and depression and at the age of 30 was diagnosed with Diabetes type 2. <br />\n After embracing alternative medicine and a healthy lifestyle, he cured himself in several months and has dedicated his life to mind-body medicine, natural health, researching the underlying causes of disease and critiquing the flaws in our dominant medical paradigm.\n<br />\nMike now is the founder of NaturalNews.<br />\ncom and has written over 1,600 articles on health and critiques about modern medicine under the title of Health Ranger. <br />\nHis non-profit organization, The Consumer Wellness Center, and publishing company Truth Publishing are now leading education arms for consumer information and research on the benefits of vegetarian diet, supplements, lifestyle change, exercises.\n<br />\nMike is host of the Natural News Hour on Progressive Radio Network every Saturday at 6:00 PM (Eastern time) and is founder of the Natural News.TV on the internet.<br /></p>\n"
}
