{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour/",
    "podcast": {
      "developer-note": "",
      "length": "59:06",
      "note": "",
      "size": 14183712,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/fx4utr/ProgressiveCommentaryHour111411.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2011-11-14 00:00:00 -0700",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Guests David Braun, Jennifer Krill, Sharon Wilson, and Craig Michaels\nWe have on the line David Braun who is at this<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nmoment up in the Capitol offices in Albany awaiting to testify on behalf of opposition to hydrofracking in New York State. <br />\n David is helping to coordinate anti-fracking efforts with our rally at Governor Andrew Cuomo’s Manhattan office this coming Saturday at Noon. <br />\n David Braun is the co-founder and president of United for Action, a nonprofit public policy organization dedicated to stopping hydraulic fracturing of gas wells in the Mid Atlantic states and nationally. <br />\n He is also the campaign director for the Academy Award nominated documentary Gasland. <br />\n David has testified before the New York Senate in opposition to gas drilling in the Marcellus shale beds that are being targeted by the oil and gas industry.\n<br />\nWEBSITE :   www.UnitedForAction.<br />\norg\nJennifer Krill has been an activist for environmental advocacy for over thirty years and is the new Executive Director for Earthworks, a 30-year old national organization dedicated to protecting the environment from the blows of mineral, oil and natural gas extraction and development and their impact on social issues and human rights. <br />\n Earlier she was the Program Director for the Rainforest Action Network and a program director for its campaigns to protect old growth forests from the oil and energy industries. <br />\n Jennifer’s career also includes stints with Greenpeace, Earth Island Institute and the Sea Turtle Restoration Project. <br />\n  She also serves on the advisory committee of the Business Ethics Network.\n<br />\nWEBSITE :   www.EarthworksAction.<br />\norg\nSharon Wilson is considered the leading citizen expert about the Barnett Shale beds. <br />\nShe has become the go-to person in Texas for information on the destructive environmental impacts and risks to human health caused hydrofracking for top EPA officials from DC, national news networks and national environmental organizations in addition citizens groups and individuals with gas drills operating in their neighborhoods. <br />\nPrior to her activism opposing hydrofracking, Sharon worked in the energy industry for twelve years. <br />\n She has now combined her forces with Earthwork’s Oil and Gas Accountability Project, and is a co-author Texas OGAP report\nFlowback: How the Texas  Natural Gas Boom Affects Health and Safety which can be found on the Earthworks website\nSharon’s Blog:   www.TexasSharon.com\nWEBSITE :   www.EarthworksAction.<br />\norg\nCraig Michaels is an attorney and consultant based in New York City, currently working on the hydraulic fracking issue for the Natural Resources Defense Council (NRDC) and Catskill Mountainkeeper. <br />\n He previously served as the Watershed Program Director for Riverkeeper and has been involved in this environmental issue in New York since 2009. <br />\n Craig has an undergraduate degree from the University of Michigan’s School of Natural Resources and received his J.<br />\nD from Pace Law School.\n<br />\nWEBSITE :   www.NRDC.org\n<br /></p>\n"
}
