{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-020314/",
    "podcast": {
      "developer-note": "",
      "length": "58:08",
      "note": "",
      "size": 13954821,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/txbuxm/PCH020314.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-02-03 00:00:00 -0700",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Peak Food and the Future of Food Security\nJeffrey Smith is one of the foremost experts on the health and environmental<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nrisks of genetically modified organisms, commonly known as GMO crops and foods, and is a leading watch-dog over corporate agricultural industry’s manipulation of GMO genetic science and public opinion. <br />\nHe is currently the founding director for the Institute for Responsible Technology, a research and corporate watch organization devoted to informing the public about the truth of GMO foods and technology. <br />\nJeffrey is also the director for the Campaign for Healthier Eating in America.\n<br />\nJeffrey is the author of two critical books on GMOs: “Seeds of Deception” and “Genetic Roulette: The Documented Health Risks of Genetically Engineered Foods” He is also the director and writer of the documentary film Genetic Roulette released in 1012.BOOK AND FILM: “Genetic Roulette: The Documented Health Risks of Genetically Engineered Foods” WEBSITE: www.ResponsibleTechnology.<br />\norg\nProf. <br />\nDavid Montgomery is a geomorphologist and environmentalist in the Earth and Space Sciences division at the University of Washington’s College of the Environment in Seattle. <br />\nHe specializes in the evolution of geological topography and the influence of geomorphological processes on ecological systems and human societies. <br />\nHis research has taken him world wide, the Cascade Range in the Pacific Northwest to the Andes, the Himalayas and Tibetan plateau.\n<br />\nDavid is the author of “Dirt: The Erosion of Civilizations” — an important study about the role soil and erosion has played in the rise and collapse of civilizations and societies. <br />\nHis most recent book is “The Rocks Don’t Lie: A Geologist Investigates Noah’s Flood”BOOK: “The Rocks Don’t Lie: A Geologist Investigates Noah’s Flood”\nDr Peter D. <br />\nCarter is a retired family physician who practiced medicine first in England and then in Canada for almost 40 years. <br />\nAfter his sons were born, Peter became actively involved in environmental, climate change and sustainable development issues. <br />\nHe is a founding director of the Canadian Association of Physicians for the Environment, the founder of the Climate Emergency Institute and was an expert reviewer for the IPCC fifth climate change assessment. <br />\nHe has presented on sustainable development, environmental health policy, biodiversity, climate change and human rights protection issues in Canada, the US and overseas. <br />\nSince 2007, Peter has developed a unique approach to climate change risk that has been published in scientific journals. <br />\nHe has documented the science that shows we are already far beyond “dangerous anthropogenic interference with the climate system”. <br />\nThis science shows that the world is facing planetary catastrophe from multiple amplifying feedbacks in the Arctic and will contribute to catastrophic crop declines.\n<br />\nHis website is ClimateEmergencyInstitute.com<br /></p>\n"
}
