{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-021615/",
    "podcast": {
      "developer-note": "",
      "length": "58:58",
      "note": "",
      "size": 21233102,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/wejztq/LeidStories_021615.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2015-02-19 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>No Justice, Period: The Fate of the Michael Brown and Eric Garner Cases  \n“The People’s Attorney General” Alton H.\n&lt;!--more--&gt;\nMaddox Jr.<br />\n, who long before official announcements had predicted on Leid Stories that there would be no indictments in the police killings of Michael Brown of Ferguson, Missouri, and Eric Garner of Staten Island, NY, issues indictments of his own.\n<br />\nHe discusses why, despite national and international protest, the legal rights of African Americans still are viewed through the lens of the pernicious Dred Scott decision of 1957, in which the US Supreme Court held that African Americans had “no rights that the white man is bound to respect.<br />\n”\nMaddox also discusses his own 25-year battle against New York state officials and the courts over his refusal to turn over all of his files and records pertaining to his representation of Tawana Brawley, who in 1987, when she was 15, had accused six white men, including a part-time police officer, a state trooper and an assistant district attorney in Dutchess County, of abducting and raping her.\n<br />\nMaddox, who has never been charged with any violations of the law or professional ethics, has not been granted a hearing on his being “barred,” not disbarred, from New York’s courtrooms since 1990. <br />\n  <br /></p>\n"
}
