{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/mad-in-america-with-robert-whitaker-122314/",
    "podcast": {
      "developer-note": "",
      "length": "58:06",
      "note": "",
      "size": 20918037,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/bp3ew8/TIM_122314.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "“Mad in America” with Robert Whitaker"
  },
  "title": "“Mad in America” with Robert Whitaker",
  "date": "2014-12-23 00:00:00 -0500",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>Robert Whitaker is the author of two important books critical of the current drug-oriented psychiatric treatment dogmas<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nin western approaches to so-called mental illness – “Mad in America” and “Anatomy of an Epidemic”. <br />\nHe has received several award s for his writing, including a George Polk Award and a National Association for Science Writers award, and was a finalist for the Pulitzer Prize.\n<br />\n \nWhitaker talks about the evidence that pharmaceutical drugs for diseases, such as the ill-defined ‘schizophrenia’, do not work, and actually make things worse. <br />\nThose who don’t have access to these drugs, in the third world, do better, and those who go off their medications do better than those who stay on. <br />\nHe believes that the reason the drugs are still widely used is because they do have short term benefits, and they are also addictive, so when people try to stop them their symptoms often worsen significantly for some time. <br />\nThey become a trap for doctors and for patients.<br /></p>\n"
}
