{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-022814/",
    "podcast": {
      "developer-note": "",
      "length": "54:45",
      "note": "",
      "size": 13142413,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/h75t6f/GaryNullShow_55_022814.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-02-28 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Reimagining the role of our heart and vascular system in our lives to sustain cardiovascular health.\nDr.\n&lt;!--more--&gt;\nCynthia Thaik  is a board certified cardiologist who approaches the maintenance of cardiovascular and heart health in a uniquely integrative and holistic manner. <br />\nShe has clinical wellness centers in Burbank and Valencia in Southern California and has developed a national foundation that would educate people and physicians on the prevention and treatment of cardiovascular disorders based upon proven alternative methodologies, lifestyle changes and even spiritual principles resulting from her Buddhist background.<br />\n \nDr Thaik has held teaching positions at UCLA, Harvard, University of Chicago and the University of Illinois. <br />\nOriginally from Myanmar (Burma) where she first encountered hands-on, natural healing, she later received her medical training at the University of Chicago’s School of Medicine, and continued at Harvard’s Medical School for her internal medicine and cardiology training. <br />\nShe has received many awards and honors for her innovative approaches to cardiovascular health. <br />\nShe is the author of “Your Vibrant Heart: Restoring Health, Strength and Spirit from the Body’s Core.” Her website is DrCynthia.com and YourVibrantHeart.com    \n<br /></p>\n"
}
