{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-america%e2%80%99s-fukushima-the-largest-ecological-catastrophe-in-us-history-part-3-060314/",
    "podcast": {
      "developer-note": "",
      "length": "51:5",
      "note": "",
      "size": 12443167,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/62zk5v/LeidStories_060314.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "America’s Fukushima: The Largest Ecological Catastrophe in U.S. History (Part 3)"
  },
  "title": "America’s Fukushima: The Largest Ecological Catastrophe in U.S. History (Part 3)",
  "date": "2014-06-03 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Investigative reporter Paul DeRienzo files the third installment of a series on an ecological disaster caused by<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nmassive contamination from the Hanford Site, a sprawling nuclear-reactor complex on the Columbia River in south-central Washington state.\n<br />\nToday’s program focuses on the construction and operation of the N Reactor, the last of nine plutonium-production reactors built at Hanford for the nation’s defense program. <br />\nDesigned also to produce electricity, it became the only dual-purpose reactor in the country. <br />\nWhen it was shut down after 24 years of operation (1963-1987), 1 million gallons of contaminated water and irradiated fuel rods used during production became part of the massive environmental disaster that persists today.\n<br />\nThe still-partially-functioning Hanford Site, built in 1943, was where two-thirds of the nation’s plutonium was manufactured during World War II and the Cold War. <br />\nIt housed the world’s first plutonium-production reactor that produced much of the nation’s nuclear arsenal, including the nuclear bombs used against Japan. <br />\nBut the operation of its nine reactors, phased out between 1968 and 1987, has created the largest ecological disaster in the United States.\n<br />\nDuring those 40-plus years, DeRienzo says, a steady stream of industrial and radioactive waste created by the production of the element was dumped directly into the air, river and ground of the 586-square-mile reservation. <br />\n“Now, the United States is faced with the largest cleanup in history, and little hope that it will totally succeed,” he says.\n<br />\nDeRienzo, working under a Polk Awards journalism grant, presents exclusively for Leid Stories Part 3 of his investigation: “The Hanford Site: America’s Fukushima.”<br /></p>\n"
}
