{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-148/",
    "podcast": {
      "developer-note": "",
      "length": "1:07:13",
      "note": "",
      "size": 16133904,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/rb5wup/GaryNullShow070711.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-07-07 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today’s guest is Dr.\n&lt;!--more--&gt;\nHildegarde Staninger and she is the founder of Integrative Health Systems, which researches and develops natural products for various conditions, and is the author of the international environmental bestseller the Comprehensive Handbook of Hazardous Material: Regulations, Monitoring, Handling &amp; Safety. <br />\nShe is a scientific leader in the field of industrial toxicology who has pioneered the use of biological monitoring tests for targeting organ exposure to parent compounds, metabolites and their xenobiotics. <br />\nHer research has opened the door of protenomics, enzynomics and genomics as recognized by Johns Hopkins University, Pandey Lab and Harvard University Medical College’s small molecule genome project. <br />\nIn recent years she has been researching Morgellons Disease and its relationship to nanotechnology. <br />\nDr Staninger is a former president of the Florida Chapter of the American Industrial Hygiene Association and is a former President and founder of the International Academy of Toxicological Risk Assessment (IATRA. <br />\nShe is a Certified Safety Executive by World Safety Organization and Inspector General for the International Environmental Intelligence Agency (IEIA), a division of World Life Research Institute. <br />\nShe is recipient of two Presidential Awards from Mr Walter Lowry, Martin Marietta Orlando Aerospace President, for her work involving “Pregnant Women in the Workplace” and the “Increased Risk of Genetic Mutations in Contaminated Ground Water\nAlso, we have Rosalind Peterson and she is California President and Co-Founder of the Agriculture Defense Coalition (ADC), which was founded in 2006 as a public interest organization to educate people and to protect agricultural crop production from uncontrolled experimental weather modification programs, atmospheric heating and testing programs, and ocean and atmospheric experimental geo-engineering programs. <br />\n  She has a degree in environmental studies with an emphasis on solar power, crop production and efficient uses of energy. <br />\nRosalind’s focus is on how geo-engineering scheme, coupled with experimental atmospheric programs, have a negative impact upon our environment:  upon nature’s pollinators, wildlife, agriculture, trees, human health, soils, and our water supplies. <br />\nShe was a keynote speaker at the 60th Annual DPI/NGO Conference on Climate Change speaking on the impact of persistent jet contrails on tree and plant health. <br />\nShe is retired from the USDA where she was a Farm Service Agency Agriculture Crop Loss Adjustor.\n<br /></p>\n"
}
