{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/infectious-myth-aspartame-with-woodrow-monte-080514/",
    "podcast": {
      "developer-note": "",
      "length": "55:52",
      "note": "",
      "size": 20114136,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/czjhum/InfectiousMyth_080514.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Aspartame with Woodrow Monte"
  },
  "title": "Aspartame with Woodrow Monte",
  "date": "2014-08-05 00:00:00 -0400",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>In Episode 24 David talks with Woodrow Monte, a retired PhD food scientist, with 25 years experience teaching and<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nresearching at Arizona State University. <br />\nSince the 1980s Woodrow has been very concerned about the massive quantity of Aspartame in our food supply, particularly in diet sodas.\n<br />\nEach molecule of aspartame breaks down quickly in the body to produce a methanol molecule. <br />\nIf there is no ethanol (drinking alcohol) in our body, the body will convert it to formaldehyde, which is highly reactive, and causes an inflammatory reaction. <br />\nHe believes that it is this that causes the artery clogging that produces heart disease, and that causes the damage to veins in the brain that characterizes alzheimers and Multiple Sclerosis (MS). <br />\nHe also believes that methanol is responsible for many birth defects, and also some types of cancer.\n<br />\nAlthough methanol is also found in canned fruits and vegetables, and particularly in canned juices, and is also absorbed from inhaling cigarette smoke or wood smoke, the vast majority of methanol consumed today is from aspartame.\n<br />\nMethanol is highly toxic to humans. <br />\nFrom one teaspoon to one tablespoon will kill a person, depending on their size, although it takes a long time for the methanol to be converted to formaldehyde and start the damage in the body. <br />\nIronically, the only real antidote to methanol is ethanol, which blocks the conversion to formaldehyde, which may explain why people who consume 1-2 drinks of alcohol a day are healthier than both teetotallers and over-drinkers.\n<br />\nPeople can find more about this issue on Dr Monte’s website, http://whilesciencesleeps.com, including a freely available chapter on birth defects available in text or audio book format.<br /></p>\n"
}
