{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-062512/",
    "podcast": {
      "developer-note": "",
      "length": "2:58:16",
      "note": "",
      "size": 42787728,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/6fwz3z/Progressivecommentaryhour062512.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-06-25 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Dr.\n<!--more-->\nPeter Kornbluh is the senior analyst at the National Security Archives at George Washington University where he is the director of Cuba and Chile Documentation projects.  Formerly he was the co-director of the Archive’s Iran-Contra project.  He is former adjunct professor at Columbia University and has published many books including “The Pinochet File: A Declassified Dossier on Atrocity and Accountability”, based upon 24,000 declassified documents which was selected as the year’s best book by the Los Angeles Times, and also “The Politics of Illusion: The Bay of Pigs Invasion ReExamined.<br />\n” He has also published important volumes on the Cuban Missile Crisis and the Iran-Contra scandal.\n<br />\nDr Kornbluh’s articles have appeared in the journal Foreign Policy, the New York Times and Washington Post, The Nation, and he frequently appears on national television and radio broadcasts.  He was the consultant for the Discovery-Times documentary “Kennedy and Castro: The Secret History.<br />\n”\nDr John Prados is a colleague of our guest Peter Kornbluh, and heads the Vietnam and Intelligence Documentation Project at the National Security Archives at George Washington University. <br />\nHe also co-directs the Archive’s Iraq Documentation Project and is a senior research fellow specializing in national security issues and central and military intelligence.  Dr Prados has published over 20 books focusing on Vietnam operations, the Cold War, secret CIA activities, the Pentagon Papers, President Bush’s selling us the Middle East conflicts and others.  He has received wide recognition for his scholarship and was twice nominated for the Pulitzer Prize.  His most recent publications are the just released “In Country: Remembering the Vietnam War” and earlier “Safe for Democracy: The Secret Wars of the CIA”,  “How the Cold War Ended” and “Vietnam: The History of an Unwinnable War.”  In 2004, Dr Prados also published “Hoodwinked: The Documents that Reveal How Bush Sold Us a War.<br />\n”</p>\n\n<p>Barrie Zwicker is a Canadian investigative journalist who has been recognized as one of Canada’s leading media critics. <br />\nHe was an award winning writer for the Globe and Mail, the Toronto Star, Detroit News and other publications. <br />\nBarrie is also a television and documentary film producer and a political activist who researches false flag operations and mainstream media complicity with official reports and lack of journalistic due diligence.   His book “Towers of Deception: The Media Cover-up of 911” earned gold in the 2007 Independent Publishers Awards.<br />\n  His video documentary on 911 media news, “The Great Conspiracy” was made available in 2004.\n<br />\nBarrie is also a avid cross-country cyclist who will be completing his cross-Canadian journey ending in St. <br />\nJohn’s Newfoundland this year.\n<br />\nAlan Hart is a highly regarded British journalist and investigative reporter and author who has been covering the Israel-Arab relations and Middle East conflicts for 40 years. <br />\nHe was a correspondent for ITN’s News at Ten and BBC’s Panorama programs, which covered wars and conflicts . <br />\nOver the years Alan has interviewed and met with all of the most significant leaders on both sides of Israeli-Palestinian issues. <br />\nHis biography of Yasser Arafat in 1984, “Arafat: Terrorist and Peacemaker?” has been revised and re-released over the years, and his most current book is “Zionism: The Real Enemy of the Jews” which deconstructs in hard terms the mythologies and politicalization that is associated with the term.<br /></p>\n"
}
