{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/corruption-of-big-pharma-and-the-medical-establishment-as-a-threat-to-health-111814/",
    "podcast": {
      "developer-note": "",
      "length": "59:43",
      "note": "",
      "size": 21498112,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/ermd2b/PCH_111814.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Corruption of Big Pharma and the Medical Establishment as a threat to health"
  },
  "title": "Corruption of Big Pharma and the Medical Establishment as a threat to health",
  "date": "2014-11-19 00:00:00 -0700",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nBeatrice Golomb is a Professor of medicine and Family and Preventative Medicine at the University of California at San Diego.  She is a staff physician at the San Diego Veterans Healthcare Center, is a member of the Cochrane Adverse Effects Methods Group, and has served as a health consultant for RAND.<br />\n  She holds both an MD and a PhD in biology from the University of California. <br />\nDr Golomb’s research has focused upon methodologies for determining drug risk-benefits, oxidative stress, medication effects, autism and environmental medicine. <br />\nShe is best known for her research into Gulf War illnesses, cholesterol and statins, CoQ10 and chocolate. <br />\nShe has authored three volumes reviewing the medical literature related to Gulf War illnesses and has sat on the Department of Veterans Affairs Research Advisory Committee on Gulf War Veteran’s illnesses.  Dr Golomb has received many awards and honors including being listed in Who’s Who in America,  a fellow at the Royal Society of Medicine, and the Robert Wood Johnson Physician Faculty Scholar Award.  Her work has been featured in all major newspapers, the major television networks, NPR and international media outlets.  Her website is StatinEffects.<br />\ncom</p>\n\n<p>Dr Peter Gotzsche is a specialist in internal medicine and a co-founder of The Cochrane Collaboration, which was started in 1993. <br />\nHe also established the Nordic Cochrane Center at the University of Copenhagen where he is now its chief physician and researcher and a professor of clinical research design and analysis.<br />\n  Dr Gotzsche has become an international critic of mammography screening and has written extensively on it being scientifically unjustified in peer reviewed literature. <br />\nIn Europe, he is a leading advocate for clinical data transparency within the private and government establishment, and is a voice demanding priority for patient welfare over commercial drug interests.\n<br />\n \nIn addition to his book exposing the lies behind mammography screening, Dr Gotzsche’s most recent release is “Deadly Medicines and Organized Crime: How Big Pharma has Corrupted Healthcare”, a harsh indictment against the Drug industry for selling lies about drugs rather medically proven treatments and cures. <br />\nThe websites are Cochrane.dk   and  Cochrane.org\n <br /></p>\n"
}
