{
  "header": {
    "category": "the-wake-up-call",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thewakeupcall.podbean.com/e/the-stock-market-is-folding-like-an-iphone-6-101714/",
    "podcast": {
      "developer-note": "",
      "length": "56:05",
      "note": "",
      "size": 20193609,
      "type": "audio/mpeg",
      "url": "http://thewakeupcall.podbean.com/mf/feed/b7fchd/WakeUpCall_101714.mp3"
    },
    "show": {
      "category": [
        "Business",
        "Investing"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/276914/Richard_Martin_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 23 Feb 2015 21:03:15 +0000",
        "timestamp": "1424743395"
      },
      "subtitle": "Your Economic Survival?  They're Not Looking Out For You.  We are.",
      "title": "The Wake Up Call"
    },
    "tags": [
      "Business",
      "Investing",
      "the-wake-up-call"
    ],
    "title": "The Stock Market Is Folding Like An iPhone 6"
  },
  "title": "The Stock Market Is Folding Like An iPhone 6",
  "date": "2014-10-17 00:00:00 -0400",
  "categories": [
    "the-wake-up-call"
  ],
  "content": "<p>The government’s and the media’s desperate efforts to paint lipstick on pigs.\n<!--more-->\nThey claim consumer spending will save the day, conveniently forgetting that the “consumer”has neither money, assets nor borrowing power. <br />\nThis does not stop the powers-that-be trying to coax them into spending money they do not have on things they can ill-afford. <br />\nThese monsters are the drug-equivalent of enablers on steroids. <br />\nThey lie through their teeth and there’s not a damned thing you can do about it (except leave!<br />\n) The current AIG trial. <br />\nWell, well worth reading the transcript. <br />\nIt reads like a detective story. <br />\nYou get a fascinating insight into the mindsets of these government crooks. <br />\nHouston has issued subpoenas demanding pastors turn over any sermons dealing with homosexuality, gender identity or the mayor, lesbian, Annise Parker. <br />\nAnd then there’s the story of the ‘Attack Team’ that roughed up the wrong family, brutalizing and arresting them and then charging them with assaulting police officers. <br />\nThis just might not have happened if they’d been living in, say, Malaysia or Costa Rica. <br />\nAmerica creates its own enemies which is bound to have significant negative effects everywhere. <br />\nSupport for Nigel Farage’s UKIP party in the UK is surging. <br />\nStarbucks baristas have been forbidden to write the names of its customers on its polystyrene cups at a branch near the CIA. <br />\n(Could be outing an agent, you see…)\n<br /></p>\n"
}
