{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-economic-climate-092712/",
    "podcast": {
      "developer-note": "",
      "length": "1:03:52",
      "note": "",
      "size": 15330011,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/we9szi/GaryNullShow092712.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Economic Climate"
  },
  "title": "Economic Climate",
  "date": "2012-09-27 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Illegal drugs, governments, banks, America’s economic climate\nCatherine Austin Fitts is the president of Solari Inc and<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nthe publisher of the Solari Report, which provides investment consultation for shifting wealth away from financial institutions without acting on our best interests.  Earlier, Catherine served as a managing director and a member of the board of directors for the Wall Street investment bank Dillon Read, and was the Assistant Secretary of Housing and Federal Housing Commissioner at the US Department of Housing and Urban Development during the first Bush administration.  After leaving the Bush Administration, Catherine founded The Hamilton Securities Group, Inc.<br />\n, an investment bank and financial software developer named after the first US Secretary of Treasury, Alexander Hamilton. <br />\nIn 1996, she and her successful company became targets of a vicious, longlasting “qui tam lawsuit”, that resulted in the closing of Hamilton Securities.<br />\n  Fitts was ultimately successful in Court of Claims litigation asserting that the government had no right to withhold monies owed to Hamilton.\n<br />\nTo date, she has designed and closed over $25 billion worth of transactions and investments and led investment strategies for over $300 billion in assets and liabilities.\n<br />\nHer website is  www.Solari.com\n<br /></p>\n"
}
