{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-062513/",
    "podcast": {
      "developer-note": "",
      "length": "54:46",
      "note": "",
      "size": 13144712,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/xaqekj/NaturalNurse062513.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "The Natural Nurse"
  },
  "title": "The Natural Nurse",
  "date": "2013-06-25 00:00:00 -0400",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Hosts Dr.\n<!--more-->\nEugene Zampieron, ND, MH, www.drznaturally.com and Ellen Kamhi, PhD, RN, www.naturalnurse.<br />\ncom discuss the peer review research paper they published in The JOURNAL OF RESTORATIVE MEDICINE, entitled Natural Support for Autoimmune and Inflammatory Disease. <br />\nAutoimmune diseases such as rheumatoid arthritis (RA), ankylosing spondylitis, and systemic lupus erythematosus (SLE), involve destruction of healthy cells by the body’s own defensive mechanism. <br />\nIf the immune system’s faux pas is not corrected, the attack can progress to the heart, lungs, and other vital organs. <br />\nThe mechanisms that cause the deregulation of the immune response are not entirely understood. <br />\nIt can be assumed that heavy metal toxicity, leaky gut syndrome, infectious bacteria and parasites, and nutritional imbalances can overburden the body’s immune system, thus deregulating immune signals and responses. <br />\nOngoing research investigates the mechanism by which these factors cause the immune system to attack the body’s own tissues. <br />\nIn this paper, we discuss natural therapies that can help regulate the immune system’s aggressive behavior without suppressing or altering its necessary defenses.\n<br /></p>\n"
}
