{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-022614/",
    "podcast": {
      "developer-note": "",
      "length": "58:04",
      "note": "",
      "size": 13938730,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/b3ptcn/LeidStories022614.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-02-26 00:00:00 -0500",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>The IRP6 &amp; the FBI, Chapter 5: Bogus Trial, Bogus Verdicts\nListeners Ask Questions About This Unusual Case\n \nLeid<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nStories concludes last week’s (Feb. <br />\n19) discussion of the trial of six executives (the IRP6) of an African American-owned software company who on June 9, 2009 saw their Colorado City offices raided by 21 armed FBI agents and boxes of intellectual and other property taken under a warrant alleging fraud.\n<br />\nInvestigative Resource Planning Solutions (IRP) was a sham operation and engaging in fraud because it racked up substantial balances with several IT staffing firms for help in creating software products that didn’t exist, a 25-count federal indictment charged, although a previous grand jury had found the same charges to be totally without merit.\n<br />\nA trial that can only be described as bizarre resulted in convictions of the six men, who currently are serving terms of up to 11 years. <br />\n \nThe IRP6 maintain that the raid, indictment and trial were designed to shut the company out of multimillion-dollar government contracts the company was on the verge of getting with an innovative software solution it designed and, eventually, to shut the company down permanently. <br />\n \nListeners ask questions of two guests who worked at IRP and now are with A Just Cause, an organization seeking the release of the IRP6 and a full federal investigation of the case.<br /></p>\n"
}
