{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-the-media-ecosystem-072712/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:06",
      "note": "",
      "size": 14665874,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/dacznv/GaryNullShow072712.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Media Ecosystem"
  },
  "title": "The Media Ecosystem",
  "date": "2012-07-27 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Media as an ecosystem – deconstructing the corporate media’s mission of “emotional transfer”\nAntonio Lopez is among the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nyounger generation of visionaries challenging the dominant paradigm of corporate government, media and social institutions. <br />\nHe is a media educator and journalist who has written for many magazines and academic journals, and is a contributor to the MacArthur Foundation’s series: Digital Learning in the 21st Century. <br />\nHe was instrumental in the New Mexico Media Literacy Project’s groundbreaking Spanish language media and health program, Medios y Remedios, and founded a multicultural media literacy curriculum, Merchants of Culture, to train instructors in media literacy within rural communities.\n<br />\nAntonio attended the Center for Investigative Reporting in San Francisco and the Peace and Conflict Studies at University of California at Berkeley. <br />\nHe received an MA in Media Studies from the New School and currently resides in Rome where he teaches media studies at an American University while completing a doctorate in education for sustainability.\n<br />\nHe is the author of “The Media Ecosystem: What Ecology Can Teach Us About Responsible Media Practice” – which presents a new platform for proactively deconstructing mainstream corporate media and re-constructing an alternative that is ethically moral and sustainable.\n<br /></p>\n"
}
