{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-venezuela-coup-in-preparation-by-us-040514/",
    "podcast": {
      "developer-note": "",
      "length": "59:2",
      "note": "",
      "size": 14242273,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/cq7s96/AlternativeVisions_040414.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Venezuela Coup In Preparation by US?"
  },
  "title": "Venezuela Coup In Preparation by US?",
  "date": "2014-04-07 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nJack Rasmus and guest discuss the buildup toward a coup being prepared by US and its business-right wing friends in Venezuela today.<br />\n  Jack’s guest is longtime union activist, Alan Benjamin, who works in the International Labor Office in Geneva, Switzerland, and has access to information globally on the Venezuela situation. <br />\nBenjamin provides an eye-witness view of contemporary events in Venezuela based on his frequent direct contact with unionists on the ground in Venezuela in recent months.<br />\n  Jack and Alan discuss the current relationship of political forces today in Venezuela, including the various alignments of classes there, political parties, union organizations, students, US sponsored and funded NGOs, small business v. <br />\nlarge businesses, small farmers and peasants, and splits within the military. <br />\nBenjamin explains the history of US coup attempts in Venezuela and Latin America in recent decades and parallels with recent events in the Ukraine coup. <br />\nWho is behind the recent killings in the streets, splits within the anti(Maduro) government right wing forces and within the government itself, and USA’s current various current plans (‘A, B, and C’) to destabilize Venezuela along multiple fronts are addressed—in this ‘fact-based’ exploration of what’s happening in Venezuela.\n<br />\n \nAlan Benjamin is a long time member of the Office &amp; Professional Employees Union in the US and its delegate for a number of years to the San Francisco Central Labor Council, AFLCIO. <br />\nHe is a member of the coordinating committee of the ‘Labor Fightback Network’ in the USA, and has been involved in numerous undocumented US workers’ grass roots organizations defending US immigrant workers rights, as well as active in organizations defending US students from government education spending cutbacks.<br /></p>\n"
}
