{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-022315/",
    "podcast": {
      "developer-note": "",
      "length": "56:52",
      "note": "",
      "size": 20474599,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/v9y7xn/BAR022315.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2015-02-23 00:00:00 -0500",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>U.S.\n&lt;!--more--&gt;\nand Europeans Seek Control of Nigeria\nBoko Haram’s jihadist rebellion in northern Nigeria has caused “the fracturing of the Nigerian body politic,” making the country more vulnerable to manipulation by the United States and European powers, said Eric Draitser, a political analyst and publisher of the web site StopImperialism.<br />\ncom. <br />\n“Nigeria is by far the most dynamic economy in Africa.<br />\n” Therefore, “it is a major prize for the United States and the European powers,” said Draitser.\n<br />\nRwandan Dictator Fears Loss of Immunity\nPaul Kagame’s government allows “no freedom of movement, no freedom of association,” and “has massacred Rwandan Hutu refugees” in Congo, said Paul Rusesabagina, the real-life hero played by actor Don Cheadle in the movie Hotel Rwanda. <br />\nThe movie portrayed Kagame’s forces as the good guys, but Rusesabagina, now in exile, tells a different story. <br />\nKagame is trying to remain in power past constitutional limits because he fears indictment by foreign courts as soon as he loses presidential immunity, said Rusesabagina, in an interview on the Taylor Report, CIUT Radio, Toronto, Canada.\n<br />\nUS Helped Create ISIS “Monster”\nWhat we see in the Middle East, today, “is the product of two and a half centuries of European and American intrusion” into the Arab and Muslim world, said Jennifer Lowenstein, who teaches Middle East Studies at the University of Wisconsin, at Madison. <br />\nISIS is “a Frankenstein’s monster that the US helped create.” Lowenstein, who has lived and worked for many years in the region, said the US is “becoming a pariah nation, despised by almost every other country in the world.<br />\n”\nProposed Limits on Solitary Confinement in New Jersey\nAtty. <br />\nJean Ross, a member of the Newark-based People’s Organization for Progress, testified recently in favor of legislation that would bar solitary confinement for prisoners under 21, people with mental illness, and pregnant women. <br />\nThe bill would “require that anyone in solitary confinement be reviewed every day by a clinician,” to monitor their mental and physical condition.\n<br />\nThe Worst “Crap Hole” Among Pennsylvania’s Prisons\nPrisoners rate Frackville State Prison as “a crap hole” and “perhaps the worst” facility in the state’s prison system, said inmate Bryant Arroyo, in a report to Prison Radio. <br />\nArroyo calls Frackville an “anonymous fiefdom” where “the guards seem to find great pride, even honor, in perpetrating their anti-prisoner culture” of “unrestrained authority, separate from the state correctional system.” Frackville is also home to Mumia Abu Jamal, the nation’s best known political prisoner.<br /></p>\n"
}
