{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/jesse-ventura-112514/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:37",
      "note": "",
      "size": 22183669,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/bp4siv/GaryNullShow_112514.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Jesse Ventura"
  },
  "title": "Jesse Ventura",
  "date": "2014-11-25 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Keystone pipeline – why to reject it….\n&lt;!--more--&gt;\nPerhaps a conversation one what patriotism really means today in US\nWe have as our guest today one of the nation’s more colorful political and social voices in the progressive community – Jesse Ventura.<br />\n   He was a Navy Seal during the latter phase of the Vietnam War, followed by a career in the World Wrestling Federation, a national sportscaster followed by a career in politics. <br />\nIn the early 1990s, Jesse began his political career, first as mayor of Brooklyn Park in Minnesota and later being elected as the state’s governor from 1998 to 2002.  Jesse has been an ardent supporter of Main Street Americans and a leading critic against executive and legislative policies that are leading the US into becoming police surveillance state.<br />\n  In 2011 he filed a lawsuit against the Transportation Security Administration or TSA for illegal searches.\n<br />\nIn addition to his books on proven, documented American conspiracies and calling out the political duopoly ruling Washington, Jesse is the host of Off the Grid on the new internet TV network  Ora TV, which can be viewed Tuesday thru Friday at Ora.tv/OffTheGrid or on Youtube.  He is also the host of a new podacast – We the People with Jesse Ventura, airing every Thursday on ITunes and PodcastOne<br /></p>\n"
}
