{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/benton-harbor-mi-a-legal-lynching-caps-a-battle-over-a-black-town-121614/",
    "podcast": {
      "developer-note": "",
      "length": "58:1",
      "note": "",
      "size": 20943584,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/74k8p5/LeidStories_121614.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Benton Harbor, MI: A Legal Lynching Caps A Battle Over A Black Town"
  },
  "title": "Benton Harbor, MI: A Legal Lynching Caps A Battle Over A Black Town",
  "date": "2014-12-16 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>“They” scored a victory of sorts yesterday. A county judge sentenced the Rev.\n&lt;!--more--&gt;\nEdward Pinkney—for decades an undisputed thorn in the side of a political-corporate conspiracy to empty the small, almost-all-black, poverty-stricken town of Benton Harbor, Mich., and hand it over to Whirlpool Corporation—to 2.<br />\n5 to 10 years on five felony counts of forging signatures on petitions to recall the openly pro-Whirlpool local mayor, James Hightower.\n<br />\nPinkney’s trial was an all-white affair—including all jurors, the prosecutor and the judge—and not a shred of evidence at trial linked him to altering petitions. <br />\nProsecutor Michael Sepic repeatedly advised jurors (without correction from Judge Sterling Shrock) that evidence was not necessary to convict.\n<br />\nPinkney, 66, was remanded immediately to prison. <br />\nHe is appealing the sentence. <br />\nHe had told Leid Stories on Nov. <br />\n5, hours before the jury convicted him, that he was hoping for the best but prepared for the worst. <br />\nEither way, he said, he’ll fight to the end.\n<br />\nAbayomi Azikiwe, editor in chief of Pan African News Wire and our correspondent on Detroit’s bankruptcy, also has been covering the battle for Benton Harbor and Pinkney’s sham trial. <br />\nHe discusses the minister’s long history of activism and why he was targeted, and the link between Detroit, Benton Harbor and several other cities and towns that account for more than half of the state’s black population under emergency management.  <br /></p>\n"
}
