{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-encyclopedia-of-natural-health-for-children-and-infants-120313/",
    "podcast": {
      "developer-note": "",
      "length": "58",
      "note": "",
      "size": 13920758,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/fwtnj/NaturalNurse120313.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "Encyclopedia of Natural Health for Children and Infants"
  },
  "title": "Encyclopedia of Natural Health for Children and Infants",
  "date": "2013-12-03 00:00:00 -0500",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Dr. Eugene Zampieron, ND, interviews Dr. Mary Bove, ND. Dr.\n<!--more-->\nBove obtained her Doctorate of Naturopathic Medicine and Midwifery Certification from Bastyr College of Natural Health Sciences in Seattle, WA. <br />\nand received her Diploma of Phytotherapy/Herbal Medicine at the School of Phytotherapy in Great Britain. <br />\nDr Bove continues to practice Naturopathic Family Medicine at the Brattleboro Naturopathic Clinic, Brattleboro, VT. <br />\nOnce a full-time faculty member at Bastyr University, Dr Bove chaired the departments of Botanical Medicine and Naturopathic Midwifery. <br />\nShe served as adjunct faculty for the Massachusetts School of Pharmacy and Scottish School of Herbal Medicine Masters level course. <br />\nDr Bove is the author of the Encyclopedia of Natural Healing for Children and Infants considered an authoritative reference on natural pediatric medicine. <br />\nMary co-authored Herbs for Women’s Health and has been published in many magazines, journals and collaborative books on botanical and natural medicine. <br />\nShe lectures and teaches internationally on the topics of naturopathic medicine, botanical medicine, pediatrics, natural pregnancy, childbirth, traditional food medicine and mind-body healing. <br />\nIn collaboration with Gaia Herbs® Dr Bove developed an herbal remedy line designed specifically for children and is an educational, medical consultant within the natural product industry. <br />\n Contact: Website- http://brattleboronaturopathic.com/   \n<br /></p>\n"
}
