{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-072814/",
    "podcast": {
      "developer-note": "",
      "length": "56:21",
      "note": "",
      "size": 20289300,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/2ngire/BAR072814.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-07-28 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>World Opinion Turns Against Israel – But Not in Congressional Black Caucus\n </p>\n\n<p>Israelis “can no longer frame<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nthemselves as the victims” in the conflict with occupied Palestinians, said veteran human rights activist and BAR columnist Ajamu Baraka. <br />\nHowever, “it now appears that Black leadership has lost its moral compass and are standing shoulder to shoulder with something as brutal and backward as the assault on Palestine,” said Baraka. <br />\nEvery member of the Congressional Black Caucus this month joined in a unanimous House resolution siding with Israel.\n<br /></p>\n\n<p>US Academics Largely Silent on Israeli Crimes\n </p>\n\n<p>American academics are largely mum on Israeli brutality in Gaza, said Dr Johnny Williams, professor of sociology at Trinity College, in Hartford, Connecticut. <br />\n“They are scared to talk about the kinds of war crimes that are being committed with this unprovoked war by Israel,” he said. <br />\nExcept for Cornel West, Noam Chomsky “and a few others,” academics are “essentially folks who tell the stories of rich people and the people who have power.<br />\n”</p>\n\n<p>Kucinich: America Must Quit “Imperial Pretensions”\n </p>\n\n<p>The US is on the wrong side of history, said Dennis Kucinich, the former Ohio congressman, Cleveland mayor, and two-time presidential candidate. <br />\n“Our policies of intervention, of regime change, of covert action, of linking up with groups that seek to destabilize and annihilate governments, are policies that are doomed to defeat,” said Kucinich, who fought unsuccessfully to halt US bombing of Libya in 2011, before he was redistricted out of his seat. <br />\n“We have to quit these imperial pretensions and take care of business at home.<br />\n”</p>\n\n<p>NYPD Reform Impossible Under Bratton\n </p>\n\n<p>The choke-hold death of a Black New Yorker accused of selling loose cigarettes shows that Mayor Bill de Blasio should never have brought Bill Bratton back as police commissioner, said Josmar Trujillo, of New Yorkers Against Bratton. <br />\nThe group had warned that Bratton’s obsession with so-called “quality of life” offenses would lead to disaster. <br />\n“Back then, we said that his history and his policies were the exact opposite of reform,” said Trujillo. <br />\n“I think now people are starting to have the conversation, after the death of Eric Garner, about what’s going on with Bratton’s ‘Broken Windows’ policing.<br />\n”</p>\n\n<p>Prisoners Have Voting Rights, Too\n </p>\n\n<p>Back in 2008, Rev. <br />\nKenneth Glascow won a lawsuit affirming the right of many incarcerated people to vote, in Alabama. <br />\nGlascow and his Ordinary People Society have been making the rounds of county jails, to determine if they are in compliance with the law. <br />\n“Anybody who is in jail in Alabama for a crime that is not a crime of moral turpitude – meaning, they caused harm or danger to some</p>\n\n<p><br /></p>\n"
}
