{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg"
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/the-infectious-myth-state-crimes-against-democracy-071514/",
    "podcast": {
      "developer-note": "",
      "length": "59:27",
      "note": "",
      "size": 14271530,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/t754ga/InfectiousMyth_071514.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "State Crimes Against Democracy"
  },
  "title": "State Crimes Against Democracy",
  "date": "2014-07-15 00:00:00 -0600",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>In episode 21 of “The Infectious Myth” David’s guest is Lance deHaven-Smith and the subject is SCAD, “State Crimes<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nAgainst Democracy”, a term that our guest developed to avoid the conversation ending term “Conspiracy Theory”.\n<br />\nMost of this discussion centers on events in American politics that were SCADs, probably were, or might have been. <br />\nThe Kennedy assassinations, foreign policy surprises that changed the results of the 1968 and 1980 elections, the conspiracy to go to war in Iraq knowing that the public statements about WMDs were false, and so on.\n<br />\nLance has criticized a paper by Washington insider Cass Sunstein that recommends that the US government use “cognitive infiltration” to destabilize people who believe that their own government (or a clique within their government) is conspiring to do bad things, or has done bad things. <br />\nKnowing about the massive spying of the NSA and other agencies, combined with research about how to manipulate people online, causes great concern.\n<br />\nThe best antidote to any conspiracy is fresh air. <br />\nThey rely on plotting in back rooms, out of the site of public. <br />\nBeing aware that there are such conspiracies helps people recognize the sign. <br />\nPerhaps people are increasingly coming into a group discussion sowing discord, and when one goes away, another person comes along, and this could be a sign. <br />\nBut, the good thing is that when people are determined and committed the best planned SCAD can turn into a bungled Bay of Pigs or Watergate breakin.<br /></p>\n"
}
