{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-010713/",
    "podcast": {
      "developer-note": "",
      "length": "1:04:46",
      "note": "",
      "size": 15544842,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/7pg3p/GaryNullShow010713.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-01-07 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Introducing new program on PRN:  The Rebbe, The Radical and the Rev  — every Monday evening at 8 pm following your<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\ncommentary hour\nRabbi Michael Lerner is clearly one the nation’s greatest Jewish intellectuals and spiritual political activists. <br />\n He is currently the editor of Tikkun Magazine—an award winning journal of interfaith and progressive critiques on American culture, politics, and religion—and is the founder of the Network of Spiritual Progressives. <br />\nHis most recent book is “Embracing Israel/Palestine: A Strategy to Heal and Transform the Middle East” — praised by people like Jimmy Carter, Uri Avnery, Desmond Tutu, Senator Keith Ellison and others as the most insightful treatment and understanding of the roots of the Israeli-Palestinian conflict and a roadmap for bringing peace to the region.\n<br />\nProf. <br />\nJames (Jim) Vrettos has teaching sociology at John Jay College, City of University of New York for over twenty years, where he has specialized in teaching criminology and criminal justice. <br />\nHe is the author of the critically acclaimed text The Elementary Forms of Statistical Reason, and is the facilitator for the Tikkun community in the NY metropolitan area, an international network of interfaith spiritual progressives.\n<br /></p>\n"
}
