{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-europe%e2%80%99s-continuing-%e2%80%98epic%e2%80%99-recession-052414/",
    "podcast": {
      "developer-note": "",
      "length": "59:55",
      "note": "",
      "size": 14382811,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/dfve27/AlternativeVisions_052414.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Europe’s Continuing ‘Epic’ Recession"
  },
  "title": "Europe’s Continuing ‘Epic’ Recession",
  "date": "2014-05-24 00:00:00 -0600",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus explains how Europe’s ‘stop-go’ recovery and its version of an ‘Epic recession’ (i.e.\n&lt;!--more--&gt;\nshort, shallow recoveries followed by economic relapses and double dip recessions) is proving worse than the USA’s experience with ‘stop-go’ recovery since 2009. <br />\n While the USA’s economy has slowed to zero or less on three different occasions since 2009 (in 2011, 2012, and now 2014), Europe’s economy experienced an even worse bona fide double dip recession, even weaker recoveries between, and now appears headed to another slowdown after only a year of a paltry 0.<br />\n2% GDP growth. <br />\n As Depression conditions continue in Southern Europe and the Euro periphery economies, Northern Europe economies (France, Netherlands, Finland, etc.<br />\n)  are also beginning to experience declining real investment, falling exports, and slowing household consumption as well. <br />\nMeanwhile, governments continue ‘austerity’ policies, struggle with a continuing fragile banking system and government debt, and continue to ‘talk down’ the crisis. <br />\n Jack explains the role of European Central Bank monetary policies in Europe behind Europe’s current drift toward deflation and economic stagnation, which are the ultimate source of its continuing fiscal austerity policies. <br />\nThe role of emerging markets’ capital flows to Europe, western global investors and shadow banks chasing risky corporate junk bond ‘yield’ and Eurozone periphery government bonds as key elements to today’s emerging ‘3rd phase’ of the crisis. <br />\nJack also explains the effects of changing China and Japan policies on Europe, the Ukraine crisis effect on Europe, and why the drift toward deflation Eurozone-wide will continue. <br />\n Dr Rasmus concludes with an explanation of why the United Kingdom’s is experience an artificial recovery based on an induced property bubble in London and south England, with Cameron policies echoing George Bush-Alan Greenspan USA policies of 2002-03, in what represents a desperate attempt to engineer a short term, unstable recovery before an upcoming national election, that will inevitably collapse afterward with serious economic consequences.<br />\n’ (For the bigger global economic picture, listen to earlier Alternative Vision radio shows since February 19 on the Emerging Markets, China, Japan, and USA economies, archived on this station).\n<br /></p>\n"
}
