{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-obama%e2%80%99s-new-epa-industrial-plant-co2-rules-progress-or-election-year-maneuver-%e2%80%93-060714/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:27",
      "note": "",
      "size": 14511438,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/pwzkh4/AlternativeVisions_060714.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Obama’s New EPA Industrial Plant CO2 Rules: Progress or Election Year Maneuver"
  },
  "title": "Obama’s New EPA Industrial Plant CO2 Rules: Progress or Election Year Maneuver",
  "date": "2014-06-07 00:00:00 -0600",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nJack Rasmus and guest, Steve Breyman, discuss this past week’s just released Obama/EPA proposals to reduce CO2 emissions from existing industrial plants in the US by 30% by 2030. <br />\n Are conservative environmental groups justified in their praise of the EPA proposals? <br />\nAre the proposals too little, too late, and cleverly left to the last two years of the Obama administration to ensure nothing will actually happen during the remaining years of Obama’s second term? <br />\n Jack offers a criticism of the Obama/EPA strategy, noting if Obama were really serious he would have issued an Executive Order to immediately implement the EPA rules. <br />\nIn the present form, Rasmus notes, there will be no implementation of any rules until after the 2016 elections, if even then. <br />\nBreyman and Rasmus discuss whether the EPA’s 30% ‘target’ for emissions reduction is really only 14%? <br />\nWhether the EPA rules are proposed in order to provide political ‘cover’ for the administration’s now fast track promotion of natural gas fracking. <br />\nAnd whether the EPA proposals  ‘sometime later’ are a trade-off to enable Obama to ‘immediately’ approve and sign the XL pipeline after this November 2014 midterm congressional elections? <br />\nBreyman discusses the likelihood the EPA proposals will reduce CO2 from industrial plants, but stimulate even more C02 and methane carbon emissions from natural gas fracking now destroying water tables and air quality in the Dakotas, Texas and Pennsylvania? <br />\n Rasmus asks if the rules represent a ‘passing the buck’ by Obama to the states to encourage the latter to develop more state-level ‘cap and trade’ carbon credits trading programs that have elsewhere had little impact on reducing carbon emissions? <br />\n Can EPA proposals be trusted that, according to multi-state coal-fired plant corporations, like American Electric Power, “allow us to keep coal units running for an extended period” (John McManus, VP of American Electric Power). <br />\nListeners are encouraged to check out analyses of the EPA proposals by ‘Rainforest Network’ and ‘Food&amp;Water Watch’ environmental groups, not just the big Washington environmental lobbies, and not to get taken in by the ‘spin machine’ in Washington. <br />\n  </p>\n\n<p>Steve Breyman is a former New York State environmental bureaucrat and current the ‘shadow’ EPA Administrator for the Green Shadow Cabinet. <br />\nHe formerly also worked for the US State Department. <br />\nHe currently teaches peace, environmental and media studies at Rensselaer Polytechnic Institute. <br /></p>\n"
}
