{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/oil-deflation-russia%e2%80%99s-recession-and-ukraine%e2%80%99s-depression-122014/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:38",
      "note": "",
      "size": 21828822,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/m2etig/AlternativeVisions_122014.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Oil Deflation, Russia’s Recession, and Ukraine’s Depression"
  },
  "title": "Oil Deflation, Russia’s Recession, and Ukraine’s Depression",
  "date": "2014-12-20 00:00:00 -0500",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus reviews the continuing collapse of global oil prices and its effect on the emerging recession in Russia,<span class=\"ellipsis\">…</span>\n<!--more-->\ncontinuing economic stagnation in Europe, and the deepening Depression in the Ukraine economy. <br />\n  Rasmus discusses how the global oil price collapse may be entering a second phase soon, further impacting not only the major oil commodity producers (Russia, Venezuela, Nigeria, Norway, Mexico, etc.), but now, increasingly, the economies of other non-oil commodity producers (Brazil, Indonesia, India, Turkey, and others).<br />\n  Additional pressures appear to be building as well on global financial asset markets, especially US and European corporate junk bonds. <br />\n How this is related to last week’s US Federal Reserve decision to put off raising US interest rates another 2-3 months, and the subsequent latest surge in the US stock market, is explained. <br />\nJack then discusses developments in the Russian economy as it clearly enters recession; the feedback effects of Russia’s recession on Germany and other eastern European economies; and the further feedback effects of both in turn on the deepening Depression in the Ukraine. <br />\nJack concludes with a detailed review of the negative effects of the IMF bailout on Ukraine, the recent installation of US and EU citizens as economics and finance ministers in Ukraine’s new government, Poroshenko and Yatsenyuk’s pleading for more aid from the west, and latest hard nose demands by the IMF and G7 for Ukraine to impose even more austerity on its people if it wants more loans in 2015.\n<br /></p>\n"
}
