{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-080814-1407521121/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:08",
      "note": "",
      "size": 21650112,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/fhecyv/GaryNullShow_080814.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-08-08 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>State of California versus Dr.\n&lt;!--more--&gt;\nHarvey Bigelsen – another example of the medical fascist regime’s mission to squash alternative medicine\nDr Harvey Bigelsen was one of the first medical doctors in American history to practice Isopathy, better known as biological medicine.<br />\n  He is one of the true pioneers in alternative medicine, having trained as an orthodox physician 50 years ago. <br />\nHe was the first president, appointed by then-governor Bruce Babbitt, of the Arizona Homeopathic Medical Board and was greatly responsible for preserving homeopathic practice in the state of Arizona. <br />\nHe was also the medical director of the Institute de Medicina Biologica in Mexico.  He continues his private practice and research at his Biological Health Institute clinic in Nevada City, California and is a board member of the National Health Federation.<br />\n  Dr Bigelsen has written several very important books, and critiques on the orthodox medical establishment. <br />\nHis recent book is “Doctors Are More Harmful Than Germs”\nLast March, Dr Bigelsen’s clinic was raided on charges made by the Medical Board under the State of California Department of Consumer Affairs on allegations of practicing medicine without a license.<br />\n  Numerous health practitioners and clients have spoken on his behalf as a part of a medical conspiracy to squash alternative, natural medicine and therapies that threaten the established big pharma drug paradigm. <br />\nState of California vs. <br />\nBigelsen will be an important case for the future of alternative medicine. <br />\nNow representing Dr Bigelsen is Mark Garagos, the famous attorney who has represented Michael Jackson, Wynona Ryder and other high profile national figures, the only US attorney besides Johnnie Cochran ever named Lawyer of the Year in both Criminal and Civil cases, and regarded as one of the most influential attorneys in the state of California.<br /></p>\n"
}
