{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-180/",
    "podcast": {
      "developer-note": "",
      "length": "1:05:09",
      "note": "",
      "size": 15635952,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/aug6s5/GaryNullShow081911.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-08-19 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guests: Jonathan Emord and Gretchen DuBeau\nJonathan Emord is one of the nation’s leading free speech attorneys who has<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nremarkably defeated the Food and Drug Administration in federal court more than any other American attorney, earning him the title, “FDA Dragon Slayer.”  In 2007 he received the Cancer Control Society’s Humanitarian Award for “winning and preserving our great civil rights to life, to liberty, and to health freedoms.<br />\n”  Jonathan is the Chair of the Certification Board for Nutrition Specialists and a member of the Governing Council of the International Society of Regulatory Toxicology. <br />\n Formerly an attorney in the Reagan Administration’s Federal Communications Commission, Emord has practiced constitutional and administrative law in Washington, DC for the past twenty-five years. <br />\n He is routinely consulted by industry, Congress, and the media on regulatory issues that affect health freedom. <br />\n He is the author of several critically acclaimed books including The Ultimate Price (2007); The Rise of Tyranny (2008); and Global Censorship of Health Information (2010). <br /></p>\n\n<p>Gretchen DuBeau is the Executive and Legal Director of the Alliance for Natural Health International in Washington DC, where she heads US health policy issues. <br />\n The Alliance is an international organization dedicated to promoting sustainable health, health freedom choice, and protection to natural health care practitioners through good science and law. <br />\nShe is an attorney who has practiced environmental law. <br />\n Gretchen is also the Executive Director of the Praktikos Institute,  the Political Activities Chair for the Integrative Medicine Consortium and a Board Advisor for the International College for Integrative Medicine.\n<br /></p>\n"
}
