{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-120814/",
    "podcast": {
      "developer-note": "",
      "length": "55:34",
      "note": "",
      "size": 20005158,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/2bp6fh/BAR120814.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-12-08 00:00:00 -0700",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>CIA and Police Impunity are Linked\nThe long-awaited Senate Intelligence Committee report on CIA torture practices<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\n“could be the most important document, with respect to reviewing the crimes of US intelligence agencies, since the Pentagon Papers,” said Shahid Buttar, executive director of the Bill of Rights Defense Committee. <br />\n“This is the cover-up underlying human rights abuses that no one has ever been held accountable for.<br />\n” Yet, unarmed Black men fin the US face extrajudicial assassination by police. <br />\n“There is clearly no equal justice in this country,” said Buttar, “and no two things make it more clear than torture with impunity juxtaposed with mass incarceration.<br />\n”\nRemove the “Instruments of Death” from Our Communities\nThe new mass movement is wrestling with fundamental questions of Black life in America. <br />\n“One demand is that you may not kill our children,” said Dr Marsha Coleman-Adebayo, the noted whistleblower and activist with the Hands Up Coalition - DC, which last week presented a list of demands to the US Justice Department. <br />\n“It’s important that we get these instruments of death out of our communities,” said Coleman-Adebayo, who is also an editor and columnist for Black Agenda Report.\n<br />\nBlack People’s Humanity is not Negotiable\nThe Obama administration points to the numerous consent decrees it has arrived at with police departments around the country as evidence that it is serious about combating abuses in the criminal justice system. <br />\nHowever, Carl Dix, of the Stop Mass Incarceration Network, is unimpressed. <br />\n“These federal consent decrees do not get to the heart of the problem, which is that this system has criminalized and demonized Black people,” said Dix – just as Ferguson cop Darren Wilson described Michael Brown as a “demon.” “We have to say No, Black life matters, and we will not allow you to erase our humanity.<br />\n”\nWhat’s Trust Got to Do With It?\n<br />\nThe “impotent” Black political class mimics white politicians when they call for “restoration of trust” between Blacks and police. <br />\n“When was there ever trust in the first place?<br />\n” asks Mumia Abu Jamal, the nation’s best known political prisoner, in a report to Prison Radio. <br />\n“The cruel, painful history of relations between police and the people is one of predation, not trust.<br />\n” The police “are there to control Black mobility and to discipline Blacks for fear they’ll pose a threat to white wealth, life or property,” said Abu Jamal, at Frackville State Prison, in Pennsylvania.\n<br />\nFast Food Strikers Spearhead Low Wage Workers Movement\nEmployees went on strike at fast food outlets in 190 cities, last week, demanding $15 an hour and union representation. <br />\nThe action, which also engaged airport, convenience store and other low wage workers, climaxed two years of organizing that began with a walkout at a single restaurant in New York City, said Kendall Sells, organizing director of Fast Food Forward. <br />\n“Over the next six to twelve months,” said Sells, “I think people are going to see a complete explosion of low wage workers taking to the streets. <br />\nThat’s how we’re going to get these workers out of poverty.”<br /></p>\n"
}
