{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-052114/",
    "podcast": {
      "developer-note": "",
      "length": "56:39",
      "note": "",
      "size": 13597989,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/9n5jir/LeidStories_052114.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-05-21 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Super Tuesday Primaries Largely About ‘That Other America’\nNigeria: Crisis of Violence, Crisis of Confidence in<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nPresident Jonathan\nThe 2014 midterm election season officially began yesterday, with the first batch of primaries in six states–Arkansas, Georgia, Idaho, Kentucky, Oregon and Pennsylvania.\n<br />\nCustomarily, elections are grist for the political mill in the world of media mindbenders, and the May 20 kickoff is no exception. <br />\nAfter all, it’s the runup to the high-stakes 2016 presidential race, but more immediately a status report on the health of the Democrat-Republican duopoly and the remaining ambitions of an increasingly unpopular president.\n<br />\nBut Super Tuesday was about another story, too, says Leid Stories—a narrative that hasn’t changed in many, many years. <br />\nIt is the story of “that other America” taking care of its business and seeing to its very narrow interests.\n<br />\nThe death toll rises above 118 confirmed after two car bomb blasts yesterday in Jos, Nigeria, where, on Christmas Day 2011, the Islamist extremist group Boko Haram claimed responsibility for two bombs that killed 41 people. <br />\nPolice were able to disarm two other bombs.\n<br />\nPresident Goodluck Jonathan’s predictably staid response (an official statement said he “condemned” yesterday’s bombings) is doing little to convince Nigerians of his capacity for leadership, especially at a time of crisis (an estimated 278 girls abducted by Boko Haram on April 14 from their school dorms in Chibok are still missing). <br />\nA multinational team, including several African nations, is helping with strategies to deal with Boko Haram and escalating acts of terrorism proven and believed to be linked to the group.\n<br />\nLeid Stories asks listeners: Given the situation, what are Nigeria’s and Jonathan’s options now? <br /></p>\n"
}
