{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-070912/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:46",
      "note": "",
      "size": 14824908,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/67tdfb/GaryNullShow070912.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-07-09 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Newsmaker:  Monsanto Rider snuck into the Agriculture Appropriations Bill in order to further the GMO agenda against<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\norganic farming\nProf Tony Pereira teaches chemical engineering at the Fuel Center Research Center and College of Engineering at Lamar University in Beaumont Texas, where he specializes in solar technology\nTony is a long time activist for energy, healthy and safe natural produce, and environmental causes and is the founder of the Institute for Sustainable Engineering. <br />\nThe Institute brings engineers, scientists and researchers together to educate and plan for transitions towards a sustainable society through international academic and public partnerships.\n<br />\nCALL TO ACTION: At the Organic Consumers Association website:\nwww.OrganicConsumers.<br />\norg\nNew time slot for The Smart Show with host Cary Harrison\nCary Harrison is a longtime radio host and activist broadcaster, heard in Los Angeles and nationawide on Think Green Radio and TV. <br />\nHis program – The Smart Show – will now be aired on the Progressive Radio Network every Monday evening at 6:00 pm Eastern, 3:00 pm Pacific. <br />\nCary conducts exciting interviews and call-ins with well known politicos and celebrities exploring the interface between pop culture and politics.\n<br /></p>\n"
}
