{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/infectious-myth-aneuploidy-032514/",
    "podcast": {
      "developer-note": "",
      "length": "56:34",
      "note": "",
      "size": 13577300,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/23e4i5/InfectiousMyth032514.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Aneuploidy"
  },
  "title": "Aneuploidy",
  "date": "2014-03-25 00:00:00 -0400",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>In Episode 5 of “The Infectious Myth” David’s guest is another David, David Rasnick, who has worked for almost 20 years<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nwith Peter Duesberg on the theory that aneuploidy, not gene mutations causes cancer.<br />\n </p>\n\n<p>Aneuploidy refers to a cell that has the wrong number and type of chromosomes. <br />\nHuman cells are normally diploid, meaning that they have exactly two copies of every chromosome (except for the X and Y chromosomes that form an asymmetrical pair). <br />\nAccording to Rasnick, every cancer tumor cell is aneuploid, often to a massive degree. <br />\nOn average, cancer cells have 70% more chromosomes than the cell should have.\n<br /></p>\n\n<p>By contrast, the mutation theory has struggled to explain cancer, having to drag in many mutations, that must occur in the same cell, in order for cancer to occur. <br />\nThe mutation theory does not explain why people  generally get cancer later in life, if they are born with their mutations. <br />\nIf mutations occur later, how do they all occur in the same cell?\n<br /></p>\n\n<p>David Rasnick discusses the history of the aneuploidy theory, going back to the 1800s. <br />\nHe talks about what can cause aneuploidy, and how evidence of aneuploidy is used outside the United States to define a substance as carcinogenic. <br />\nHe addresses claims of the discovery of diploid tumors and why he claims that these are due to either bad techniques (not looking at the cells in place in the tumor, for example) or to not realizing that even cells that are close to diploid can be aneuploid.\n<br /></p>\n\n<p>An example of cells that are close to diploid are those in people with Downs Syndrome, who have one extra chromosome in every cell. <br />\nEven with this smallest possible deviation from the proper chromosome count, people experience many physical and mental problems, including a higher risk of cancer, and a shortened lifespan. <br />\nCells with only 10% more chromosomes than normal might be classified as diploid, but would still be seriously destabilized.\n<br /></p>\n\n<p>To learn more about aneuploidy go to David Rasnick’s cancer website: http://www.davidrasnick.com/Cancer.<br />\nhtml</p>\n\n<p>You can start with “Aneuploidy theory in plain language” and, if you want to know a lot more, you can read his highly technical 2012 book, “The Chromosomal Imbalance Theory of Cancer: The Autocatalyzed Progression of Aneuploidy is Carcinogenesis”.\n<br /></p>\n"
}
