{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-special-on-the-plight-of-american-children-031113/",
    "podcast": {
      "developer-note": "",
      "length": "56:49",
      "note": "",
      "size": 13639053,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/48pckr/PCH031113.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Special on the plight of American children"
  },
  "title": "Special on the plight of American children",
  "date": "2013-03-11 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Journalist, investigative reporter Nick Bryant has been writing on the plight of disadvantaged children for over a<span class=\"ellipsis\">…</span>\n<!--more-->\ndecade. <br />\nHis writings have appeared in professional publications such as the Journal of Professional Ethics, the Journal of Applied Developmental Psychology, the Journal of Social Distress and the publication of School Health. <br />\nHe is the co-author of “America’s Children:  Triumph of Tragedy” that dealt with the mental health problems of lower socioeconomic children.\n<br />\nHe is the author of  “The Franklin Scandal: A Story of Powerbrokers, Child Abuse and Betrayal” that exposes a nationwide pedophile ring that pandered children to a cabal of the rich and powerful and the corruption of the Justice Department and law enforcement to crack down on it. <br />\nIt is perhaps one of the most suppressed crime stories in recent American history.\n<br />\nWEBSITE:  www.FranklinScandal.com\nHarvey Schweitzer is an attorney with the firm Schweitzer and Scherr in Maryland, who has handled hundreds of adoption and foster care cases.<br />\n  He played a leading role in the creation of the Counsel for Child Abuse and Neglect Office at the DC Superior Court and received the National Treasure Award from the Foster and Adoptive Parent Advocacy Center.\n<br />\nMr Schweitzer received his law degree from UCLA and is an adjunct professor at the Columbus School of Law at Catholic University.<br />\n  He is also the author of “Foster Care Law” which has become a standard text in this field.\n<br />\nWEBSITE:  www.SchweitzerLaw.net\n<br /></p>\n"
}
