{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-080414/",
    "podcast": {
      "developer-note": "",
      "length": "57:28",
      "note": "",
      "size": 20693973,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/qdeu73/BAR080414.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-08-04 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>The Chosen People – for Incarceration\n“They’ve created a permanent caste from which people cannot escape,” said Larry<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nHamm, chairman of the Newark-based People’s Organization for Progress (POP), referring to America’s system of mass Black incarceration. <br />\nPOP supports the New Jersey Decarceration Act, aimed at drastically reducing prison populations. <br />\nHistorically, police forces and prisons have expanded to contain Black people, socially and geographically. <br />\n“What they’re worried about now is there’s a potential for us to build alliances with other groups that have been economically disenfranchised in the last few decades, and that there could be an even wider societal response to the suffering that’s going on in this country,” said Hamm.\n<br />\nChallenge to Arbitrary Solitary Confinement\nPrison inmate Lester Alford has hauled New Jersey into court, charging prison officials with arbitrarily locking him in solitary under appalling conditions. <br />\n“They only gave him one set of clothing for three years, and didn’t let him clean his cell for three years,” said Jean Ross, a lawyer who has advised many state prisoners. <br />\nThe state accused Alford, now middle-aged, of being a gang leader. <br />\n“There is no excuse, no defense to the fact that they placed him under isolated confinement without any kind of due process of law, and under conditions that we would not keep animals in,” said Ross, who is also an organizer with the People’s Organization for Progress.\n<br />\nFormer Panther Blasts Huey Newton\nWayne Pharr, a former captain in the Los Angeles chapter of the Black Panther Party for Self-Defense, has just published a book titled Nine Lives of a Black Panther: A Story of Survival. <br />\n“I don’t bash anybody but Huey Newton,” the Panther co-founder who, Pharr writes, set himself up as Supreme Commander and sent hit squads against members considered disloyal. <br />\n“That’s what turned me off from the whole thing, because that spoke of ego and no humility,” said Pharr, who now makes his living in real estate. <br />\nThe FBI’s infamous COINTELPRO played a role in the party’s demise. <br />\n“We knew were under surveillance with COINTELPRO,” said Pharr, “and COINTELPRO is still working, right now.<br />\n”\nUS Complicit in Israeli Crimes\n“Not a minute of this war would be possible without complete and total US funding, political support, and diplomatic support every step of the way,” said Sara Flounders, of the International Action Center. <br />\nBut, “the world has not been silent” to the suffering of Palestinians in Gaza, nearly 2,000 of whom – overwhelmingly civilians – have died at Israeli hands. <br />\nWhat the Israeli’s want, said Flounders, “is the silence of the grave; that’s their only plan.<br />\n” A huge demonstration is set for this Saturday, August 9, at the United Nations building in New York, said Flounders, who is also an organizer with UNAC, the United National Anti-War Coalition.\n<br />\nMumia: Zionists Lust for Land\nAmerica’s best known political prisoner says “Israel intentionally targets civilians, which is a war crime.” Mumia Abu Jamal, in a report for Prison Radio, called Israel “a settler colonialists state which has no use for the indigenous people of Palestine, yet lusts for its land.<br />\n” President Obama claims Israel “has the right to defend itself. <br />\nBut, one wonders: doesn’t Palestine have that right, as well?”<br /></p>\n"
}
