{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/december-6-2010/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:08",
      "note": "",
      "size": 14436000,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/9ij82r/NaturalNurse120610.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "December 6, 2010"
  },
  "title": "December 6, 2010",
  "date": "2010-12-06 00:00:00 -0700",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Dr. Eugene Zampieron, ND, AHG, www.drznaturally.com, interviews Dr. Michael Lipelt, DDS, ND, L.Ac.\n&lt;!--more--&gt;\nKnown as the eclectic doctor, Michael Lipelt is the founder of Stillpoint Family Health Services (SFHS). <br />\nDr Lipelt holds degrees from UC Berkeley, UCLA School of Dentistry, is a licensed acupuncturist and a Bastyr Educated Naturopathic Physician. <br />\nDr Lipelt brings together years of diverse professional training as both a dentist and a Naturopathic Physician, to tailor a unique, personalized solution to support and assist his patient’s natural healing ability and to achieve their health goals. <br />\nDr Lipelt was led on a path to natural medicine 30 years ago after hurting his back in a bike accident, and finding no cure or relief using conventional, allopathic medicine. <br />\nThe resulting chronic pain and restricted movement interfered with his job as a dentist in Santa Rosa, CA and hampered his active lifestyle. <br />\nBeing a runner and athlete, he elected to forego surgery, and started his own journey in natural medicine. <br />\nHis injury led him to study many natural medical systems, all with the common foundation of healthy diet and lifestyle. <br />\nLooking at optimum fuel for the body led to the study of sustainable agriculture and the creation of Stillpoint Permaculture Center (SPC) on his own five acres in Sonoma County.<br />\nHis ongoing work in permaculture and study of Ecological Sustainable Medicine continue today , with a focus on the interconnectivity of all life and the importance of keeping a healthy balance in all aspects of life. <br />\nContact: http://www.stillpointhealthcare.com/ ph: 707-829-2737\n<br /></p>\n"
}
