{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-082514/",
    "podcast": {
      "developer-note": "",
      "length": "56:16",
      "note": "",
      "size": 20260584,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/7i3cr8/BAR_082414.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-08-25 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Obama and ISIS in Dance of Death\nThe growing U.S.\n&lt;!--more--&gt;\nbombing campaign against the self-proclaimed Islamic caliphate in Iraq and Syria serves no one but war profiteers, said veteran anti-war activist David Swanson. <br />\n“I know that ISIS had to be aware that slitting throats on camera would result in more bombing, just as President Obama had to be aware that blowing men, women and children up with 500-pound bombs would result in slitting throats,” said Swanson, publisher of the influential web site WarIsACrime.<br />\nOrg. <br />\n“The beneficiaries of escalation, which is entirely predictable, are the weapons makers.<br />\n”\nBlack Strategies Must Include Self-Defense\n“First and foremost, it is right for our people to rebel,” said Kali Akuno, an organizer with the Malcolm X Grassroots Movement and co-author of the groundbreaking report “Operation Ghetto Storm,” which documented extrajudicial killings of Black Americans under color of law. <br />\n“I think it boiled over in Ferguson as a result of a transformation in our people’s consciousness, especially our young folks,” said Akuno. <br />\n“They’ve had enough of the brutality, of being systematically excluded.<br />\n” Black community self-defense must be part of any organizing strategy. <br />\n“This has been part and parcel of what we know we have to do in the face of white supremacy and in the face of the brutality that the capitalist system has reserved for us, in particular.<br />\n”\nBlack Passivity is Mentally Unhealthy\nPolitical protest is therapeutic for Black Americans, said Dr Vernellia Randall, professor emeritus of law at the University of Dayton and author Dying While Black. <br />\n“I want us to be less passive, I want us to engage in civil disobedience” – and not the kind of protest-like activities sanctioned by the authorities. <br />\n“If they’re telling us, Here’s how you can protest, then that, to me, is not civil disobedience,” said Randall. <br />\n“If you are coloring within the lines that the establishment establishes, then you are putting no pressure on the establishment.<br />\n”\nCuba Should Join in Fight for Slavery Reparations\nThe young United States was a horrible example of democracy, but it did lead the way in the business of human trafficking. <br />\n“After the establishment of the United States, it quickly became the leader in the African slave trade to Cuba,” said Dr Gerald Horne, professor of history and African American Studies at the University of Houston and author of Race to Revolution: The United States and Cuba During Slavery and Jim Crow. <br />\n“They also became the leader of the African slave trade to Brazil, helping to account for the fact that Brazil has more people of African descent than any other nation outside Nigeria,” said Horne, who hopes to enlist Cuba in “our journey to claim reparations for the enslavement of Africans in the Americas.”<br /></p>\n"
}
