{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-a-look-back-at-the-russia-ukraine-crisis-091614/",
    "podcast": {
      "developer-note": "",
      "length": "56:48",
      "note": "",
      "size": 20448504,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/6ctp8z/PCH_091614.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "A Look Back at the Russia-Ukraine Crisis"
  },
  "title": "A Look Back at the Russia-Ukraine Crisis",
  "date": "2014-09-17 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Robert Parry is one of our leading progressive investigative journalists best known for his uncovering Iran-Contra<span class=\"ellipsis\">…</span>\n<!--more-->\nstory and Oliver North’s involvement which earned him the George Polk Award for National Reporting in 1984.  He current writes for Consortium News, and has covered many important stories on domestic and foreign affairs issues including the Nicaragan contra-cocaine connection, right wing terrorism, the demise of American media, the Bush and Obama presidencies, the rise and influence of the Neocons and our wars overseas.<br />\n  He has worked as a journalist for the Associated Press, Newsweek and PBS Frontline.\n<br />\n \nHe has written several books, his latest being “America’s Stolen Narrative: From Washington and Madison to Nixon, Reagan and the Bushes to Obama”    His website iswww.ConsortiumNews.com\nEric Zeusse is an investigative historian and author with a long career of researching many of the topics and events that have been most troubling to Americans not afraid of critical thought.  In 1982 he won the prestigious HL Mencken Award for best investigative reporting on the toxic dumpsite at Love Canal in Niagara Falls New York.  His writings appear in all the leading progressive news sites such as Global Research, Huffington Post,  Business Insider, Salon.com, Commondreams, Alternet,  and others.<br />\n   He has authored several books including “They’re Not Even Close: The Democratic vs. <br />\nRepublican Economic Records 1910-2010” and more recently a revisionist investigation into the origins of the Christian religion entitled “Christ’s Ventrioquists: The Event that Created Christianity.”\n<br /></p>\n"
}
