{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-caryn-hartglass-011513/",
    "podcast": {
      "developer-note": "",
      "length": "53:44",
      "note": "",
      "size": 12898847,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/xf63hj/NaturalNurse011513.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "Caryn Hartglass"
  },
  "title": "Caryn Hartglass",
  "date": "2013-01-15 00:00:00 -0500",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Host Ellen Kamhi, PhD RN, www.naturalnurse.com, interviews Caryn Hartglass. Caryn was born and raised in New York.\n<!--more-->\nShe received her Bachelor and Masters of Science degrees in Chemical Engineering from BucknellUniversity and worked in the semiconductor industry for 20 years. <br />\nWith a passion for helping people understand the affects of food choices on health and environment, she ran the nonprofit EarthSave International as Executive Director for over 8 years. <br />\nAn ovarian cancer survivor, Caryn combines science with practical knowledge from real life experiences lecturing around the world about the powerful, healing benefits of a plant-based diet, juicing and meditation. <br />\nShe has appeared on Dr Oz, Geraldo At Large, 20-20 and CNN. <br />\nA classically trained singer, she has performed in opera and musicals in the United States and abroad and has won two international competitions (France, South Africa).\n<br /></p>\n\n<p>Caryn Hartglass is the host of two weekly Internet radio shows, It’s All About Food and Ask A Vegan. <br />\nShe is the founder of the nonprofit organization Responsible Eating And Living (REAL), http://responsibleeatingandliving.<br />\ncom/, which delivers easy to use, factual information and services, providing inspiration to take responsibility to nourish, protect and support ourselves, our families and the Earth with whole, plant-based foods and planet-friendly products. <br />\nMore about Caryn can be found at her website, www.carynhartglass.com or on twitter at @REALWorldwide<br /></p>\n"
}
