{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/november-23-2010/",
    "podcast": {
      "developer-note": "",
      "length": "57:21",
      "note": "",
      "size": 13765680,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/kuivh4/GaryNullShow112310.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "November 23, 2010"
  },
  "title": "November 23, 2010",
  "date": "2010-11-23 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Prof.\n&lt;!--more--&gt;\nNiels Harrit is an associate professor in the Chemistry Department at the University of Copenhagen, Denmark - where he has taught for the past 35+ years. <br />\nHe was one of the leade scientists and authors of the important paper “Active Thermitic Material Discovered in Dust from the 911 World Trade Center Catastrophe, which was publishes in the peer-reviewed journal, The Open Chemical Physics Journal.\n<br />\nProf. <br />\nHarrit is well known throughout Europe for his investigations in the alternative causes for the collapse of the three bulidings on 911, countrary to the offical NSIT and Commission reports.\n<br />\nKevin Ryan is a chemist who began investigating the tragedy of September 11 through his work as Site manager for te division of Underwriters Laboratoriees. <br />\nHe was fired by the company in 2004 for writing to the National Institute of Standards and Technology (NIST), and speaking out about discrepancies in its World Trade Center investigation and the Laboratory’s work to ensure the fire resistance of the buildings. <br />\nKevin now serves as the co-editor of the Journal of 9/11 Studies, and is the board director at Architects and Engineers for 911Truth. <br />\nHe has co-authored several books and peer-reviewed scientific articles on the subject.<br /></p>\n"
}
