{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-081214/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:3",
      "note": "",
      "size": 21785544,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/rj75g6/ProgressiveCommentaryHour_081214.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-08-13 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Joachim Hagopian (Hag-o-pian) has been a practicing clinical psychologist and marriage counselor practicing in<span class=\"ellipsis\">…</span>\n<!--more-->\nCalifornia for over 25 years, with an emphasis on disadvantaged youth, the child welfare system and education. <br />\n  From a Congressional appointment, Joachim attended the US Military Academy at West Point through a Congressional appointment in the late 1960s. <br />\n After clashing with the system he was railroaded out at the end of his third year. <br />\nThis resulted in Joachim filing charges against the academy with failure to allow due process and he won the case in a New York federal district court. <br />\nThis case set the precedent that continues today for cadets the right to present their case and witness before the academy. <br />\nJoachim’s story is retold in his manuscript book “Don’t Let The Bastards Getcha Down.<br />\n”  His writings focus on education, geopolitics, the national security and police state, and international relations for Global Research, many which have been featured on the Public Radio Network and Boiling Frogs. <br />\nHis articles can be found at GlobalResearch.ca under Hagopian, and his West Point book at RedRedSea.<br />\nnet.\n<br />\nRoss Caputi (Cah-poo-tee) is a former US Marine who served from 2003 to 2006 and took part in the second siege of Fallujah Iraq in November 2004. <br />\nBeing openly critical of the military policies and actions, he was discharged in 2006. <br />\nSince then, Ross went on to found and direct the Justice for Fallujah Project, a group of veterans, students and citizens dedicated to raising awareness about the suffering of the people of Fallujah, and the US’s war crimes committed there. <br />\nAmong the Projects board members are Noam Chomsky and journalist Dahr Jamail. <br />\nHe is also the director of the recent documentary film “Fear Not the Path of Truth: A Veterans Journey After Fallujah”  Ross holds an MA in linguistics, has written for Globalresearch and Guardian, and his website is TheFallujaProject.<br />\norg.\n<br />\nJon Rappoport has worked as a free-lance investigative reporter for over 30 years, writing about politics and the corportacracy, alternative health and the medical cartel, the media, and culture LA Weekly, Spin Magazine, Stern, Village Voice, Nexus, CBS Healthwatch, and other newspapers and magazines in the US and Europe. <br />\nHis reporting on the military in El Salvador earned him a submission for the Pulitzer prize. <br />\n He has hosted, produced, and written radio programs and has appeared as a guest on over 200 radio and television programs, including ABC’s Nightline, Tony Brown’s Journal (PBS), and Hard Copy. <br />\n For the last ten years, Jon has operated largely away from the mainstream because, as he puts it, “My research was not friendly to the conventional media.”  He runs a website with many years of research and articles called NoMoreFakeNews.com.<br /></p>\n"
}
