{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-051214/",
    "podcast": {
      "developer-note": "",
      "length": "57:26",
      "note": "",
      "size": 13787324,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/68fbig/LeidStories_051214.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-05-12 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>On Life and Leadership, Much In Common Between Nigeria and U.S.A.\nIt may seem like an anomaly, but President Goodluck<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nJonathan of Nigeria and President Barack Obama have much in common on matters of political leadership and the direct impact of their respective administrations on the day-to-day issues affecting hundreds of millions of people they were elected to serve.\n<br />\nLeid Stories examines the startling similarities between the two statesmen, whose administrations are now partners in an international effort to find 276 girls kidnapped at night from their dormitories by the Islamist extremist group Boko Haram on April 14 and still in the hands of their captors.\n<br />\nDr Chika Onyeani, publisher and editor in chief of The African Sun Times, is our guest.\n<br />\nFirst Lady Michelle Obama, on Saturday (May 10), the eve of Mother’s Day, made an impassioned speech from the White House deploring the Nigerian girls’ kidnapping, focusing on their dedication to their education. <br />\nLeid Stories comments on the irony of her speech.\n<br />\nFrom Detroit, Abayomi Azikiwe, editor of the Pan-African Newswire and Detroit organizer for the Workers World Party, reports from bankruptcy court on today’s hearing on creditors’ objections to the city’s controversial bankruptcy-exit plan.<br /></p>\n"
}
