{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-01-02-12/",
    "podcast": {
      "developer-note": "",
      "length": "1:02:17",
      "note": "",
      "size": 14951376,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/asaing/GaryNullShow010211.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-01-02 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guest: Conrad LeBeau\nConrad LeBeau is a self-educated investigative health author  and a developer of supplement<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nproducts for a company he founded Vital Health Prodcuts. <br />\n He is founder of Keep Hope Alive, a non profit education organization, Vital Health Publications and the Journal of Immunity. <br />\n He has written extensively on alternative ways to improve immune system, natural ways to improve gastro-intestinal health and the health risks of cell phone towers.\n<br />\nIn 2008 and 2009, after using peer reviewed medical research obtained from the National Library of Medicine to provide scientific support for certain of his products, Conrad was targeted by the FDA for special attention and investigation. <br />\n He was forced to close down Vital Health Products as a business and later discovered the DFA has planted spyware on his website to tack changes.\n<br />\nIn December 2010, hew as indicted for a misdemeanor by a US attorney under FDA pressure for 4 health products that had been sold to undercover FDA agents in 2009.\n<br />\nSince then, Conrad has performed extensive research into the FDA rulings and their operations, future pending bills, and is prepared to fight the FDA on the charges in court about how the FDA interprets and enforces the Food and Drug Act, the freedom and right to share and use information from the US National Library of Medicine, the FDA GMPs for dietary supplements that will eventually force 1000s of small dietary companies out of business and the FDA’s abuse of power.\n<br />\nWEBSITE:  www.KeepHopeAlive.org\n<br /></p>\n"
}
