{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/infectious-myth-012015/",
    "podcast": {
      "developer-note": "",
      "length": "59:05",
      "note": "",
      "size": 21275549,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/c5uqmi/InfectiousMyth_012015.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "The Infectious Myth"
  },
  "title": "The Infectious Myth",
  "date": "2015-01-20 00:00:00 -0700",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>David speaks with Wayne Rohde about “The Vaccine Court”, the title of his 2014 book, and the common name for the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\npseudo-legal tribunal of the US National Vaccine Injury Program. <br />\nThe Vaccine Court began in October 1988 as a way to transfer responsibility for compensation to the US government, away from pharmaceutical companies. <br />\nThis followed massive compensation award to victims of the DPT vaccine, and also the mid-1970s Swine Flu vaccination program. <br />\nThe Vaccine Court is funded by a small fee attached to each vaccine sold.\n<br />\nWayne describes many of the problems with the Vaccine Court, including a cap on compensation, the lack of publicity (even though it’s mandated by legislation) and the relatively short time period after vaccination during which a petition can be made. <br />\nPerhaps the major problem is the gradual removal of conditions from the list of side effects associated with each vaccine, which forces people, often parents, into a more legalistic process, involving lawyers and high costs.<br />\n \nOver the years compensation has become more and more difficult to obtain. <br />\nThis leaves parents, in particular, forced to try to manage the 24-hour care for seriously injured children on their own, worrying about the future of their child when they pass on. <br />\nWayne Rohde speaks personally about this, being the father of a vaccine-injured son, who is now 17 years old. <br />\nThey realized that the problem was vaccine induced too late to get compensation, so the costs of daily assistance with their son is borne completely by them.<br /></p>\n"
}
