{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-062112/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:38",
      "note": "",
      "size": 14555638,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/xk4iti/GaryNullShow062112.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-06-21 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>News Maker:  South Carolina Republican governor Nikki Haley vetoing a Democrat sponsored bill to provide 7th graders<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nwith free HPV vaccine\nCindy Bevington is an investigate reporter for the KPC Media Group. <br />\nShe broke the story of a lead researcher in Merck’s Gardasil trials, Dr Diane Harper, then at Dartmouth Medical School, who raised alarm about the efficacy and safety of the vaccine and who called it “a big public health experiment”. <br />\n Since then she has continued to follow the Gardasil and HPV infection controversies and continues as an independent writer and journalist in vaccination and other medical issues. <br />\n Cindy has won over 7 dozen awards for her work during her career, about half of them first place, in investigative and in-depth news and features.\n<br />\nEuropean Destabilization Mechanism\nEllen Brown is an economist and attorney who is now the President and Chairman of the Public Banking Institute – a non profit economic venture to find viable, sustainable solutions to America’s banking crises by promoting people-owned state and community banks. <br />\nShe has written extensively about the private financial cartels and the Federal Reserve. <br />\nHer book, “Web of Debt: The Shocking Truth About Our Money System and How We Can Break Free” analyses in depth how Wall Street and its hold on Washington control money for their self-interests. <br />\nShe runs a blog, WebOfDebt.<br />\ncom, which includes her articles dealing with the financial crisis, Administration’s handling of it, as well as new banking models for protecting the public. <br />\nHer writings also frequently appear on the website of the Center for Global Research, where she is a research associate.\n<br />\nBOOK: “Web of Debt: The Shocking Truth About Our Money System and How We Can Break Free” WEBSITE: www.WebOfDebt.com\n<br /></p>\n"
}
