{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/the-new-republican-congress%e2%80%99s-4th-corporate-offensive-112214/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:13",
      "note": "",
      "size": 22039160,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/7ft3bi/AlternativeVisions_112214.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "The New Republican Congress’s 4th Corporate Offensive"
  },
  "title": "The New Republican Congress’s 4th Corporate Offensive",
  "date": "2014-11-22 00:00:00 -0700",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>In the wake of the recent midterm elections, Dr.\n&lt;!--more--&gt;\nRasmus describes how the new Republican controlled Congress is about to develop new policies on behalf of Corporate America, many of which represent a resurrection of past policies of the Bush administration—ie old wine in new bottles. <br />\nRasmus identifies and explains the likely emerging new policy initiatives in the weeks and months immediately ahead: more corporate tax cuts, accelerated push for free trade for pacific rim countries and europe, immigration reform defined as more policing and fences, rollbacks of environmental protection initiatives (Xl pipeline, industrial plant emissions, public lands fracking, EPA funding, international CO2 limits), Affordable Care Act revisions (more business exemptions, cost shifting to consumers, limits on Medicaid), limits on financial regulation under the Dodd-Frank Act, more aggressive foreign policy action (green light for conflicts and funding of proxies in Syria, US troops to Iraq again, Ukraine (US advisers, special ops, money), NATO push into east Europe (Ukraine, Moldova, Georgia), more freedom of action for NSA spying on US citizens and limits on free speech and assembly. <br />\nJack explains how the new emerging policy offensive fits in the four decade long current pro-corporate offensive in America by US government and institutions. <br />\nJack provides an historical context for it all and  how resistance represents the latest effort in a centuries long struggle by American people to expand and defend their democratic, civil and economic rights since the American revolution period of 1776-1787.\n<br /></p>\n"
}
