{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/the-infectious-myth-sinking-our-teeth-into-infection-control-with-dr-john-hardie-082614/",
    "podcast": {
      "developer-note": "",
      "length": "58:11",
      "note": "",
      "size": 20949192,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/3xsf7u/TIM_082614.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 24 Feb 2015 20:00:00 +0000",
        "timestamp": "1424826000"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Sinking our teeth into infection control with Dr. John Hardie"
  },
  "title": "Sinking our teeth into infection control with Dr. John Hardie",
  "date": "2014-08-26 00:00:00 -0400",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>Episode 26 looks at the issue of infection control in dentistry.\n<!--more-->\nYou might think that this is a dry issue of interest only to dentists, it actually provides us with a lot of information about the low risk of infection by the supposed hepatitis B and C viruses and HIV even when there is plenty of blood to provide a convenient route. <br />\nDr John Hardie discusses several cases of dentists and other medical professionals who had substandard infection control and yet did not leave a trail of infected patients behind them.\n<br />\nDavid and John spend a lot of time talking about the Dr Acer case from the late 1980s, a dentist who the CDC tried hard to paint as the first (and so far only) dentist to ever transmit HIV to a number of patients. <br />\nEven though Acer was HIV-positive, the worst possible situation, nobody could ever figure out how he might have transmitted HIV, and there was considerable evidence that his HIV-positive patients got their antibodies in some other way. <br />\nHis most famous patient was Kimberley Bergalis, a young woman whose emaciated figure testifying to congress became one of the most famous images of the early AIDS panic. <br />\nBut she was also taking high doses of the drug AZT, which can produce those very symptoms.<br /></p>\n"
}
