{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-070312/",
    "podcast": {
      "developer-note": "",
      "length": "59:59",
      "note": "",
      "size": 14398903,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/n73669/GaryNullShow070312.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-07-03 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>With guest Suzanne Humphries, MD, outspoken advocate of patient rights, and a beacon for spearheading debate on public<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nhealth issues.\n<br />\nDr Humphries is a conventionally educated, allopathically trained medical doctor. <br />\nShe earned a bachelor’s degree in theoretical physics from Rutgers University in 1987. <br />\nAfter a two year education as the head technician in a research biochemistry lab, she went to medical school, graduating from Temple University School of Medicine in 1993. <br />\nShe then explored the area of social medicine in the Bronx NY where she completed her 3 year medical residency. <br />\nAt this juncture, Dr Humphries became more aware of the failures of primary care medicine, observing that doctors are largely trained to prescribe drugs and hunt down disease. <br />\nDespite this approach, the patients continued to get sicker, requiring more drugs and ultimately developing degenerative diseases. <br />\nNot wanting involvement in the generation of chronically ill patients, she opted to work at the other end of the allopathic continuum. <br />\nAfter 14 years of practicing medicine in the form of Nephrology, or otherwise known as kidney medicine, her perspective on the overall success of the allopathic paradigm has developed and matured. <br />\nShe views allopathic medicine as an overused system- that when implemented as first line treatment across-the-board for mild illnesses and symptoms, will mostly just drive the forces that generate chronic illnesses. <br />\nShe has been a student of homeopathy for 4 years and is at the end of her studies to becoming a fully certified homeopathic physician.<br /></p>\n"
}
