{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-011413/",
    "podcast": {
      "developer-note": "",
      "length": "55:2",
      "note": "",
      "size": 13283294,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/cd8xwa/BAR011413.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2013-01-14 00:00:00 -0700",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>What Would Dr. King Do?\nWere he alive today, Dr. Martin Luther King Jr.\n&lt;!--more--&gt;\nwould “highlight Wall Street criminality,” “war crimes coming out of the White House, the Pentagon, and the State Department” and “the social crimes of the New Jim Crow, the criminal justice system, which is itself criminal,” said Dr Cornel West, of the Union Theological Seminary, in New York. <br />\n“Martin would be very, very sad when he looked at the fraudulent character of Black leadership, the massive capitulation to the White House.<br />\n”\nThe slain civil rights leader “would be in righteous opposition to the American regime of austerity and war, and to a president and his administration that is in the vanguard of it,” according to Dr Anthony Monteiro, professor of African American Studies at Temple University, in Philadelphia. <br />\n“King was, at the end of the day, a democratic revolutionary. <br />\nHe was calling for an uprising to the forces of injustice and war,” said Monteiro. <br />\nIn contrast, today’s “Black petit bourgeoisie are more interested in their own comfort than they are in social justice.<br />\n”\nBlack Women’s Wage Gap\nThe wage gap between men and African American women is 70 cents on the dollar, according to a study of US Census Bureau data by the National Partnership for Women and Families. <br />\nSarah Crawford, the group’s director of workplace fairness, said “nearly 40 percent of households headed by African American women are living in poverty, so this lost pay in particularly critical for those families. <br />\nThe difference in earnings amounts to more than $14,000 each year.<br />\n”\nFictional Fiscal Crisis\n“The conservatives, the Republicans, the business lobby, have been allowed to control the debate” over fiscal policy “because they’ve created the idea that we have this big deficit crisis,” said Dean Baker, co-director of the Washington-based Center for Economic and Policy Research. <br />\n“And it really is a fiction.” Such false assumptions are why “programs like Medicare and Social Security are on the chopping block.”\nPace of Police Killings of Blacks Increases\nKali Akuno, one of the authors of last year’s Malcolm X Grassroots Movement report on extrajudicial killings of Blacks, said “we are already noticing that, by our count, there’s been ten Black men who’ve been killed by police in 2013, and that’s faster than the pace of 2012.<br />\n” Akuno spoke earlier this month on a National Forum on Police Brutality and Institutional Racism, on Your World News, hosted by Solomon Comissiong and Peter Fowler.\n<br />\nObama’s War Mongers\n“Virtually everybody on the top echelon of the Obama foreign policy team, they all backed the Iraq War,” points out Sam Husseini, communications director of the Institute for Public Accuracy. <br />\nRepublican Senator Chuck Hagel, tapped for Secretary of Defense, fits the bill. <br />\nJohn Brennan, the White House intelligence advisor who got the president’s nod to head the CIA, meets every week with Obama “to decide who they are going to kill,” said Husseini. <br />\n“He at one point claimed that there were no civilian deaths from the drone program, though we know there are civilian deaths.”\n<br /></p>\n"
}
