{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-031915-1426876239/",
    "podcast": {
      "developer-note": "",
      "length": "59:34",
      "note": "",
      "size": 21449534,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/64iqtm/LeidStories_032015.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 23 Mar 2015 18:02:39 +0000",
        "timestamp": "1427151759"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2015-03-20 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>The National Urban League Refuses to Take A Hint\nA Mighty Tree Has Fallen: Remembering Dr.\n&lt;!--more--&gt;\nYosef ben-Jochannan\nWith customary officiousness, the National Urban League yesterday released its annual state-of-the-union report on America that statistically quantifies how people of color, specifically African Americans and Latinos, are faring.\n<br />\nThe news was not good.<br />\n “America today is a tale of two nations. <br />\nIt is a tale of two Americas,” NUL president Marc Morial announced, both referencing and avoiding the irony that a blue-ribbon panel appointed by President Lyndon B. <br />\nJohnson to look into the waves of urban rebellions that erupted in America’s major cities in the 1960s had reached the same conclusion.\n<br />\nConsidering it’s the NUL’s 39th report, and its reports generally reiterate the same theme—some progress here and there, but “a long way to go” to achieve equality and justice—it’s time the NUL and other advocacy organizations to concede that America’s apartheid system is functioning as planned and is efficiently achieving its goals. <br />\nLeid Stories says it’s well past time that these organizations take hints from their own studies and reports about their effectiveness as advocates.\n<br />\n \nA mighty tree has fallen. <br />\nDr Yosef ben Jochannan, a world-renowned scholar of African history and among the last of his generation who dedicated themselves to restoring the centrality of Africa to world civilization, died yesterday in New York. <br />\nHe was 97 years old.\n<br />\nLeid Stories pays tribute to the beloved “Dr Ben.”<br /></p>\n"
}
