{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg"
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/the-infectious-myth-kurtis-hagen-041514/",
    "podcast": {
      "developer-note": "",
      "length": "58:53",
      "note": "",
      "size": 14134962,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/xaj96w/InfectiousMyth_041514.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Kurtis Hagen"
  },
  "title": "Kurtis Hagen",
  "date": "2014-04-15 00:00:00 -0600",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>In Episode 8 of “The Infectious Myth” David Crowe talks with Kurtis Hagen, who is an Associate Professor of Philosophy<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nat the State University of New York in Plattsburgh. <br />\nKurtis and David talk about conspiracy theories and the limits of acceptable intellectual discourse.<br />\nKurtis became interested in conspiracy theories after watching the documentary, “Loose Change”, about 9/11. <br />\nHe entered into correspondence with NIST, the US government institute that wrote the engineering reports on the World Trade Center building collapses because he was interested in explanations for the collapse of Building 7, not hit by any airplanes. <br />\nAll he got from them were evasive responses and an unwillingness to explain how a building could collapse at a speed indistinguishable from free fall without being deliberately imploded.Other subjects discussed are known and admitted conspiracies of the CIA and other governments, for which he uses the term SCAD – State Crimes Against Democracy (originally coined by Lance deHaven-Smith http://dehaven-smith.com/faq/default.<br />\nhtml), rather than conspiracy theories. <br />\nKurtis describes Operation Northwoods, a well document US government SCAD that, despite never actually taking place, is instructive in its level of detail, and in the methodology, intended to blame Cuba for the downing of an airplane supposedly filled with Americans, by using a drone, similar to a plane carrying people, blowing up the drone, and allowing other people to find the drone, and draw the conclusion that it was actually a passenger plane blown up by a Cuban missile.<br />\nKurtis also describes a debate he had with top lawyer Cass Sunstein over the issues of whether any conspiracy theories are believable, and secondly over whether the government should attempt to infiltrate and discredit people who postulate views that go against the establishment position. <br />\nSunstein’s position is particularly worrying because he was for a time a member of Obama’s government. <br />\nGovernment infiltration of groups that advocate reducing the government’s power (native Americans, environmentalists, black power etc) is well known. <br />\nIt is worrying that similar activities may be taking place against people who threaten not government power, but powerful commercial interests, such as the chemical or pharmaceutical industries.You can download one of Professor Hagen’s article, “Conspiracy Theories and Stylized Facts”, here: http://911inacademia.files.wordpress.com/2011/01/kurt-hagen-conspiracy-theories-and-stylized-facts.pdfA summary of his article, “Is Infiltration of ‘Extremist Groups’ Justified”, http://911blogger.com/news/2011-02-03/article-infiltration-extremist-groups-justified.<br /></p>\n"
}
