{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-012315/",
    "podcast": {
      "developer-note": "",
      "length": "58:52",
      "note": "",
      "size": 21197808,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/t9kpwm/GaryNullShow_012315.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2015-01-23 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>What Big Food is Hiding with its slick PR campaign on GMOs, with Gary Ruskin. Newsmaker and call to action on NY State<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nAssembly bill to label supplements as to whether they were reviewed by the FDA, with Allison Murphy. \nGary Ruskin is the co-founder and executive director of US Right to Know, a non profit organization just launched this week with the mission to investigate and expose the failures of the corporate food system and the dark propaganda hidden from the public.<br />\n  In 2012, he was campaign manager for California Right to Know (Proposition 37) and earlier directed the Congressional Accountability Project for 14 years, which opposed corruption in the US Congress. <br />\nFor nine years, Gary was executive director and co-founder ofCommercial Alert and also served as the director for the Center for Corporate Policy. <br />\nHe has often been quoted in major newspapers across the country and has appeared scores of times on national TV news programs. <br />\nHe received his undergraduate degree in religion from Carleton College, and a master’s degree in public policy from Harvard University’s John F. <br />\nKennedy School of Government.  US Right to Know’s website is USRTK.org\nAllison Murphy is an attorney and the Legislative Director for the Alliance for Natural Health USA, a national nonprofit organization with over 400,000 members, that is dedicated to promoting sustainable health, health freedom choice, and protection to natural health care practitioners through good science and law.  Prior to joining the Alliance, Allison worked in government relations in Washington DC and in the United States Senate.  The website is ANH-US.org<br /></p>\n"
}
