{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-africa-and-the-new-colonialism-of-the-continent-021113/",
    "podcast": {
      "developer-note": "",
      "length": "58:22",
      "note": "",
      "size": 14011246,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/5fhx9j/PCH021113.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Africa and the new colonialism of the continent"
  },
  "title": "Africa and the new colonialism of the continent",
  "date": "2013-02-11 00:00:00 -0700",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>William Blum is an author, historian and critic of American foreign policy, who has worked and reported from three<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\ndifferent continents.  He was one of the founding editors of the Washington Free Press, the first “alternative” newspaper in DC.<br />\n  His early journalism is best known for exposing CIA misdeeds and operations.\n<br />\nHis recent book, just released is “America’s Deadliest Export: Democracy” published by Zed Books.\n<br />\nHis blog is www.KillingHope.com where you can read his frequent essays.<br />\n  Bill is currently the originator of the monthly newsletter “The Anti-Empire Report”.\n<br />\nBOOK:  “America’s Deadliest Export: Democracy”\nWEBSITE:  www.KillingHope.<br />\ncom\nGlen Ford is the Executive Editor of the Black Agenda Report. <br />\nIn the 1970s he was a correspondent and journalist covering Capitol Hill and the White House for the Mutual Black network, and later hosted the nation’s first syndicated Black news interview program, “America’s Black Forum.”  Since then, Glen has been one of the nation’s leading voices in political and social analysis and commentary on current affairs in the Black community.<br />\n  He is also a founding member of the Washington chapter of the National Association of Black Journalists, a board member of the National Alliance of Third World Journalists and is a frequent lecturer on the role of progressive media at universities.\n<br />\nGlen’s program – The Black Agenda Report – can be heard every Monday at 4:00 pm on the Progressive Radio Network\nWEBSITE:  www.BlackAgendaReport.<br />\ncom\nRick Rozoff has been an active opponent of war, militarism and intervention for over 40 years. <br />\nHe is the manager of Stop NATO and its internet activities, which focuses on the threat of international militarization, especially through globalization, of the North Atlantic Treaty Organization (NATO). <br />\nRich has written over 300 articles on international affairs ,frequently published on  the Center for Research in Globalization and VoltaireNet, and has been interviewed on radio and television programs in Russia, the Middle East, Africa and the Caribbean.\n<br />\nWEBSITE:  RickRozoff.Wordpress.com\n<br /></p>\n"
}
