{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-109/",
    "podcast": {
      "developer-note": "",
      "length": "1:02:14",
      "note": "",
      "size": 14938704,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/7ghkt2/GaryNullShow051211.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-05-12 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today’s guest is Patricia Cori and she is an author, lecturer, historian ancient cultures, and a spiritual teacher,<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nliving in Italy but currently on the Azore Islands  off the coast of Portugal and Africa. <br />\nShe is recognized intuitive sensitive who has been focusing her attention on the ecological plight of dolphins and whales amidst rapid man-made degradation and pollution of our oceans. <br />\n  Her deep connection following years swimming and attempting to communicate with whales and dolphins has led to her starting an international campaign to prevent the extinction of these extraordinarily intelligent sentient beings.\n<br />\nPatricia is the author of several books including Beyond the Matrix: Daring conversations with the Brilliant Minds of Our Times, which includes discussion with Michio Kaku, astronaut Edgar Mitchell and others. <br />\n Her most recent book is “ Before We Leave You: Messages from the Great Whales and the Dolphins” which records her journey into the world of these creatures and their attempts to give humanity a message about the endgame of civilization’s ongoing destruction of the environment.\n<br /></p>\n"
}
