{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-031912/",
    "podcast": {
      "developer-note": "",
      "length": "51:37",
      "note": "",
      "size": 12390854,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/w2anp9/NaturalNurse031912.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "The Natural Nurse"
  },
  "title": "The Natural Nurse",
  "date": "2012-03-19 00:00:00 -0600",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Host Ellen Kamhi, PhD RN, www.naturalnurse.com, interviews Harvey Diamond.\n&lt;!--more--&gt;\nHarvey Diamond is a Health &amp; Wellness Advocate and New York Times #1 Bestselling Author who has been studying and teaching the principles of healthful living for over 40 years. <br />\nIn a stunning validation of his healing methods, Harvey has triumphed over a devastating condition called Peripheral Neuropathy, brought on by Agent Orange poisoning while serving his country in Vietnam. <br />\nAlthough he has significant lingering damage to his musculature, thanks to his considerable understanding of the human body and its proper care, he is one of the longest known survivors of this condition. <br />\nHarvey has helped millions of people worldwide to dramatically improve their health and overcome serious, catastrophic disease. <br />\nHis FIT FOR LIFE books have sold nearly 14 million copies in 33 languages and are read in over 80 countries, and held the #1 position on the prestigious New York Times Bestseller list for an unprecedented 40 consecutive weeks. <br />\nIt was the fastest selling book of its kind in history. <br />\nHarvey has made multiple appearances on Oprah Winfrey, Larry King, Nightline with Ted Koppel, Merv Griffin, Live with Regis Philbin, Good Morning America, The Today Show, QVC, Pat Robertson’s 700 Club and is our guest today on The Natural Nurse and Dr Z. <br />\nContact: www.harveydiamond.com<br /></p>\n"
}
