{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-ray-mcgovern-110314/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:53",
      "note": "",
      "size": 21918161,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/59236b/GaryNullShow_110314.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Ray McGovern"
  },
  "title": "Ray McGovern",
  "date": "2014-11-03 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Speaking with Ray McGovern about his recent arrest in NYC and what is America becoming</p>\n\n<p>Ray McGovern served as an Army<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nintelligence officer and a CIA analyst under 7 presidential administration, from the John F. <br />\nKennedy White House to that of George H. <br />\nW. <br />\nBush. <br />\nAmong his duties was preparing the President’s Daily Brief, which was a one-on-one to President Ronald Reagan’s most senior national security advisers.<br />\n  He was responsible for the analysis of Soviet intelligence regarding Vietnam. <br />\nSince retiring from government service, he has been one of our nation’s most vocal peace activists and journalists and helped create Veteran Intelligence Professionals for Sanity (VIPS) to expose the way intelligence was being falsified to “justify” war on Iraq. <br />\nLast Thursday, Ray was again arrested for attempting to attend a NYC lecture appearance by General David Petraeus, which he had a ticket to attend. <br />\nEarlier he won a civil rights suit against the State Department for a brutal arrest while protesting a speech by Hillary Clinton\nRay’s opinion pieces appear in many leading newspapers here and abroad.<br />\n  He holds degrees in theology and philosophy from Fordham University, is a graduate from Harvard Business School and has a certificate of theology from Georgetown University. <br />\n  His website is RayMcGovern.com  and more of his writings can be found on ConsortiumNews.com  \n<br /></p>\n"
}
