{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-121014/",
    "podcast": {
      "developer-note": "",
      "length": "54:08",
      "note": "",
      "size": 19493005,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/t3g82u/LeidStories_121014.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-12-10 00:00:00 -0500",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>The Senate Report on Bush-Era CIA Torture Programs: What it Means to Obama’s Lame-Duck Presidency, and Its Link to<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nState-Condoned Terrorism in the US\nFive and a half years in the making, the Senate Intelligence Committee’s report on the CIA’s treatment of terrorist suspects after the Sept. <br />\n11, 2001 attacks was made public yesterday, although as a declassified 525-page summary of 6,700 pages.\n<br />\nA scathing indictment of Bush-era CIA policies and practices that, it said, sanctioned the use of torture and other illegal interrogation methods to extract information from detainees with suspected links to the al-Qaeda terrorist network, the report immediately set off a firestorm of criticisms and accusations by Republicans who say that both its timing and content are a political hit. <br />\nAre they right?\n<br />\nHow will the report affect President Obama’s last two years in office, which promises to be a bruising marathon of partisan warfare? <br />\nAnd what is the link between the Senate report and the current uproar across the United States over what many view as torture of the homegrown kind—entire communities living in fear of the police?\n<br />\nOur guest, diplomatic scholar, historian, attorney and prolific author Dr Gerald Horne, shines his customary penetrating light on these questions. <br />\nHorne is the John J. <br />\nand Rebecca Moores chair of history and African American studies at the University of Houston.<br /></p>\n"
}
