{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/g3iv7a/vaccine-syringe-istock.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-022415/",
    "podcast": {
      "developer-note": "",
      "length": "57:19",
      "note": "",
      "size": 20638886,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/4tsvk6/PCH_022415.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2015-02-25 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>The lack of efficacy and health risks of the HPV Vaccines – Gardasil and Cervarix, with Dr. Lucija Tomljenovic, Dr.\n<!--more-->\nKen Stoller, and Dr Mark Flannery</p>\n\n<p>Dr Lucija Tomljenovic is an early career postdoctoral fellow. <br />\nShe received her PhD in Biochemistry, from the Comparative Genomics Centre at James Cook University in Townsville, Australia. <br />\nIn 2010, and  joined the Neural Dynamics Research Group at the University of British Columbia to work on with renowned neuroscientist Prof. <br />\nChristopher Shaw’s. <br />\nHer research has focused up the neurotoxic properties of the human papilloma virus vaccines and aluminum vaccine adjuvants. <br />\nRecently she was a visiting research at the University of Tel Aviv in Israel to discover the HPV vaccine mechanisms leading to autoimmune disorders. <br />\nLucija is also an Associate Editor of the Journal of Alzheimer’s Disease.<br />\n She and her colleagues are among the few courageous university researchers undertaking independent and honest experiments into the causation for adverse vaccine effects.\n<br /></p>\n\n<p>Dr Ken Stoller is a board pediatrician medicine and a environmental activist. <br />\nHe is a founder and president of the International Hyperbaric Medical Association, a diplomat of the American Board of Pediatrics and a founder of the Humane Farming Association. <br />\nHaving become frustrated with medical agency and association cover-ups and the corporate medical lobbying powers over the rapid rise in children’s developmental disabilities, Dr Stoller and other physicians testified before Congress on the role vaccinations have played, particularly mercury, in the rise of autism and other related conditions.<br />\n  In 2006, he met with environmental scientists at CDC headquarters to discover their concern about mercury but being powerless to affect the agency’s policy. <br />\nHis letter of resignation to the American Pediatric Association, published in a distinguished peer review medical journal, raised quite a storm in the pediatric community.   His website is BodiesInRebellion.com</p>\n\n<p>Dr Mark Flannery is a Chiropracter physician in southern California and a fellow of the American Association of Integrative Medicine.  He specializes in functional medicine under the guidance of the pioneer functional medical scientist Datis Kharrazian. He became internationally renown for his work treating individuals with Hashimoto hypothyroidism.<br />\n  More recently he has been observing the serious side effects of the HPV vaccines in young adults and has been investing treatments for vaccine injuries. <br />\nDr Flannery has degrees from University of Southern California and Rochester Institute of Technology, and received Doctor of Chiropractic degree graduating cum laude from Cleveland Chiropractic College, Los Angeles.  His website is DrFlannery.com<br /></p>\n"
}
