{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-121714/",
    "podcast": {
      "developer-note": "",
      "length": "59:21",
      "note": "",
      "size": 21368336,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/g56rdm/LeidStories_121714.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-12-17 00:00:00 -0500",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>The Thrill Is Gone, and Haitians Want Clinton and His Initiative Gone, Too\nGrassroots Movement Far More Genuine and<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nEffective In Forcing Change\nFour years after Bill Clinton swooped into earthquake-devastated Haiti with can-do promises and billions of dollars at his disposal to “build back better,” Haitians rate his leadership and performance as the point man on the internationally backed rebuilding effort an epic fail and want him gone.\n<br />\nThey contend that Clinton has become a major player in the corrupt, anti-democratic political and economic system Haitians have been fighting against for decades under various regimes that is central to the oppression and misery of the Haitian people.\n<br />\nVeteran journalist Kim Ives, an editor with Haïti Liberté, a news weekly serving the Haitian diaspora, discusses Haitians’ no-confidence opinion of Clinton and the contentious political backdrop, in Haiti and the United States, against which the routing of the ex-president is unfolding.\n<br />\n \nOngoing protests against the grand jury decisions in the police-involved killings of Michael Brown and Eric Garner are powerful expressions of people-driven leadership that has served notice–on systems of government and establishment-accommodating organizations—that it’s a new day.\n<br />\nLeid Stories in a commentary discusses why this is a significant achievement and why it should be the start of a massive, interdependent—but locally independent, focused and controlled—people-centered network. <br />\n  <br /></p>\n"
}
