{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-031915-1426870020/",
    "podcast": {
      "developer-note": "",
      "length": "58:13",
      "note": "",
      "size": 20961590,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/kpa96e/GaryNullShow_WBAI031915_032015.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Mon, 23 Mar 2015 17:00:00 +0000",
        "timestamp": "1427148000"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2015-03-20 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The power and control of secretive autonomous and unaccountable national security elites over the nation’s<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\ndecision-making regarding war and peace, with Scott Horton.\n<br />\nDr Scott Horton is an attorney and contributing editor for Harper’s Magazine and lectures at Columbia University Law School with a focus on national security issues, armed conflict, human rights and international law. <br />\nHe is the recipient of the National Magazine Award and continues to practice law privately. <br />\nDr Horton has been a lifetime human rights advocate and served legal the counsel for Andrei Sakharov, Elena Bonner and other human rights activists in the former Soviet Union. <br />\nHe is the former president of the International League for Human Rights and co-founder of the American University in Central Asia. <br />\nHe is the author of several books, his most recently published volume is “Lords of Secrecy: The National Security Elite and America’s Stealth Warfare,” which explores in great depth how government secrecy today assures that decisions about war and peace are not part of American democracy but decided by autonomous and unaccountable national security elites. <br />\nHis investigative reports can be read on Harpers at Harpers.org<br /></p>\n"
}
