{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-%e2%80%98troika-v-greece-debt-negotiations-week-one%e2%80%99-%e2%80%93-020615/",
    "podcast": {
      "developer-note": "",
      "length": "59:24",
      "note": "",
      "size": 21385296,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/x2nz64/AlternativeVisions_020715.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Troika v. Greece Debt Negotiations, Week One’"
  },
  "title": "Troika v. Greece Debt Negotiations, Week One’",
  "date": "2015-02-07 00:00:00 -0500",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>‘Jack Rasmus provides a recount of negotiations between Greece’s Syriza party and new government with northern Euro<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nbankers, the ECB, and Euro Commission in Brussels during the past week.  What’s at stake for the Troika (ECB, IMF, and European Commission) in the current negotiations and why they are playing ‘hard ball’ during the first week of negotations.  Greek president, Tsipras and Greek finance minister, Yani Varoufakis’, tours of European capitals last week and the outcome of their meetings is discussed.<br />\n  Tsipras’ modest successes talking to France and Italy politicians, Renzi and Holland. <br />\nVaroufakis’ less than productive meetings with European Central Bank chair, Mario Draghi, on Feb. <br />\n4, and German finance minister, Wolfgang Schauebel on Feb. <br />\n5. <br />\nDraghi’s refusal to continue providing ECB loans to Greek banks as a punishment for Greek refusal to simply extend the bailout program as is with austerity past Feb. <br />\n28. <br />\nSchaubel’s refusal to agree to any changes.<br />\n  Syriza’s strategy: lift austerity first and discuss debt over next several months; Troika strategy: continue austerity first, agree tp extend bailout, and then discuss changes—maybe. <br />\nPotential for a run on Greek private banks if Greece’s central bank runs out of money to lend its banks. <br />\nThat will mean Greek exit, and unleash many unknowns for Greece, the Euro and Eurozone future. <br />\n(Read Dr Rasmus latest published article on the topic on the PRN website).  Next week: the ‘Dud’ (part 3 of ‘The Bomb, the Fuse, and the Dud’ series).<br />\n  What’s the Dud? <br />\nTune in and find out on Feb. <br />\n14’s show.\n<br /></p>\n"
}
