{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-061913/",
    "podcast": {
      "developer-note": "",
      "length": "55:02",
      "note": "",
      "size": 13212254,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/qedv32/GaryNullShow_55_061913.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-06-19 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>What evidence have former intelligence whistleblowers given us of NSA spying and surveillance of Americans phones,<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nemails, internet activities, with Stephen Kohn.\n<br />\nThe Obama administration’s military posturing against Syria and its support of jihadist Syrian rebel organizations, with Stephen Zunes.\n<br />\nStephen Kohn is one of the nation’s leading advocates for corporate and government whistleblowers and has a long record spanning over 25 years of court victories on behalf of individuals bringing the truth to the public about corruption, fraud and misdemeanors. <br />\nHe is the Executive Director of the National Whistleblower Center in Washington and a Trustee of the National Whistleblower Legal Defense and Education Fund. <br />\nStephen has testified in Congress and counseled the Senate Judiciary to protect whistleblower well being. <br />\nHe is the author of the first legal treatise on whistleblower back in 1985 and has since published numerous articles and books. <br />\nHis website is www.Whistleblowers.<br />\norg\nProf. <br />\nStephen Zunes is a Professor of Politics and International Studies at the University of San Francisco, where he chairs the program in Middle Eastern Studies. <br />\nHe is recognized as one the country’s leading scholars of US Middle East policy and of strategic nonviolent action, Professor Zunes received his PhD. <br />\nfrom Cornell University and previously served on the faculty of Ithaca College, the University of Puget Sound, and Whitman College. <br />\nHe serves as a senior policy analyst for the Foreign Policy in Focus project of the Institute for Policy Studies, an associate editor of Peace Review, a contributing editor of Tikkun, and chair of the academic advisory committee for the International Center on Nonviolent Conflict. <br />\nAmong his publications, the most recent is “Western Sahara: War, Nationalism and Conflict Irresolution” His website is www.StephenZunes.org\n<br /></p>\n"
}
