{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-pcos-%e2%80%93-polycystic-ovary-syndrome-natural-interventions-080514/",
    "podcast": {
      "developer-note": "",
      "length": "53:35",
      "note": "",
      "size": 19295928,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/dtkb6s/NaturalNurse_080514.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "PCOSPolycystic Ovary Syndrome- Natural Interventions"
  },
  "title": "PCOSPolycystic Ovary Syndrome- Natural Interventions",
  "date": "2014-08-05 00:00:00 -0400",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Ellen Kamhi, PhD, RN, www.naturalnurse.com, interviews Rebecca Murray APRN, FNP, CDE .\n&lt;!--more--&gt;\nRebecca  is a board certified Family Nurse Practitioner for over 28 years who  specializes in the “Integrative Approach” to the prevention, evaluation and treatment of medical problems.  After graduating from ColumbiaUniversity and spending 12 years in “critical care medicine”, observing “first hand” the ravages of chronic disease states the “could have been prevented”, she decided to obtain her Master’s Degree in Primary Health Care as an Advanced Practice Registered Nurse (APRN) in order practice true “preventative medicine”.<br />\n  Her areas of focus and specialty include: Metabolic Syndrome/Insulin Resistance, obesity/weight management, evaluation/management and prevention of diabetes, hormonal imbalances/PCOS, risk reduction of estrogen-related cancers, and “medical nutrition therapy” for multiple health related problems.\n<br />\n \nShe is an Assistant Clinical Professor of Nursing at YaleUniversity (Adjunct Faculty), is a preceptor for Yale University FNP students at the West SideSchoolBasedHealthCenter, and has her own private practice in Groton, CT specializing in Holistic and Integrative Medicine.  She has written numerous articles in peer-reviewed medical journals, and serves many task forces that focus on the growing epidemic of childhood and adult obesity.<br />\n  She speaks locally and nationally at professional conferences on the use of nutritional approaches to the prevention and treatment of numerous chronic health conditions. <br />\nShe views herself as a “perpetual student” as EVERYDAY there is more to learn that can help us as practitioners to optimize the health of our patients.<br /></p>\n"
}
