{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-060112/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:1",
      "note": "",
      "size": 14440803,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/4mic28/GaryNullShow060112.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-06-01 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Secretive activities of the School of Americas during Obama’s term and attempts to cease its operations\nFather Roy<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nBourgeois is a priest of the Maryknoll Order of the Catholic Church and is the leading activist founder of the human rights groups School of the America’s Watch in Washington DC. <br />\n He is veteran of the Vietnam era having received a Purple Heart and since 1972 he has worked on behalf of the poor in Latin American countries under martial dictatorships. <br />\nDuring that time he became an outspoken critic of US foreign policy in Latin America and spent over four years in US federal prisons for non-violent protests. <br />\nIN 1990, Father Roy founded the School of America’s Watch which has now been renamed the Western Hemisphere Institute for Security Cooperation, headquarted at Fort Benning Georgia – a secretive school that trains hundreds of Latin American soldiers, police and officers in combat skills – all paid for by the US taxpayer.\n<br />\nFather Roy’s many protests and accomplishments are too numerous to recount. <br />\n Yet among his many awards are the Gandhi Peace Award, the Thomas Merton Award and the Pax Christi USA Pope Paul the Sixth Teacher of Peace Award.\n<br /></p>\n"
}
