{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg"
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-current-topics-in-herbal-medicine-041514/",
    "podcast": {
      "developer-note": "",
      "length": "53:17",
      "note": "",
      "size": 12791850,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/tvinz7/NaturalNurse041514.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "Current Topics in Herbal Medicine"
  },
  "title": "Current Topics in Herbal Medicine",
  "date": "2014-04-15 00:00:00 -0600",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Ellen Kamhi, PhD, RN, www.naturalnurse.com, interviews Ric Scalzo, one of North America’s most  respected herbalists<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nand botanical researchers, with more than 25 years of clinical and practical experience with herbal medicines.<br />\n  After studying herbal medicine at the School of Natural Healing under Dr John Christopher, Ric practiced as a clinical herbalist in New England. <br />\nHe regularly teaches herbal classes, interfaces with the media, and lectures nationally on herbal topics. <br />\nRic Scalzo is the co-author of Herbal Solutions for Healthy Living, a groundbreaking herbal repertory and therapeutic dispensatory guide to the safe and effective use of medicinal herbs that has sold more than a quarter of a million copies. <br />\nHe also co-authored Traditional Medicines from the Earth, a compendium of formulations that are effective herbal solutions for healthy living, and is the publisher and contributing author of the Protocol Journal of Botanical Medicine. <br />\nIn addition, Ric is a lifelong student of Vedic philosophy and spiritual practices. <br />\nRic Scalzo holds an honorary Doctorate in Naturopathy from the Southwest College of Naturopathic Medicine in Tempe, Arizona, and received a Master Herbalist degree in 1982 from the School of Natural Healing. <br />\nRic also founded Gaia Herbal Research Institute, which, along with its publishing arm Herbal Research Publications, has contributed extensively to the quality and proliferation of herbal literacy in the United States. <br />\nContact:  http://gaiaherbs.com\n<br /></p>\n"
}
