{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-01-25-12/",
    "podcast": {
      "developer-note": "",
      "length": "59:27",
      "note": "",
      "size": 14270400,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/8iee3n/GaryNullShow012512.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-01-25 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guests: Dennis Loo and Lewis Richmond\nProf.\n&lt;!--more--&gt;\nDennis Loo is a professor of sociology at California Polytech University in Pomona California. <br />\n He has degrees from Harvard and University of California, and has been active water rights issues, government corruption and globalization. <br />\n His articles appear on World Cant Wait.<br />\nnet where he serves on the steering committee, Counterpunch and Opednews.\n<br />\nDennis has received important progressive awards for his writing, including the Project Censored Award, The Nation Magazine’s Most Valuable Campaign Award and others.\n<br />\nHis recent book, “Globalization and the Demolition of Society” which has been reviewed a hard hitting, powerful indictment of neoliberalism and its catastrophic effects on the essential fabric of society, equality and democracy.\n<br />\nLewis Richmond is a Zen priest, meditation teacher and lineage holder who was ordained by the renowned Japanese Zen master Shun-roo Suzuki. <br />\nLew started his practice in 1967 and trained at Tassa-hara Monastery and the Green Gulch Zen Temple for fifteen years. <br />\n He is currently the head of Vimala Sangha (Vee-malah  Sanga) meditation center in Mill Valley, California. <br />\n Earlier Lew was a software entrepreneur, former Executive Vice President of Smith and Hawken firm and the founding owner of Forerunner Systems, a leading provider of inventory management software.\n<br />\nHe is the author of several books including “Work as a Spiritual Practice” and “A Whole Life’s Work”\nHis most recent book just published is “Aging as a Spiritual Practice: A Contemplative Guide to Growing Older and Wiser”\n<br /></p>\n"
}
