{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/november-29-2010/",
    "podcast": {
      "developer-note": "",
      "length": "54:01",
      "note": "",
      "size": 12966912,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/icbtn8/NaturalNurse112910.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "November 29, 2010"
  },
  "title": "November 29, 2010",
  "date": "2010-11-29 00:00:00 -0500",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Host Ellen Kamhi PhD RN, www.naturalnurse.com , interviews Wendell Potter.\n&lt;!--more--&gt;\nWendell Potter is a senior analyst at the Center for Public Integrity, the senior fellow on health care at the Center for Media and Democracy, a highlighted contributor for the Huffington Post, and a leading critic of the health insurance industry. <br />\nAfter a thirty-year career in public relations, he left his job as a corporate PR executive to speak out against what he had seen and been a part of during his years in the health insurance industry. <br />\nSince he walked away as head of communications at a top health insurance company in May of 2008, he has worked tirelessly as an outspoken critic of corporate PR and the distortion and fear manufactured by America’s health insurance industry. <br />\nIt is a PR juggernaut that is bankrolled by millions of dollars, rivaling lobbying budgets and underwriting many “non-partisan” and “grassroots” organizations. <br />\nWendell has appeared on countless television and radio programs and been quoted in newspapers and magazines around the world. <br />\nTime magazine wrote that Potter “may be the ideal whistleblower.” Today, we will discuss Wendell Potter’s new book, DEADLY SPIN\nAn Insurance Company Insider Speaks Out on How Corporate PR Is Killing Health Care and Deceiving Americans For more information, please visit www.WendellPotter.<br />\ncom.\n<br /></p>\n"
}
