{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-062314/",
    "podcast": {
      "developer-note": "",
      "length": "56:02",
      "note": "",
      "size": 13451584,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/gtf3sh/BAR_062314.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-06-23 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>“Broad Social Movement” Confronts Philadelphia’s Temple University\n </p>\n\n<p>Protests against the firing of Temple<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nUniversity African American Studies professor Anthony Monteiro have evolved into a “broad united front” of students, grassroots community forces, organized labor and elected officials. <br />\n“Black Philadelphia, in particular, understands that Temple University is not only gentrifying the community, but is hyper-policing the community,” creating “an island of privilege in a city of poverty,” said Dr Monteiro. <br />\n“All that was necessary was for someone to stand up and say that this powerful institution must be made answerable to the community.<br />\n”</p>\n\n<p>CIA Plays Both Sides in Iraq\n </p>\n\n<p>“The CIA has a long history of being on both sides of conflicts that we later sacrifice a great deal to address,” said Shahid Buttar, executive director of the Bill of Rights Defense Committee. <br />\nThe jihadist fighters of ISIS, currently on the offensive in Iraq, have benefited from US and allied support for regime change in Syria. <br />\nIn the past, the CIA “trained the precursor of al Qaida in Afghanistan” and supported Saddam Hussein’s government in Iraq. <br />\nButtar, a constitutional lawyer, has produced a video titled “NSA vs USA,” a “hip hop history lesson set to music.<br />\n”</p>\n\n<p>Massachusetts to Have Highest State Minimum Wage\n </p>\n\n<p>The Massachusetts state legislature has passed, and the governor is certain to sign, a bill to raise the minimum wage from $8 to $11 over three years – the highest state minimum in the country. <br />\nLew Finfer, director of the Massachusetts Community Action Network, credits the victory to a “broad coalition” of faith-based, community and labor organizations that collected over 200,000 signatures to put the wage hike on the ballot, this fall. <br />\nThe threat of a referendum worked. <br />\n“Had we not gotten the signatures,” the legislature “would not have passed a bill or would have passed much less of a wage increase,” said Finfer.\n<br /></p>\n\n<p>Petition to Block Ugandan from UN Post\n </p>\n\n<p>Sam Kutesa, Uganda’s Foreign Minister, is unfit to assume the presidency of the United Nations General Assembly, according to a petition circulating on Change.<br />\norg. <br />\nKutesa is engaged in massive corruption and theft of public funds, war-profiteering in South Sudan, and is complicit in Uganda’s genocidal crimes against the Democratic Republic of Congo, said Milton Allimadi, publisher of the New York-based Black Star News. <br />\n“He diminishes the legacy and the name of other Africans who have served as president of the UN General Assembly, and should resign.<br />\n” Kutesa was elected to the UN post without opposition.\n<br /></p>\n\n<p>Syrian Election Shows People’s Determination\n </p>\n\n<p>The recent elections in war-torn Syria, which President Bashar al-Assad won handily, were a demonstration of the Syrian people’s determination to prevail against western and jihadist “terror,” said Paul Larudee, part of an international team of election observers. <br />\nThe US and Israel are intent on sowing “eternal conflict and death and destruction” in the region. <br />\nHowever, “I don’t think [the Syrians] are going to lose this war,” said Larudee, a member of the International Palestine Solidarity Network. <br />\n“They’re absolutely determined.”</p>\n\n<p><br /></p>\n"
}
