{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-071414/",
    "podcast": {
      "developer-note": "",
      "length": "52:01",
      "note": "",
      "size": 12487889,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/mycf2z/LeidStories_071414.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-07-14 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Detroit Bankruptcy: As Pension-Plan Vote Nears, New Woes Beset City\nThe World Cup: What The Mega Event Proved Beyond A<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nShadow of Doubt\nA July 21 deadline looms over Detroit’s bankruptcy-restructuring plan. <br />\nBy that date, the city must show a federal court judge not only that a majority of 32,000 retirees and current and former city workers have voted “yes” on mailed-out ballots to cut their pensions by 4.<br />\n5 percent and forego cost-of-living allowances, but that their votes represent at least two-thirds of the amount owed to workers from uniformed and civilian city sectors.\n<br />\nAbayomi Azikiwe, editor of Pan-African News Wire, brings us up to speed on where state-appointed city manager Kevyn Orr stands with his press for a “yes” vote; “grand bargain” concessions some unions have made to speed up settlements with their memberships; and a rise in the misery index as the city cuts essential services to poor Detroiters.\n<br />\nThe 20th edition of the World Cup, soccer’s international tournament of champions held every four years, ended yesterday in Rio de Janeiro with Germany clinching the title against Argentina.  \nGilbert Mercier, cofounder and editor in chief of News Junkie Post, who presented World Cup 2014 as a metaphor for the social, political and economic crises and contradictions plaguing Brazil and many other countries represented at the World Cup (June 12 podcast), returns to Leid Stories with the final score on a list of things the mega event proved beyond a shadow of doubt.<br /></p>\n"
}
