{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-012113/",
    "podcast": {
      "developer-note": "",
      "length": "56:48",
      "note": "",
      "size": 13632394,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/js6k/BAR012113.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2013-01-21 00:00:00 -0700",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Black and Brown Schools Already Over-Policed\n“When we look at whose schools are policed and which students have to go<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nthrough metal detectors, get pad-downs, get drug-searched on a routine basis, it’s our students of color and our communities of color across this country,” said Matthew Cregor, of the NAACP Legal Defense and Education Fund. <br />\nThe Newtown, Connecticut, massacre has led to renewed calls for an increased police presence in schools. <br />\nHowever, what inner city students need are more social workers, psychologists and counselors, and teaching resources, said Cregor.\n<br />\nSavage School Inequalities Intensify\n“Our schools are more segregated and less equal than they were in 1968, when Dr King was taken from us,” said Jonathan Kozol, the educator, activist and author. <br />\n“This kind of inequality is a theological abomination, a crime against the least of us,” said Kozol, author of the 1991 classic Savage Inequalities: Children in America’s Schools. <br />\nHe was interviewed on public radio’s Smiley &amp; West show.\n<br />\nObama “Co-Conspirator” in Austerity Schemes\n“Austerity is, essentially, shifting of the burden of the economic depression from those who created it onto the working class and the poor,” said activist Eric Draitser, who has been organizing anti-austerity forums. <br />\n“This is a concerted attack by financiers and the ruling class against the legacy of the New Deal.” President Obama is “a co-conspirator and collaborator with these austerity schemes.” Draitser is publisher of the web site StopImperialism.<br />\ncom.\n<br />\nMLK vs. <br />\nObama\nBarack Obama and Dr Martin Luther King, Jr. <br />\nhave nothing in common, politically, according to Omali Yeshitela, chairman of the Black Is Back Coalition for Social Justice, Peace and Reparations. <br />\n“The only connection they would have in the real world be that Dr King would be leading the demonstrations against the Obama regime, if he were alive,” said Yeshitela. <br />\nObama has “extended the war machine beyond anything in recent memory.<br />\n”\nLynn Stewart’s Cancer Spreads\nHuman rights lawyer Lynn Stewart, serving ten years in a Fort Worth, Texas, prison for her zealous defense of an accused terrorist client, has suffered a relapse of cancer. <br />\n“It has spread to her other lung and to parts of her back,” said Stewart’s husband, Ralph Poynter, speaking on the radio program Taking Aim. <br />\nPrison regulations prevent Stewart from obtaining the care she needs. <br />\n“We feel that it is a death sentence,” said Poynter.\n<br />\nHappy Birthday to Ramsey Clark and Dr King, from Mumia\nIf MLK were alive, he would be 84 years old, a year younger than former US Attorney General Ramsey Clark, whose birthday was recently celebrated at New York City’s historic Riverside Church, along with the 20th anniversary of the International Action Center. <br />\nDr King “would be with the people, with the IAC, with Ramsey Clark, at Riverside,” said political prisoner Mumia Abu Jamal in a message recorded for the event.\n<br /></p>\n"
}
