{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-112514/",
    "podcast": {
      "developer-note": "",
      "length": "55:01",
      "note": "",
      "size": 19811333,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/bcisn3/PCH112514.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-11-26 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Prof.\n<!--more-->\nMichael Antoniou is a Reader in Molecular Genetics and Head of the Nuclear Biology and the Gene Expression groups at King’s College London School of Medicine, where he has been teaching since 1994. <br />\nHe is also a member of the school’s Genetic Modification Safety Committee. <br />\nIn 2006, he was elected to the executive board of the British Society for Gene Therapy.<br />\n  Dr Antoniou has been an international figure in the scientific community challenging the assumed safety of GMOs and genetic engineering. <br />\nHe is a coauthor with Claire Robinson of a volume of scientific documentation and analysis debunking GMO myths entitled “GMO Myths and Truths,” and has published many research papers in peer-reviewed journals.<br />\n  He attended the University of Oxford and has a doctorate in biochemistry from the University of Reading in the UK, and later worked as a post-doctoral research fellow in the Tumor Biology Laboratory at the University of Nebraska.\n<br />\nClaire Robinson is the research director at Earth Open Source, a nonprofit organization dedicated to assuring the sustainability, security and safety of the global food system.<br />\n  She has been a long time food activist who has challenged the use of pesticides, artificial fertilizers and genetically modified organisms or GMOs in agriculture based upon scientific grounds. <br />\nShe is also a managing editor and co-founder of GM Watch in the UK, founded in 1998 with a mission to challenge Big Ag’s biotech corporate power and propaganda through daily newsletters and campaign activities. <br />\nClaire is the co-author of “GMO Myths and Truths” – a science based book that deconstructs the myths used by the GMO lobby to sell GM crops to the public and farmers. You can download “GMO Myths and Truths” free at EarthOpenSource.org, and receive the latest information about GMOs from GMWatch.org <br /></p>\n"
}
