{
  "header": {
    "category": "the-wake-up-call",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/276914/Richard_Martin_AlbumArt2.jpg"
    },
    "layout": "podcast",
    "link": "http://thewakeupcall.podbean.com/e/wake-up-call-the-internet-per-se-does-not-contribute-to-the-economy-040714/",
    "podcast": {
      "developer-note": "",
      "length": "55:4",
      "note": "",
      "size": 13361110,
      "type": "audio/mpeg",
      "url": "http://thewakeupcall.podbean.com/mf/feed/4wxfkh/WakeUpCall_040714.mp3"
    },
    "show": {
      "category": [
        "Business",
        "Investing"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/276914/Richard_Martin_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 23 Feb 2015 21:03:15 +0000",
        "timestamp": "1424743395"
      },
      "subtitle": "Your Economic Survival?  They're Not Looking Out For You.  We are.",
      "title": "The Wake Up Call"
    },
    "tags": [
      "Business",
      "Investing",
      "the-wake-up-call"
    ],
    "title": "The Internet, Per Se, Does Not Contribute To the Economy"
  },
  "title": "The Internet, Per Se, Does Not Contribute To the Economy",
  "date": "2014-04-07 00:00:00 -0600",
  "categories": [
    "the-wake-up-call"
  ],
  "content": "<p>The current internet boom is a chimera. It is mostly about redistributing existing demand from offline to online.\n&lt;!--more--&gt;\nIt won’t inflict damage because the amount of financing required to support it is minimal but it offers false hope that it can revive economies. <br />\nBitcoin is the poster child of the Internet fantasy. <br />\nNo internet activity changes the production machine behind goods and services. <br />\nOnly new ones can move the economy forward. <br />\nStock market report: margin debt. <br />\nRichard Duncan talking about the stock market. <br />\nNigeria’s accounting legerdemain increased the size of its GDP by 89% over the weekend! <br />\nThe European Central Bank is also engaged in funny tricks to create most of its profits. <br />\nThe US does exactly the same thing. <br />\nA brief comment on my theme-of-the-year: War with China. <br />\nThe NSA’s data collection is just plain ineffective. <br />\nThe US government can’t possibly use all the information it collects. <br />\nUS interest payments are growing monstrously, now comprising a quarter of total tax takings! <br />\nPrivate equity and hedge funds are now reducing dramatically their purchases of real estate, in line with my own predictions. <br />\nPurchasers for Obamacare have signed up for unsustainably cheap medical insurance. <br />\nThey will incur far more in medical costs than they will pay in premiums. <br />\nInsurance companies will have to be bailed out. <br />\nYou’ll see… You heard it here first!\n<br /></p>\n"
}
