{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-111214/",
    "podcast": {
      "developer-note": "",
      "length": "54:3",
      "note": "",
      "size": 19624035,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/6ami9q/LeidStories_111214.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-11-12 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Governor Militarizes, Sharpton Mitigates, Ahead of Grand Jury Decision\nObama Picks Up Speed.\n&lt;!--more--&gt;\nLike All Things Going Downhill?\n<br />\nGov. <br />\nJay Nixon of Missouri yesterday left no doubt that the City of Ferguson will be re-militarized upon the announcement of the grand jury’s decision whether to indict Police Officer Darren Wilson for killing Michael Brown. <br />\nHe announced at a news conference that, whatever the grand jury’s decision, there’ll be more than enough law-enforcement personnel on hand, including the National Guard, to “safeguard safety and speech.<br />\n”\nThe Rev. <br />\nAl Sharpton did some pre-emptive PR of his own, firing off a news release blaming Nixon for mishandling the protests after Brown’s death and for not appointing a special prosecutor in the case—which, as Leid Stories repeatedly pointed out, neither Sharpton nor the lawyers handling the case had called for.\n<br />\n \nThe thorough thrashing that the other wing of the flightless governmental bird handed President Barack Obama on Nov. <br />\n4 seems not to be slowing him down. <br />\nIndeed, since the beatdown the president’s been a man on the move, determined to get things done, even if all by himself.\n<br />\nObama’s new burst of energy over immigration, net neutrality, the war against ISIS (and Iraq and Syria), Ebola, the Trans-Pacific Partnership/Asia “pivot” and other long-simmering issues belies the fact that he seems to be following his old script, both in terms of focus and method. <br />\nThis new speed of his, is it the kind that happens when going downhill?<br /></p>\n"
}
