{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-021915/",
    "podcast": {
      "developer-note": "",
      "length": "59:42",
      "note": "",
      "size": 21494462,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/p4vnjg/GaryNullShow_021915.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Fri, 27 Feb 2015 18:17:59 +0000",
        "timestamp": "1425079079"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2015-02-19 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Documentary – Trace Amounts – on history of thimerosal and the government government’s coverup on its relationship to<span class=\"ellipsis\">…</span>\n<!--more-->\nautism\n- Eric Gladen is the director of the recently released documentary Trace Amounts – a film 10 years in the making that deeply explores the many scientific and politicized medical controversies associated with the relationship between the mercury compound thimerosal found in vaccines and the epidemic rise in autism and other neurological disorders.  In 2004, after receiving a tetanus shot containing thimerosal, Eric’s life completely changed with the onset of a cascade of adverse physical, neurological and mental symptoms following the vaccine.  For the next decade, Eric researched the autism’s “causes” associated with vaccine ingredients and traveled the country to interview and film scientists and individuals questioning the safety of vaccine ingredients to produce this documentary.  Eric has an engineering degree from Oregon State University and his website is TraceAmounts.<br />\ncom\nThe science behind thimerosal and autism</p>\n\n<ul>\n  <li>David Geier is the Vice-President of the non-profit Institute of Chronic Illnesses, Inc and the Vice-President of the non-profit Coalition for Mercury-free Drugs. <br />\nHe has extensive experience as a medical research scientist and has co-authored over 100 peer-reviewed scientific/medical journal articles, book chapters, and other publications. <br />\nFifty of his studies examined the safety of such vaccines as hepatitis B, DPT, HPV, the MMR, Lymes, Hib, and polio.<br />\n  An additional 25 studies investigated the safety of the mercury compound Thimerosal. <br />\nIn recognition of his scientific research, David has been invited to present at numerous professional conferences around the world, including giving presentations to the Institute of Medicine of the US National Academy of Sciences. <br />\nHis scientific research includes the study of vaccine safety, autism and other childhood neurodevelopmental disorders, toxicology, and molecular biological mechanisms.  David is a biology graduate of UMBC and also studied vaccine science, immunology and epidemiology at the NIH’s Foundation for Advanced Education in the Sciences. His website is MercuryFreeBaby.org</li>\n</ul>\n\n<p><br /></p>\n"
}
