{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-012015/",
    "podcast": {
      "developer-note": "",
      "length": "53:09",
      "note": "",
      "size": 19137374,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/3dujsf/NaturalNurse_012015.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "The Natural Nurse"
  },
  "title": "The Natural Nurse",
  "date": "2015-01-20 00:00:00 -0500",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>James B.\n<!--more-->\nLaValle, R.Ph., CCN.<br />\n, is an internationally recognized clinical pharmacist, author, and board certified clinical nutritionist, naturopathic doctorate, with more than 30 years of clinical experience. <br />\nLaValle is best known for his expertise in metabolic and integrative medicine, with extensive background in natural products, lifestyle drug/nutrient depletion, and uncovering the underlying metabolic issues that keep people from feeling healthy and vital. <br />\nHe has developed health programs for the fitness industry, professional sports teams and healthcare companies.\n<br />\nLaValle gained national recognition as Clinician of the Year in 2012 by the Natural Products Association for his pioneering work in furthering the professional standards of integrative care. <br />\nHe is an appointed faculty member and course director for the Integrative Medicine postgraduate program at George Washington University School of Medicine. <br />\nHe has trained thousands of healthcare professionals on the value of predictive health and modeling healthcare practices to incorporate lifestyle, diet and natural therapies as part of the health equation for Americans.\n<br />\nLaValle is author of more than 20 books including, “Cracking the Metabolic Code,” “Nutritional Cost of Drugs,” and his latest book, “Your Blood Never Lies.<br />\n” He was named one of the “50 Most Influential Pharmacists” by American Druggist magazine and was one of nine Americans selected to participate in the inaugural Dietary Supplement Education Alliance &amp; Dietary Supplement Information Bureau. <br />\nPreviously he was a correspondent on ESPN2’s No. <br />\n1 rated “BodyShaping” fitness program.\n<br />\nContact: Jim LaValle at: http://jimlavalle.<br />\ncom/. <br />\nFollow him on Twitter: @JimLaValle or https://www.facebook.com/pages/Jim-LaValle/169566756447190. <br /></p>\n"
}
