{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-072114/",
    "podcast": {
      "developer-note": "",
      "length": "54:47",
      "note": "",
      "size": 13151237,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/9q4je5/BAR072114.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-07-21 00:00:00 -0600",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>McKinney: West Condemns Whole Regions to Death\n </p>\n\n<p>“What we are witnessing” in Syria and Iraq “is a process, a way to<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\napply the death penalty to countries and make it appear to be a domestic, civil conflict,” said former Georgia Congresswoman Cynthia McKinney. <br />\nThe same US and Israeli-led process of undermining nations has already dismembered Sudan and destroyed Libya and “will spread to Jordan and Iran,” said McKinney, who served on the defense and foreign relations committees of the House before leaving Congress in 2007.\n<br /></p>\n\n<p>US Founded in Slavery and Genocide – But Don’t Tell Obama\n </p>\n\n<p>Gerald Horne’s recent book The Counter-Revolution of 1776 “shows how slavery is very much at the heart and core, the driving force behind the decision to break off” from Great Britain, said historian, author and political analyst Paul Street. <br />\nHorne maintains the Founding Fathers feared Britain might abolish slavery and limit white settler land-grabs. <br />\nYet, President Obama maintains that racism is not endemic in the United States. <br />\n“Nothing will stop Obama from trying to please white folks,” said Street, author of The Empire’s New Clothes: Barack Obama and the Real World of Power. <br />\n“I don’t know if he believes this [American historical mythology] crap, or whether he’s being cynical – and I’m not sure it matters.<br />\n”</p>\n\n<p>Mumia: California Death Penalty Unconstitutional?\n<br />\n </p>\n\n<p>Death rows could begin to empty in California, where a federal district court has found the ultimate penalty is administered so arbitrarily it amounts to cruel and unusual punishment. <br />\n“I, like few reporters today, know a little something about death row,” said political prisoner Mumia Abu Jamal, “since I spend almost 30 years on it.<br />\n”</p>\n\n<p>Banksters Demand Black Removal as a Condition of Urban Investment\n </p>\n\n<p>“Katrina left no doubt about the intentions of the folks who run this country, the financial class,” said BAR executive editor Glen Ford, speaking at a Socialist Action forum in Hartford, Connecticut. <br />\n“The goal is to drastically reduce the Black populations of the cities,” because “the very presence of large numbers of Black people depresses the value of urban assets.<br />\n” The mayor of Hartford, a mostly Black and Latino city, wants to build a $60 million baseball stadium as a centerpiece of development. <br />\nHowever, such schemes are ultimately intended to bring in whites and displace Blacks and browns, as a “prerequisite” for substantial corporation investment in the future, said Ford, at Urban Hope Refuge Church.\n<br /></p>\n\n<p><br /></p>\n"
}
