{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-011813/",
    "podcast": {
      "developer-note": "",
      "length": "59:29",
      "note": "",
      "size": 14279889,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/jbr6ej/GaryNullShow011813.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-01-18 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nSherri Tenpenny, addressing the American College of Physicians recommending a longer battery of vaccines for all health care workers\nAlso, a challenge to the mantra that green capitalism and eco-capitalism is a solution to climate change and its failures, with Heather Rogers.\n<br />\nDr Sherri Tenpenny is an osteopathic medical physician who incorporates integrative medicine in her practice for treating allergies, childhood illnesses and women’s health issues. <br />\nShe is also one of the country’s most knowledgeable and outspoken physicians opposing the efficacy and safety of vaccines. <br />\n She is the founder and lead medical practitioner of the Tenpenny Integrative Medical Center in Strongsville, Ohio.\n<br />\nShe has authored several books on vaccines including, “Fowl: Bird Flu, It is Not What You Think” and “Saying No to Vaccines: A Resource Guide for All Ages”, and her recent DVD – “Flu and Flu Vaccines: What’s Coming Through That Needle” is an invaluable resource for educating people on influenza and the flu vaccines. <br />\n Her website is www.DrTenpenny.com\nShe recommends that people visit the Vaccine Research Library website – www.VaccineReseachLibrary.<br />\ncom which as over 4500 articles from conventional medical literature documenting the problems associated with vaccines.\n<br />\nHeather Rogers is journalist, filmmaker and a senior staff reporter at Remapping Debate, an investigative reporting news site sponsored by the Anti-Discrimination Center with a mission to introduce alternative views to conventional public policy issues and who is and is not being served by policy decisions. <br />\n Heather has also written for other publications including the New York Times Magazine, Mother Jones, Utne Reader, and the Nation. <br />\nShe has recent a couple books, the most recent being “Green Going Wrong:  Dispatches from the Front-Lines of Eco-Capitalism” – a journey traversing many countries around the world to challenge the capitalist mantra that “going and buying green” is the way to solve the challenges from climate change.\n<br /></p>\n"
}
