{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-020813/",
    "podcast": {
      "developer-note": "",
      "length": "1:06:55",
      "note": "",
      "size": 16063634,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/yttf4n/GaryNullShow020813.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-02-08 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>A look at the future of religion and the coming of an interspiritual age, with Dr. Kurt Johnson.\n&lt;!--more--&gt;\nAnd, a NEWSMAKER: Commentary on the Senate hearings on John Brennan to head the CIA with Shahid Buttar. <br /></p>\n\n<p>Dr Kurt Johnson has lived a dual life both as a Christian monk who has been immersed in comparative religion and also as a scientist – an entomologist (specializing in butterflies) and evolutionary biologist. <br />\n For over two decades with the Museum of Natural History, Kurt published over 200 science papers and several books. <br />\n IN his spiritual life, he has been ordained both in the Anglican Order of the Holy Cross and in the Hindu Advaitic (Add-vay-tick)  and was close associate of the remarkable Catholic monk Brother Wayne Teasdale, who is accredited with the development of interspiritual discourse between religions. <br />\nTogether Kurt and others founded the Interspiritual Dialogue in Action, an international association for sharing contemplative and mystical experience across religions.\n<br />\nHis recent book, co-authored with David Ord, is “The Coming  Interspiritual Age”, which is quickly turning into a classic text for putting spirituality and mystical experience, science of consciousness, globalization into our present historical moment and to look at how spirituality might change in the future and what role it could play in people’s lives.\n<br />\nShahid Buttar is the executive director of the Bill of Rights Defense Committee and the People’s Campaign for the Constitution which aims to defend civil liberties, constitutional rights and the rules of law threatened by the war on terror. <br />\n He received his JD degree from Stanford Law School and formerly was the chief editor of the Stanford Environmental Law Journal.\n<br />\nShahid also serves on the advisory bodies of the national Coalition to Protect Civil Freedoms, the national Campaign to Restore Civil Rights and the South Asian Americans Leading Together organizations. <br />\n His articles appear in the New York Times, USA Today al-Jazeera, Truthout.\n<br />\nShaheed attended yesterday’s Senate questioning of John Brennan – President Obama’s nomination to head up the CIA.\n<br /></p>\n"
}
