{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-more-on-obamacare-and-snowden-031114/",
    "podcast": {
      "developer-note": "",
      "length": "55:57",
      "note": "",
      "size": 13431850,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/u67q2n/LeidStories031114.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "More on Obamacare and Snowden"
  },
  "title": "More on Obamacare and Snowden",
  "date": "2014-03-12 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Obamacare: A Pain for Workers, Says Mega Union President;\nSnowden’s  ‘State-of-the-Internet’ at SXSW Gives A Puzzling<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nClue\nThe promise of the Affordable Care Act (Obamacare) may be well-intended—providing health care coverage to the uninsured and underinsured. <br />\nBut it’s a boondoggle of a program that’s hitting workers hard in the wallet, says our guest, Donald Taylor, president of Unite Here, a union representing 270,000 hospitality workers.\n<br />\nTaylor discusses major financial consequences for workers under the ACA that, he says, will widen and deepen income inequality in America. <br />\nAnd he’ll also explain why he’s publicly breaking with many major unions that harbor similar sentiments but are reluctant to criticize the president and Democratic Party over the very flawed ACA.\n<br />\nFugitive Edward Snowden in a teleconference from Russia yesterday told attendees at the South by Southwest Interactive Festival in Austin, Texas, that he remains convinced that public knowledge of the government’s violation of citizens’ privacy rights is worth his theft of classified National Security Agency files that exposed it.\n<br />\nBut in the course of a carefully managed interview with Ben Wizner, his legal counsel, and Wizner’s colleague at the ACLU, Chris Sogohian, Snowden made a startling statement that everyone missed. <br />\nLeid Stories tells what it is.<br /></p>\n"
}
