{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-021115/",
    "podcast": {
      "developer-note": "",
      "length": "57:58",
      "note": "",
      "size": 20868038,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/t25shu/LeidStories_021115.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2015-02-11 00:00:00 -0500",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>One Hand Clapping: The ‘Dialogue’ on American Apartheid\nFor decades now, practically every yardstick by which<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\n“progress” is measured in has pointed up a deeply embedded structural flaw. <br />\nThe National Advisory Commission on Civil Disorders, appointed by President Lyndon B Johnson in 1967 to probe the causes of urban rebellions that were occurring in major black cities at the time, warned in its 1968 report that the nation was “moving toward two societies—one black, one white, separate and unequal.<br />\n”\nJohnson’s “War on Poverty” campaign and its related programs attempted to attenuate the social, political and economic impact of the yawning divide. <br />\nVigorous black-led movements forced Johnson to concede that race oppression was widespread.\n<br />\nAlmost half a century later, American apartheid seems as entrenched and pervasive as it ever was, with only a few cosmetic changes. <br />\nThe only people calling attention to it, it seems, are those most directly affected.\n<br />\nLeid Stories asks: Does this mean that whites have no interest in dealing with the issue because they do not see themselves as being adversely affected? <br />\nIt is naïve of blacks to think that apartheid in America is a problem that society in general wants to solve? <br />\nIs American apartheid solvable?<br /></p>\n"
}
