{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/september-24-2010-part-2/",
    "podcast": {
      "developer-note": "",
      "length": "57",
      "note": "",
      "size": 13681728,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/hibaq/GaryNullShow092410Part2.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "September 24, 2010Part 2"
  },
  "title": "September 24, 2010Part 2",
  "date": "2010-09-24 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today’s guest is Dr.\n&lt;!--more--&gt;\nLawrence Palevsky and he is a board certified pediatrician who uses holistic approaches of pediatric medicine for children’s illnesses. <br />\nHe is the head of a private practice clinic Holistic Child Health in Northport, New York, where he has become renown for his treatment of children with autism, autistic spectrum disorders, child learning disabilities and neurological conditions resulting from chronic medication and potential vaccine damage. <br />\nHe is the past President of American Holistic Medical Association and the current President and co-founder of the Holisitic Pediatric Association. <br />\nDr Palevsky also sits on the advisory board of the National Vaccine Information Center, and is an expert in vaccine history and science.\n<br />\nAlso, we have Dr Sherri Tenpenny and she is an osteopathic medical physician who incorporates integrative medicine in her practice for treating allergies, childhood illnesses and women’s health issues. <br />\nShe is the executive director of Sanoviv Medical Institute – a progressive wellness hospital in Baja California. <br />\nShe is also one of the nation’s most knowledgeable and outspoken physicians regarding the adverse impact of vaccines on public health and their medical risks in children.\n<br /></p>\n"
}
