{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-market-manipulation-and-economic-corruption-021714/",
    "podcast": {
      "developer-note": "",
      "length": "59:11",
      "note": "",
      "size": 28411031,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/hpwit3/PCH021714_1sthr.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Market Manipulation And Economic Corruption"
  },
  "title": "Market Manipulation And Economic Corruption",
  "date": "2014-02-17 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Dr.\n<!--more-->\nPaul Craig Roberts is one of today’s most progressive political and economic writers and commentators on the state of the nation: governmental dysfunction, political corruption, global and domestic economic threats, the war on terror, Wall Street, and the decline in human values in American society.He was the chairman of the Institute for Political Economy and a former Assistant Secretary of Treasury during Reagan’s first term.<br />\n During his academic career he has taught at many universities and held the William Simon Chair in Political Economy at the Center for Strategic and International Studies at Georgetown University.\n<br />\nDr Roberts’ blog can be found at PaulCraigRoberts.org and he is a frequent contributor to Global Research, The Trends Journal, Counterpunch, and others.<br />\nHe was an associate editor at the Wall Street Journal and has published many books and articles during the past 40 years, his latest being “The Failure of Laissez Faire Capitalism,” with a new book coming on out later this year – “How America Was Lost: From 911 to the Police/Warfare State”\nDavid Kranzler is an investment advisor with over 23 years in the investment industry and is currently a managing member of a precious metals and mining investment fund in Denver. <br />\nIn the past Dave has worked in Goldman Sach’s securities division and spent nine years as an institutional junk bond trader at Bankers Trust, responsible for managing up to $200 million in risk based proprietary capital. <br />\nOver the years he has been a successful researcher, analyst and investor in mining stocks, gold and silver futures and bullion accumulation. Dave has a degree from Oberlin Collegte and an MBA in Finance from the University of Chicago. His analyses and comments on our financial system and economy have been published on various finance sites including Seeking Alpha and The Golden Report. Dave’s personal website and blog is the Golden Truth found at www.TruthInGold.blogspot.com<br /></p>\n"
}
