{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-gandhi-part-1-013014/",
    "podcast": {
      "developer-note": "",
      "length": "59:29",
      "note": "",
      "size": 14276822,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/xy52vr/GaryNullShow013014.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Gandhi Part 1"
  },
  "title": "Gandhi Part 1",
  "date": "2014-01-30 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>CONVERSATIONS WITH REMARKABLE MINDS\nCommemorating the work of Mahatma Gandhi on the 66th anniversary of his<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nassassination on January 30, 1948\nDr Vandana Shiva is an internationally renown environmental and social activist, and formerly a one of India’s top nuclear physicists. <br />\nShe is regarded as the leading pioneer behind India’s ecological and ecofeminism movement. <br />\nIn 1982 Dr Shiva founded the Research Foundation for Science, Technology and Ecology, which led to the creation of Navdanya – an organization dedicated to the restoration of organic farming across India and the preservation of indigenous knowledge and culture.\n<br />\nFor several decades, Vandana has fought for changes in the globalized practices of agriculture and food. <br />\nShe has traveled the world speaking against biopiracy and patenting of indigenous knowledge by large agricultural and pharmaceutical corporations. <br />\nHer activist efforts have created grassroots organizations throughout the developing world to counter genetic engineering of crops, as well as empower women throughout the third world.\n<br />\nDr Shiva has received numerous international awards, including the Alternative Nobel Prize (the Right Livelihood Award), the UNEP’s Global 500 Award and the UN’s Earth Day International Award.<br />\n \nAmong her more important books are “Earth Democracy: Justice, Sustainability and Peace”, “Manifestos on the Future of Food and Seed”, “Soil Not Oil” and most recently  “Making Peace with the Earth: Beyond Resource, Land and Food Wars”\nBorn in 1934 in Durban, South Africa, Arun Gandhi is the fifth grandson of India’s legendary leader, “Mahatma” Gandhi. <br />\nGrowing up under the discriminatory apartheid laws of South Africa, he was beaten by “white” South Africans for being too black and by “black” South Africans for being too white. <br />\nHis grandfather taught Arun to understand nonviolence through understanding violence.\n<br />\nFor 30 years Arun worked as a journalist for the Times of India and founded the Center for Social Change which has aided half a million people in 300 villages of Maharashtra. <br />\nComing to the US in 1987 Arun and his wife Sunanda founded the M.<br />\nK Gandhi Institute for Nonviolence now located at the University of Rochester in NY, and later founded the Gandhi Worldwide Education Institute to foster economic equanimity in depressed regions of the globe. <br />\nHe was recently elected to the Board of the Trustees for the Council for a Parliament of World Religions. <br />\nArun has written a series of books on Gandhi’s life,  the relevance of Gandhi’s vision for today, and has edited publications of his grandfather’s writings including “The Way of God.”  His website is ArunGandhi.net \n \n <br /></p>\n"
}
