{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-the-efficiency-trap-052013/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:16",
      "note": "",
      "size": 14705058,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/27mu4b/GaryNullShow052013.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Efficiency Trap"
  },
  "title": "The Efficiency Trap",
  "date": "2013-05-20 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Why our thinking about becoming more efficient with our resources, energy, agriculture is fundamentally flawed and why<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nwe should think in terms of resilience and conservation - with Steve Hallett. <br /></p>\n\n<p>Professor Steve Hallett is a British environmentalist and an Associate Professor of Botany and Plant Pathology at Purdue University in Indianapolis, where he specializes in plant pathogens and weed science, herbicide resistance, soil microbiology and agricultural and natural systems. <br />\nHe has been involved in bioherbicide research and development for over 18 years and has published extensively on the topic. <br />\nHe is also a faculty advisor to the university’s Full Circle Agriculture program and student farm.\n<br />\nSteve is the author two important works – “Life without Oil”, which looks at the problems faced with peak oil scenarios. <br />\n And his most recent publication is “The Efficiency Trap; Finding a Better Way to Achieve a Sustainable Energy Future,” which details why our impetus on efficiency in resources and energy is contributing to higher consumption and further threatening a sustainable future.\n<br /></p>\n"
}
