{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-031912/",
    "podcast": {
      "developer-note": "",
      "length": "1:20:43",
      "note": "",
      "size": 19374048,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/xaajik/ProgressiveCommentaryHour031912.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-03-19 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>The Failures of our largest Environmental organizations and their sell out corporate polluters\nDerrick Jensen\nDerrick<span class=\"ellipsis\">…</span>\n<!--more-->\nJensen has become one of the nation’s leading voices of cultural and environmental dissent, who writes on how civilization is devastating the environment and the natural world, and our society’s denial of that fact. <br />\nIn 2008, Utne Reader listed Derrick among the 50 visionaries changing the world. <br />\nIn sharp contrast to environmental optimists who believe working within the corporate system will offset the tenuous planetary balance threatened by climate change, Derrick has advocated for many years a “dismantling of civilization” which can include radical dissent as well as imparting wisdom to our children.\n<br />\nHe has received many awards for his writings, including the two “Endgame” volumes. <br />\nHis most recent book “Dreams” is a critique against the fundamentalist Christian legalist morality and materialist scientism hat define western civilization and reinforce their disregard and violence against nature.\n<br />\nHas there ever been an environmental movement in America — and the failures of Big Green organizations\nThomas Linzey\nThomas Linzey is an attorney and the Executive Director of the Commnity Environmental Legal Defense Fund - a nonprofit law firm that has provided free legal services to over five hundred local governments and nonprofit organizations since 1995. <br />\nHe is a cum laude graduate of Widener Law School and a three-time recipient of the law school’s public interest law award. <br />\nHe was also a finalist for the Ford foundation’s Leadership for a Changing World Award, and is a recipient of the Pennsylvania Farmers Union’s Golden Triangle Legislative Award. <br />\nThomas was admitted to practice in the US Supreme Court, the Third, Fourth, Eighth, and Tenth Circuit Courts of Appeals, and the Commonwealth of Pennsylvania. <br />\nHe is a co-founder of the Daniel Pennock Democracy School - now taught in 24 states across the country to assist groups to create new community campaigns wich elevate the rights of those communities over rights claimed by corporations.\n<br />\nThomas is also the author of Be The Change: How to Get What You Want in Your Community (Gibbs-Smith, 2009), and co-hosts Democracy Matters, a public affairs radio show broadcast from KYRS in Spokane, Washington.\n<br />\nWebsite: www.CELDF.org\n<br /></p>\n"
}
