{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-immigrant-children-abuse%e2%80%94the-latest-us-border-%e2%80%98crisis-%e2%80%93-070514/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:21",
      "note": "",
      "size": 14485420,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/paen76/AlternativeVisions_070514.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Immigrant Children Abuse—the Latest U.S. Border ‘Crisis"
  },
  "title": "Immigrant Children Abuse—the Latest U.S. Border ‘Crisis",
  "date": "2014-07-05 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus welcomes long time immigrant justice journalists, David Bacon and Alexandra Early, to discuss the latest<span class=\"ellipsis\">…</span>\n<!--more-->\nissue in immigrant rights: the surge of 50,000 plus children across the US southern border. <br />\nHaving deported 2 million immigrants already in the past five years, the Obama administration is now requesting another $2 billion for more deportations, as an initial response to the ‘children immigration’ issue. <br />\nWhat will happen to tens of thousands of children immigrants now—more detention camps in the US; more dumping of kids back across the US-Mexican border to fend for themselves? <br />\nIn the first half hour of the show Alexandra Early, who has lived in central America for years and has been active politically both in the US and central America, discusses the real conditions behind the exodus of children to the US, desperate to leave poverty, crime and political oppression, as a follow up to her widely read recent article on the topic. <br />\nAlexandra explains how US economic and political policies are much of the root cause of rising children immigration to the US. <br />\n David Bacon, in the show’s second half hour, then provides his excellent political analysis of what’s behind the latest politicization of the ‘children immigration’ issue US. <br />\nBacon explains the origins of the children immigration issue that has recently gained attention in the US press, in recent right wing and US Teaparty political maneuvers in the last few weeks, designed to scuttle even the weak immigration reforms that have been proposed by the Obama administration. <br />\n David and Jack then discuss the likely further response of Obama to the renewed right wing pressure and maneuvering on immigration—ie a more intense deportations and incarceration of children in the short run in coming weeks, followed by promises of ‘more humane’ immigration policy changes ‘later’—post November midterm elections. <br />\n \n \nGuest Alexandra Early worked for four years in El Salvador as Co-coordinator for the solidarity organization US-El Salvador Sister Cities (elsalvadorsolidarity.<br />\norg). <br />\nPrior to that, Ms. <br />\nEarly represented nursing home workers in the Bay Area with the National Union of Healthcare Workers. <br />\nA Latin American Studies graduate from Wesleyan University, Ms. <br />\nEarly has written extensively on US foreign policy in Central America and is a volunteer campaign coordinator for the Richmond Progressive Alliance. <br />\nDavid Bacon is a long time immigrants rights activist in the US and Central America, a well known journalist on immigrant and labor rights since the 1970s, an author, and an award winning photo-journalist whose work on immigrants rights and Hispanic workers in the US and Latin America has been recognized  internationally. <br />\n (Visit the blogs, Znet and Counterpunch, for Alexandra’s and David’s most recent reporting on the children border issue).<br /></p>\n"
}
