{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-021014/",
    "podcast": {
      "developer-note": "",
      "length": "57:08",
      "note": "",
      "size": 13713345,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/dbe8r5/PCH021014.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-02-10 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Peak Oil and the socio-economic impact of depleting fossil fuel resources\nKurt Cobb is an author, speaker, and<span class=\"ellipsis\">…</span>\n<!--more-->\ncolumnist who speaks and writes frequently on peak oil, energy and the environment. <br />\nHe is a regular contributor to The Christian Science Monitor and has written columns for the Paris-based science news site Scitizen.\n<br />\nKurt’s writings have been featured on Resilience, The Oil Drum, OilPrice.com, Investing.<br />\ncom, Peak Oil Review, Common Dreams, Le Monde Diplomatique, and many other sites. <br />\nHe is a founding member of the Association for the Study of Peak Oil and Gas—USA, and he has served on the board of the Arthur Morgan Institute for Community Solutions.\n<br />\nHe is a graduate of Stanford University and his novel “Prelude: A Novel About Secrets, Treachery and the Arrival of Peak Oil” is a startling reinterpretation of contemporary events and a window onto our energy future.\n<br />\nKurt’s website is ResourceInsights.blogspot.com\nDr Nate Hagens is a well known authority on fossil fuel, peak oil and resource depletion. He is the former lead editor of The Oil Drum, one of the most popular and high-respected websites for analysis and commentary on global energy supplies and the socio-economic impact of declining oil resources.<br />\n His a board member of the Post Carbon Institute and currently works at the Institute for the Study of Energy and Our Future, where he is also on the Board. <br />\nPrior to his journalistic research and reporting, he was the president of Sanctuary Asset Management and a vice president with Salomon Brothers and Lehman Brother’s investment firms.\n<br />\nNate has a masters in finance from the University of Chicago and a doctorate in Natural Resources from the University of Vermont.<br />\n He has appeared on PBS, NPR and BBC and lectured internationally.\n<br />\nHis website and writings can be found at TheMonkeyTrap.us\n<br /></p>\n"
}
