{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-172/",
    "podcast": {
      "developer-note": "",
      "length": "1:07:06",
      "note": "",
      "size": 16107408,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/752br/GaryNullShow080911.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-08-09 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guests: Professor James Galbraith and Eric Walberg\nProfessor James Galbraith is a distinguished professor and Chair of<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nGovernment and Business Relations at the LBJ School of Public Affairs at the University of Texas in Austin.<br />\n  He is the son of renowned economist John Kenneth Galbraith. <br />\nJames is the Chair of the international organization Economists for Peace and Security and a Senior Scholar of the Levy Economics Institute.  In the early 80s, he served on the Congressional staff as the Executive Director of the Joint Economic Committee.<br />\n \nProf. <br />\nGalbraith has written many critical and controversial books challenging the nation’s predominant economic policy legislation and the paradigm from which it is based.<br />\n  His latest book is, “The Predatory State: How Conservatives Abandoned the Free Market and Why Liberals Should Too” which targets the liberal economic policies being espoused by both parties for being bankrupt in theory and principle.\n<br />\nEric Walberg is a Canadian journalist and scholar who is known internationally for his in-depth investigations into the socio-politics of the Middle East, Central Asia and Russia. <br />\nHe has lived in the former Soviet Union, modern Russia and Uzbekistan as a United Nations advisor, translator and lecturer. <br />\n Eric is currently a journalist for Cairo’s foremost newspaper Al-Ahram, and a frequent contributor to progressive sites such as Global Research, Counterpunch, and Dissident Voice.\n<br />\nHe has written numerous books on world geo-politics. <br />\nHis most recent is “Postmodern Imperialism: Geopolitics and the Great Games” which thoroughly documents the American-Israel alliance for dominance in the Middle East and Central Asia\n<br /></p>\n"
}
