{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/contingent-faculty-at-colleges-organizing-unions-to-improve-pay-benefits-and-jobs-120614/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:23",
      "note": "",
      "size": 22101070,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/bx865k/AlternativeVisions_120614.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Contingent Faculty at Colleges Organizing Unions To Improve Pay, Benefits and Jobs"
  },
  "title": "Contingent Faculty at Colleges Organizing Unions To Improve Pay, Benefits and Jobs",
  "date": "2014-12-06 00:00:00 -0700",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nJack Rasmus interviews contingent faculty professors at several colleges in California, who are part of a growing wave in the USA of higher education professionals organizing themselves into unions in order to bargain collectively to change their current ‘second class’ employment citizenship as contingents. <br />\nWith talk of insufficient wage growth in the USA having become a common public topic of discussion in the USA in recent months, Dr Rasmus focuses on one of the major causes: the explosive growth of contingent (ie part time, temporary) professional employment in US colleges and universities. <br />\nOnce only 22% of the entire professorial faculty at colleges, today contingent faculty constitute 70-75% of all professors teaching in higher education.  With lower pay than tenured faculty, often with no benefits, and always no job security, contingent professors are beginning to organize themselves into unions to improve their working conditions.<br />\n  Dr Rasmus interviews three contingent professors at California colleges that have just organized, or are organizing, into unions as part of the Service Employees International Union: at St. <br />\nMarys College, Mills College, and California College of the Arts.<br />\n  The professors discuss why they and their colleagues chose to unionize, what the process was like, and what they are now doing as they prepare for bargaining with their respective administrations. <br />\nGuests interviewed include Lain Hart from St. <br />\nMarys College, Ben Browne from Mills College, and Hugh Behm-Steinberg at California College of the Arts all located in the San Francisco Bay area.\n<br />\n \nInterview Participants:\n \nHugh Behm-Steinberg is a Senior Adjunct Professor at California College of the Arts, where he teaches in the MFA Writing and Undergraduate Writing and Literature Programs. <br />\nA recipient of Wallace Stegner and NEA creative writing fellowships, and the author of multiple books of poetry, he has taught as an adjunct at CCA for fifteen years. <br />\nHe is a member of the SEIU-CCA contract bargaining team.\n<br />\n \nDr R. <br />\nBen Brown has a PhD in History from the University of Michigan and a JD from Vanderbilt University. <br />\n He teaches US Legal and Constitutional history in the Legal Studies Department at UC Berkeley, where he has a continuing appointment protected by Union contract. <br />\n He teaches in the History and Public Policy Departments at Mills college where he is a member of the interim bargaining team.\n<br />\n \nLain Hart teaches in the Composition Department of Saint Mary’s College of California and is the author of several academic publications, and lives in Oakland, California <br /></p>\n"
}
