{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-the-ukraine-crisis-political-economic-dimensions-update-031514/",
    "podcast": {
      "developer-note": "",
      "length": "57:02",
      "note": "",
      "size": 13688790,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/intyg9/AlternativeVisions031514.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "The Ukraine Crisis: Political & Economic Dimensions Update"
  },
  "title": "The Ukraine Crisis: Political & Economic Dimensions Update",
  "date": "2014-03-15 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>“Dr.\n<!--more-->\nJack Rasmus and guest, Steve Lendman, revisit the latest in the Ukrainian crisis, discussing its political and economic dimensions. <br />\nIn the first half hour, Dr Rasmus raises ’10 Unanswered Questions’ about the political coup of February 22: Who were the snipers, why is no investigation underway, what is the composition of the neo-fascist parties on the street (Svoboda, Right Sector, UPA, etc.<br />\n), what official positions have they assumed in the new interim Ukrainian government, why did US undersecretary of State, Virginia Nuland, admit to $5 billion spent by the US on Ukrainian politics, what are Nuland’s ‘Neocon’ credentials, and is there a ‘deep government’ in the US driving US foreign policy? <br />\nDr Rasmus also raises the question of what are the ‘crony capitalist’ connections in the Ukraine with US business sectors? <br />\nRasmus identifies the key neo-fascist and crony capitalists and their current roles.<br />\n  Steve Lendman then gives his view of the Crimea referendum and perspective on the Ukrainian crisis, which he calls the worst and most dangerous since the 1962 Berlin crisis. <br />\nIn the second half of the show, Dr Rasmus discusses economic issues, focusing on “who benefits” and “who pays” from the current economic crisis, including western Europe, the USA, Russia and the Ukraine itself. <br />\n(Listeners more interested in the latter topic should go directly to the ‘station break’ at the 30 minute point of the show, and listen to the second half of the h our that discusses economic crises in the Ukraine and other regions affected by it. <br />\nRasmus warns the Ukrainian crisis may be the critical development that sends the European economy into its third ‘dip’ recession in 2014-15.\n<br /></p>\n"
}
