{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-164/",
    "podcast": {
      "developer-note": "",
      "length": "1:02:1",
      "note": "",
      "size": 14922576,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/aetiez/GaryNullShow072911.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-07-29 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>A new look at the Wakefield scandal in light of the illegal activities in journalism conducted by the Murdoch media<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nempire in the UK – and a review of where the current vaccine-autism debate stands in the US\nGuest: Dam Olmsted\nDan Olmsted is an investigative reporter who is a former senior editor for United Press International and was a founding staff member of USA Today where he had severed as its assistant national editor. <br />\n He publishes columns on health and medicine regularly in the Washington Times and is currently the editor of the Age of Autism website, which provides daily updates on the autism epidemic. <br />\nThe Columbia Journalism Review has called the site’s columns “some of the most enterprising contributions to the autism debate”. <br />\n His work has led to the introduction of a 2006 House Bill by Rep. <br />\nCarolyn Maloney calling for scientific studies into the vaccine mercury-autism relationship.\n<br />\nDan, along with his colleague Mark Blaxill, is the of “The Age of Autism: Mercury, Medicine and a Man-Made Epidemic” – the most thorough book to date tracing the history of the autism-vaccine debate.\n<br /></p>\n"
}
