{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-110414/",
    "podcast": {
      "developer-note": "",
      "length": "59:07",
      "note": "",
      "size": 21284326,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/zcrqgt/PCH_110414.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-11-05 00:00:00 -0700",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>The Rise in the Medical Kidnapping of Ill Children\nTerri LaPoint is an investigative reporter and writer for Health<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nImpact News’ Medical Kidnap division, a new website reporting on incidences of hospitals and child services kidnapping children from their parents for medical reasons and to provide resources to families whose children have become victims of this practice. <br />\nShe has long been a passionate advocate for mothers and infants with her background in homebirth midwifery, childbirth and breastfeeding education, and doula work.<br />\n She holds a BS in Cultural Anthropology and World Missions with a minor in Behavioral Science from Toccoa Falls Bible College. <br />\nShe speaks publicly as a voice for the voiceless. <br />\nIn addition to writing for Health Impact News, her articles also appear on The Inquisitr and the PolitiChicks websites\nMedicalKidnap is the sole source for information on the growing number of incidences of medical and civil authorities kidnapping children for medical reasons.  More information can be found at MedicalKidnap.com and HealthImpactNews.com\nMichelle Rider is a Licensed Practicing Nurse and the mother of Isaiah Rider, who is now 17 years old.<br />\n  Her son has a rare condition called neurofibromatosis, which causes painful tumors on nerves. <br />\nIsaiah has undergone multiple surgeries, including complications. <br />\nWhen Michelle decided to seek a second opinion, the Lurie Children’s Hospital in Chicago, which is suppose to specialize in such conditions, ordered Child Protection Services, to take custody of the child from her mother.<br />\n    Both Michelle and Isaiah were told by Hospital officials they would not see each other again. <br />\nMichelle lives in Kansas City and her son was placed in a foster home later in one of the worst sections of Chicago.<br />\n  Michelle has a Facebook page entitled Team Isaiah.\n<br />\nDr Marc D. <br />\nFeldman is Clinical Professor of Psychiatry and Adjunct Professor of Psychology at the University of Alabama in Tuscaloosa. He is a Distinguished Fellow of the American Psychiatric Association and the author of over 100 peer-reviewed, papers in the professional literature.<br />\n  Dr Feldman is highly regarded as an international expert in Munchausen Syndrome, commonly known as factitious disorder, a psychological condition whereby a person feigns disease, illness or psychological trauma to draw attention and sympathy. <br />\nHe has been subject of hundreds of articles appearing in the New York Times, Los Angeles Times, USA Today and others. <br />\nHe has appeared on Good Morning America, Discover, Dateline, 20-20 and all major media national news sources.  Dr Feldman is a graduate of Dartmouth College and Dartmouth Medical School and frequently serves as an expert witness in court cases, including in the case of the medical kidnaping of Isaiah Rider by Lurie Children’s Hospital and Chicago’s Child Protection Services.  Dr Feldman’s website is Munchausen.<br />\ncom\nRandy Kretchmar is a Chicago Attorney specializing mental health law. <br />\nHe entered law later in life in order to better advocate for the universal right of citizens to refuse psychiatry and psychiatric medications.  He is a long time admirer of the work of Dr Thomas Szasz – one of the great American social and moral critics of medical scientism — and he has been associated with the Citizens Commission for Human Rights, perhaps the nation’s largest nonprofit mental health watchdog organizations.<br />\n  Randy is presently the attorney for Michelle Rider and her son’s custody case against Lurie Children’s Hospital and CPS in Chicago. <br />\n  \nHe periodically blogs at RefusingPsychiatry.blogspot.com\nLorie Blaylock is the mother of Kathryn Hughes, born in June this year with a rare condition known as Pierre Robin Syndrome – which is actually not a true syndrome but congenital facial abnormality that includes a cleft palate, small jaw and obstruction at the tongue base.<br />\n   \nFollowing an incidence of seizures a month after Kathryn’s birth and following the medical guidelines from University Medical Center Children’s Hospital in Lubbock Texas, shortly after the infant returned home, the Hospital and Child Protection Services returned to take custody of the child, and now Lorie only gets to see her infant for 2 hours every 3 weeks. <br />\n  She has a Facebook page Bring Baby Kathryn Home.\n<br />\nLorie will share more of her case. <br /></p>\n"
}
