{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-democracy-in-the-cross-hairs-from-cairo-to-wisconsin-082113/",
    "podcast": {
      "developer-note": "",
      "length": "56:16",
      "note": "",
      "size": 13507814,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/g2mm5h/AlternativeVisions082113.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Democracy in the Cross-Hairs: From Cairo to Wisconsin"
  },
  "title": "Democracy in the Cross-Hairs: From Cairo to Wisconsin",
  "date": "2013-08-21 00:00:00 -0600",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nJack Rasmus interviews return guest, Carl Finamore, to give his analysis on the most recent attacks on Democracy in Egypt. <br />\nCarl analyzes the recent military coup, the removal of elected President, Morsi, in Egypt, the military crackdown on the Islamic Brotherhood, the restoration of military rule, and prospects for democratic change.<br />\n  Finamore provides a deep social analysis of the movements and organizations to debunk the notion the conflict there is about religious groups vs. <br />\nsecular groups, and show how the military is deftly manipulating popular discontent to stay in power.<br />\n  In the second half of the show, Jack interviews Ben Manski, who reports on the recent Democracy Convention held in Madison, Wisconsin last week, and the direct action items coming out of the conference to confront a growing, more insidious attack on democratic rights in the USA. <br />\nManski reports initiatives discussed and decided at the conference on defending the constitution, voting rights attacks by ALEC and other right wing-corporate sources, new initiatives in environmental protests, local democracy movements, education for democracy, labor rights, etc.\n<br />\n \nIn coming weeks, watch for Alternative Visions to interview guests from the Moral Monday’s fight in North Carolina, the expanding workers centers movements throughout the US, and the AFLCIO upcoming convention in early September where Labor may decide to include community groups in its membership.<br /></p>\n"
}
