{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-183/",
    "podcast": {
      "developer-note": "",
      "length": "1:03:58",
      "note": "",
      "size": 15355296,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/r2g8ku/GaryNullShow082411.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-08-24 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guest: Professor Thomas Naylor\nProfessor Thomas Naylor is one of the country’s most independent-thinking economists.\n&lt;!--more--&gt;\nHe is a professor emeritus of economics at Duke University where he has taught since 1964, and is the founder of the Second Vermont Republic — a nonviolent citizen’s network and think tank advocating for the breakup of mega-nations such as the US, Russia and China. <br />\nThe Republic calls for the creation of  small, democratic, affluent, socially responsible nations with a high degree of environmental integrity such as Sweden, Finland and Switzerland. <br />\n  This year Time magazine named the Second Vermont Republic among the world’s top 10 aspiring nations, along with Scotland, Quebec and Kurdistan. <br /></p>\n\n<p>Prof. <br />\nNaylor has written numerous articles in academic and popular publications, including the New York TImes, Christian Science Monitor and The Nation. <br />\nAmong his many books is “Affluenza: The All Consuming Epidemic” (which deals with the illness of over consumption and co-written with John de Graaf who was interviewed and filmed for our forthcoming documentary on poverty in America) and his book “Secession: How Vermont and All Other States Can Save Themselves from Empire”\n<br /></p>\n"
}
