{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-government-surveilance-of-american-citizens-111912/",
    "podcast": {
      "developer-note": "",
      "length": "56:5",
      "note": "",
      "size": 13643233,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/e6jdd6/PCH111912.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Government Surveilance of American Citizens"
  },
  "title": "Government Surveilance of American Citizens",
  "date": "2012-11-19 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>The many ways government has increased surveillance of American citizens\nMedea Benjamin is a cofounder of the anti-war<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nfeminist organization Codepink and a co-founder of the international human rights organization Global Exchange.<br />\n  For the past 20 years she has been an advocate for social justice. <br />\nIn 2005 she was among exemplary women nominated to receive a collective Nobel Peace Prize for their efforts to promote peace.<br />\n  She is the author of the recent book:  “Drone Warfare: Killing by Remote Control” which goes into detail about this stealth weaponry, and deals with the dramatic rise of domestic use of drone technology to spy upon citizens.\n<br />\nChase Madar is an attorney in New York and a member of the National Lawyers Guild, a public interest association of lawyers dedicated to progressive change in our economic, legal and political system and support for human rights over property interests. <br />\nHe is the author of “The Passion of Bradley Manning”, and a frequent contributor to the London Review of Books, Le Monde Diplomatique, American Conservative Magazine, and CounterPunch.\n<br />\nHanni Fakhoury is a Staff Attorney with the Electronic Frontier Foundation, who writes and speaks on issues surrounding the intersection of technology and criminal law, privacy, and free speech. <br />\nHe has argued before the Fifth Circuit Court of Appeals on warrantless cell tracking, The Foundation is an international digital rights advocacy and legal organization devoted to civil liberties associated with technology, the internet and telecommunications and supports litigation to preserve and protect the First Amendment in the face of rapid electronic communications.<br /></p>\n"
}
