{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/infectious-myth-081214/",
    "podcast": {
      "developer-note": "",
      "length": "58:59",
      "note": "",
      "size": 21234096,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/wun528/InfectiousMyth_081214.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Kill bees, kill us"
  },
  "title": "Kill bees, kill us",
  "date": "2014-08-15 00:00:00 -0600",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>Episode 25 is not talking about killer bees, but about bee killers, the neo-nicotinoid systemic pesticides that most<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nknowledgeable people outside the chemical manufacturers are blaming for colony collapse disorder.<br />\n \nDavid’s guest is Dave Hackenberg,  who owns a company that trucks large numers of honeybee colonies around the United States to pollinate crops, when and where they are needed. <br />\nThey talk about the importance of bees to many crops in the United States that will not produce seed without a pollinator, and how the concept of a systemic pesticide fills the entire plant with poison, including the nectar and pollen that feed the bee.\n<br />\nDave Hackenberg got serious about this problem when he lost 80% of his hives in the 2006 season, and his research led him to believe that neonicotinoids were the cause. <br />\nSince then he has lobbied tirelessly, and awareness of this problem is certainly growing, thanks to him, other bee-keepers, environmentalists, and a few researchers who are brave enough to withstand attacks from the chemical companies.\n<br />\nPolitics is a big problem, and with industrial agriculture lobbyists funding so many politicians, getting political action is difficult. <br />\nEven supposedly neutral agencies like the EPA (Environmental Protection Agency) and USDA (US Department of Agriculture) appear to be acting mostly in the interests of the chemical and seed companies. <br />\nThere are several lawsuits against the EPA and other government organizations for rushed and inadequate approval of pesticides.<br /></p>\n"
}
