{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-nuclear-energy-industry-102212/",
    "podcast": {
      "developer-note": "",
      "length": "55:37",
      "note": "",
      "size": 13350975,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/jjtkq6/PCH102212.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Nuclear Energy Industry"
  },
  "title": "Nuclear Energy Industry",
  "date": "2012-10-22 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Janette D. Sherman, M. D. is a specialist in internal medicine and toxicology.\n&lt;!--more--&gt;\nShe has worked in radiation and biologic research at the University of California nuclear facility, and at the US Naval Research Laboratory at Hunter’s Point in San Francisco. <br />\nFrom 1976-1982 Dr Sherman served on the advisory board for the EPA Toxic Substances Control Act. <br />\nShe has been an adviser to the National Cancer Institute on breast cancer and to the EPA on pesticides.<br />\n  Currently she is Adjunct Professor at the Environmental Institute, Western Michigan University in Kalamazoo, Michigan, and Research Associate and Lecturer with the Radiation and Public Health Project.\n<br />\nDr Sherman has published more than 70 articles in the scientific literature.<br />\n  She completed the translation and editing of the book Chernobyl: Consequences of the Catastrophe for People and Nature, written by A. <br />\nV. <br />\nYablokov, V. <br />\nB. <br />\nNesterenko and A. <br />\nV. <br />\nNesterenko, published by the New York Academy of Sciences in December 2009\nProf. <br />\nKarl Grossman is a professor of journalism and communications at SUNY College in Old Westbury on Long Island where he has taught investigative reporting for over 30 years. <br />\nHe is one of the nation’s most prolific investigative writers on the nuclear power, politics in the energy industry and the environment. <br />\nThis year he received the prestigious Pope Award for his many articles written during the past year. <br />\nYou can read his articles on sites such as Alternet, Commondreams and the Huffington Post.\n<br />\n He is the author of several books including “Cover Up: What You are Not Supposed to Know About Nuclear Power” and “The Wrong Stuff: The Space Program’s Nuclear Threat to Our Planet.”\nKevin Kamps the specialist in Radioactive Waste Storage and nuclear facility operations for Beyond Nuclear, a non profit organization opposing nuclear power and weapons and advocating for safeguarding our future.<br />\n  For years he was a leader opposing the nuclear industry’s efforts to dump radioactive waste in Yucca Mountain Nevada and to challenge federal subsidies for new reactors and nuclear waste projects. <br />\nHe has traveled to Chernobyl which resulted in his founding a chapter of the International Chernobyl Children’s Project and continues to network with anti-nuclear groups across the nation protesting the relicensing of old decaying reactors and efforts to shut existing ones down. <br /></p>\n\n<p><br /></p>\n"
}
