{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-020315/",
    "podcast": {
      "developer-note": "",
      "length": "52:5",
      "note": "",
      "size": 19023271,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/nuymeg/LeidStories_020315.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2015-02-03 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>With No Bus Service, A Detroit Factory Worker Walks 21 Miles Daily to Work;\nBillions in Bankruptcy Bounty: The<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nSanctioned Looting of Detroit\nSince 2005, when his 1988 Honda Accord gave out, James Robertson, a 56-year-old factory worker from Detroit, has been walking 21 miles to and from his $10.<br />\n55-an-hour job. <br />\nMost of his off-job time is consumed by his grueling commute. <br />\nThere is no bus service where he lives.\n<br />\nA Detroit Free Press story about Robertson on Sunday went viral. <br />\nIt inspired Wayne State University computer science major Evan Leedy to start a crowdfunding campaign that has raised more than enough money to buy Robertson a car and cover related expenses.\n<br />\nThe story pointed to the nobility and tenacity of Robertson, who has never missed a day or been late for work despite his challenges. <br />\nBut as Leid Stories discusses today, Robertson’s story really is about the level of suffering Detroiters have been coping with in recent years.\n<br />\nTom Barrow, an expert in municipal finance, businessman and former chairman of Michigan’s Board of Accountancy, discusses the relationship between Robertson’s decade-long plight and the orchestrated decline of the City of Detroit that culminated in its historic bankruptcy—at $20 billion, the largest municipal bankruptcy in US history—in 2013, was placed under draconian emergency management by Gov. <br />\nRick Snyder, and, under federal court supervision, saw the transfer of billions of dollars in public and private assets to well-connected banks and corporate interests.\n<br />\nBarrow, president of Citizens for Detroit’s Future, has maintained that Detroit’s bankruptcy was unnecessary and illegal, and a “ruthless” conspiracy to rid the city of its mostly African American population. <br />\nKevyn Orr, the emergency manager appointed by Snyder, has been touting a “reimagined” Detroit. <br /></p>\n"
}
