{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-081214-1408138662/",
    "podcast": {
      "developer-note": "",
      "length": "1:10:47",
      "note": "",
      "size": 25484328,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/r32ne7/GaryNullShow_081214.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-08-15 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The many chances the US and Israel had for peace in Gaza and why they ignored the opportunities. Gary speaks with Prof.\n&lt;!--more--&gt;\nSandy Tolan is associate professor at the Annenberg School of Communication and Journalism at the University of Southern California, who over the years as a journalist has reported from over 30 countries during the past 28 years  - including Latin America, the Middle East, the Balkans and South and Southeast Asia. <br />\nA major focus of his work is the relationship between land conflicts, ethnic identities, natural resources and the global economy. <br />\n He is also the co-founder and senior prof Homeland Productions, and independent publishing company of independent journalists providing in depth exposes for NPR, PRI and Marketplace. <br />\nAmong his major productions were Rpeorts from A Warming Planet and NPR’s Living On Earth which received the George Polk Award. <br />\nSandy is the author of  The Lemon Tree: An Arab, a Jew, and the Heart of the Middle East, and the forthcoming Children of the Stone, about the building of a music school under occupation in the West Bank. <br />\nHe is associate professor at the Annenberg School of Communication and Journalism at USC. <br />\n He is contributor to TomsDispatch and blogs at RamallahCafe.<br />\ncom.\n<br /></p>\n"
}
