{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-070914/",
    "podcast": {
      "developer-note": "",
      "length": "55:46",
      "note": "",
      "size": 13385770,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/tbhugi/LeidStories_070914.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-07-09 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Class Warfare, Chicago: Mass Teacher Layoffs Follow Mass School Closings  \nObama Hasn’t OK’d Bipartisan Program to<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nReunite Haitian Families\nThough 82 people were shot, 14 of them killed, in Chicago over the long July 4 weekend, Mayor Rahm Emanuel nonetheless sticks to his script that, mindless acts of violence by the underclass aside, the quality of life in the Windy City generally has improved under his tenure. <br />\nBut he, too, has committed mindless acts of violence—most notably last year, when he shut down 50 public schools, disrupted the education of 46,000 mostly African American children, and cut almost 3,000 teacher and support-staff jobs.\n<br />\nOn June 26, another 1,200 received pink slips in a new round of cuts. <br />\nBrandon Johnson, deputy political director with the Chicago Teachers Union, discusses Emanuel’s latest act of educational violence.\n<br />\nPresident Obama yesterday submitted a request to Congress for $3.7 billion to deal with the crisis of tens of thousands of unaccompanied children entering the United States illegally via the US-Mexico border—a crisis his administration allegedly ignored.<br />\nLeid Stories revisits an emergency immigration program that got bipartisan approval four years ago, but the Obama administration refused to implement it. <br />\nThe program sought to reunite Haitian children with their families and relatives living in the United States after the 7.0-magnitude earthquake devastated Haiti, killing an estimated 300,000 people and displacing 1.<br />\n3 million. <br />\nSteven Forester, immigration policy coordinator for the Institute for Justice &amp; Democracy in Haiti, provides insight on the still-not-enacted program.<br /></p>\n"
}
