{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-blowing-the-whistle-on-the-snowden-greenwald-omidyar-nsa-connection-030614/",
    "podcast": {
      "developer-note": "",
      "length": "53:18",
      "note": "",
      "size": 12792581,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/xyqfed/LeidStories030614.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Blowing the Whistle on the Snowden-Greenwald-Omidyar-NSA Connection"
  },
  "title": "Blowing the Whistle on the Snowden-Greenwald-Omidyar-NSA Connection",
  "date": "2014-03-06 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Edward Snowden has said that his motivation for looting an estimated 1.7 million classified  files from the National<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nSecurity Agency was to expose the NSA’s indiscriminate, wholesale violations of privacy rights in pursuit of the clandestine interests of the surveillance state. <br />\nHe carefully selected media outlets to tell various aspects of the story based on the files, he said. <br />\nThe London-based Guardian newspaper and contributing reporter Glenn Greenwald were clear favorites.\n<br />\nBut after a few stories that gained international attention came a noticeable lull that was broken by news that Greenwald had struck a $250-million deal with Pierre Omidyar, the billionaire owner of Paypal, a longtime cooperator with the NSA’s data-collection program and, recently discovered, co-funder with the US government of ultraright groups seeking to topple the government in Ukraine. <br />\n Greenwald and a small posse of “leftist” journalists are now employees of Omidyar’s recently launched multimedia venture, First Look Media.\n<br />\nQuestions abound. <br />\nDid Snowden get punked by the person he said he entrusted his classified cache to? <br />\nIs Greenwald a checkbook journalist? <br />\nIs Omidyar now the “owner” of Snowden’s looted files? <br />\nDid Greenwald strike a deal also with the US government to hand over certain files?\n<br />\nAn EyeOpener report by independent commentator James Corbett puts the issue in perspective.<br /></p>\n"
}
