{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour/",
    "podcast": {
      "developer-note": "",
      "length": "56:27",
      "note": "",
      "size": 13550832,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/pkw8qu/ProgressiveCommentaryHour013012.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-01-30 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Charlene Spretnak is an internationally recognized author and was among the first wave of originators of what is now<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\ncalled “eco-feminism”.  Her writings have focused on such diverse, but interrelated topics, as social justice, ecological philosophy and Green politics, feminism and spirituality and religion.<br />\n  The British government’s Department of the Environment named her one among the one hundred eco-heroes of all time. <br />\nCharlene iscurrently a professor of women’s spirituality at the California Institute for Integral Studies, a research fellow at the Green Institute and an adjunct professor at Schumacher College in the UK, founded by the gandhian Satish Kumar who has been a guest on this program.\n<br /></p>\n\n<p>Charlene’s writings encompass a wide range topics from the goddesses of the Greeks, to the role of the feminine in Christianity, and social and historical criticism of modern culture and the environment.<br />\n  Her most recent book is “Relational Reality: New Discoveries of Interrelatedness that are Transforming the Modern World” which challenges the older mechanistic view of the universe and society that continues to dominate our major dominant institutions.\n<br /></p>\n"
}
