{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-120914/",
    "podcast": {
      "developer-note": "",
      "length": "55:03",
      "note": "",
      "size": 19823872,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/e2vrih/PCH_120914.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-12-10 00:00:00 -0700",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Series on the power, influence and corruption of Big Business – A look at neoliberal free-trade agreements and<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\npartnerships\nKevin Zeese is an attorney and political activist. <br />\nHe is the co-director of Its Our Economy, director of Come Home America, an organizer for the National Occupation of Washington DC and one of the original developers of Occupy Washington.   He has worked for 3 decades on drug policy reform and serves as the president of the organization Common Sense on Drug Policy.<br />\n  In 2006 Kevin ran on the Maryland ballot for the US Senate with the Maryland Green Party. <br />\nHe was Ralph Nader’s press secretary for his 2004 presidential campaign and worked closely with Ralph Nader’s group Democracy Rising to oppose the Iraq War.<br />\n  Among his activist work is challenging the Chamber of Commerce and Karl Rove’s Americans Crossroads organization, seeking to overturn Citizens United, and efforts to bring Rupert Murdoch to justice for phone hacking.\n<br />\nKevin has a degree from SUNY Buffalo and received his law degree from George Washington University Law School. <br />\nHe is a frequent co-author of articles with Dr Margaret Flowers that appear in Counterpunch, Truthdig, Common Dreams, Washington Post, Alternet and other progressive online news sources.  He also co-hosts Clearing the Fog radio program with Dr Flowers.  His websites are ComeHomeAmerica.us and ItsOurEconomy.us\nBill Waren is a senior trade analyst for Friends of the Earth in its Washington DC office where he focuses upon protecting the environment from the negative impact of international trade and investment agreements.<br />\n Bill contributes to the policy discussion about trade and environment issues as they arise in community forums, the US congressional debate, the federal agency process, international negotiations, and litigation before international trade and investment tribunals. <br />\n \nPrior to joining Friends of the Earth, Bill was a policy director at the Forum on Democracy and Trade and was an adjunct professor at Georgetown University’s Law Center. <br />\nHe has also been a senior fellow at the Harrison Institute of Public Law.   In these capacities, he studied the impact of global trade and investment agreements on the authority of legislatures and other democratic institutions.  He also conducted public education programs and served as a consultant on trade policy for legislators and other elected officials in the United States, as well as parliamentarians in Latin America and Canada\nBill has degrees in politics and public administration from the University of Illinois, and earned a JD from Duke Law School, and an LLM from the Georgetown University Law Center.  He publishes frequently in Environmental Law Reporter, Investment Treaty News Quarterly, State Legislatures magazine, and the Friends of the Earth Blog.  He has recently written an article for stopping the fast tracking of the Pacific and Atlantic partnership details that can be found onThe Friends of the Earth website is foe.org\nAdam Weissman has been a human and animal rights activist for two decades and is a founder and organizer for Global Justice for Animals and the Environment (GJAE), a grassroots activist project addressing the threat posed by free trade agreements to animals, the environment, safe and sustainable food, and the civil rights of protectors of the environment.  He is the Global Justice representative for Trade Justice New York Metro, a coalition of organizations from diverse social movements collaborating to resist the current proposed international trade partnerships and others trade agreements built upon the NAFTA model.  His organization’s websites are TradeJustice.net and GJAE.org \n<br /></p>\n"
}
