{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-070714/",
    "podcast": {
      "developer-note": "",
      "length": "55:17",
      "note": "",
      "size": 13269304,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/hnaxj4/BAR070714.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-07-07 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>The White Settler “Patriots” Pro-Slavery Revolt\nContrary to popular mythology, the white settler rebellion of 1776 was<span class=\"ellipsis\">…</span>\n<!--more-->\nstaged, not to establish democracy, but to forestall the abolition of slavery in Britain’s American colonies, according to a new book by Dr Gerald Horne, a University of Houston professor of history and African American Studies. <br />\nIn The Counter-Revolution of 1776: Slave Resistance and the Origins of the United States of America, Horne said the American rebels’ motivations were much like those of Ian Smith, the white Rhodesian leader who declared unilateral independence from Britain in 1965 to “forestall decolonization” and an end to white rule. <br />\nSmith himself said he was “walking in the footsteps of 1776.<br />\n”\n“Killing Trayvons”\n“Trayvon Martin’s murder wasn’t an anomaly; it’s something that happens all the time, all day, every day,” said South Carolina political activist Kevin Alexander Gray, co-author of the soon to be released book, Killing Trayvons: An Anthology of American Violence. <br />\nThe volume features a wide range of authors, including Robin DG Kelly, Cornel West, Vijay Prashad, bell hooks and many others. <br />\n“We wanted to cover, not just the trial, but the epidemic of killings by police and the fact that Black women are also killed,” said Gray. <br />\n“We even went so far as having some people who may even agree with the jury’s verdict because they thought the prosecution put on such a weak case.<br />\n”\nRace Casts “Long Shadow” on Education and Employment Prospects\nA longitudinal study of 790 low-income young people in Baltimore found that only 4 percent of Blacks earned a four-year college degree by age 28, far fewer than whites from similar family backgrounds. <br />\nAccording to Johns Hopkins University sociologist Dr Karl Alexander, co-author of the report on the 23-year study, titled “The Long Shadow,” about 15 percent of Blacks in the study group attended four-year college programs, and another 15 to 20 percent spent time in two-year programs, but “the vast majority were unable to see it through” to a bachelors degree for various reasons. <br />\n“Where race most clearly comes into play is in employment opportunities in the high-skill, high pay employment sector in the construction crafts and skilled trades,” said Alexander. <br />\nBy age 28, 45 percent of white males in the Baltimore study were working in that sector, compared to only 15 percent of Blacks, with whites earning twice as much pay.\n<br />\nMumia: Corporate Media “Learned Nothing” from Iraq War\nThe US corporate media is once again showing “not even the pretense of objectivity” in its war-mongering coverage of Syria and Iraq, said Mumia Abu Jamal, the nation’s best known political prisoner, in a report for Prison Radio. <br />\n“They have become heralds of hell” who have “learned nothing” since 2003, when they sold the public on the Iraq invasion.<br /></p>\n"
}
