{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg"
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse-and-dr-z-herbs-as-a-viable-integrative-therapy-062414/",
    "podcast": {
      "developer-note": "",
      "length": "54:58",
      "note": "",
      "size": 13194809,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/y9nt4b/NaturalNurse062414.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "Herbs as a Viable Integrative Therapy"
  },
  "title": "Herbs as a Viable Integrative Therapy",
  "date": "2014-06-24 00:00:00 -0400",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Host Dr. Eugene Zampieron, ND, www.drznaturally.com, interviews Dr. Patrick M.\n&lt;!--more--&gt;\nFratellone MD RH (AHG) FIM FACC.<br />\n  Prior to forming Fratellone Medical Associates, Dr Fratellone was Chief of Medicine and Director of Cardiology at the Atkins Center for Complementary Medicine under the direction of the late Robert C. <br />\nAtkins, MD Previously, he held positions as Medical Director of the Fifth Avenue Comprehensive Medical Group and Regional Director of Cardiology programs for the Ultrasound Diagnostic Schools. <br />\nAs a result of his development of programs and teaching in these positions, he is recognized as a forerunner in the field of echocardiography. <br />\nDr Fratellone attended the State University of Stony Brook, medical training in London, and medical residency at Lenox Hill Hospital, where he also completed his Fellowship in Cardiovascular Disease in 1994. <br />\nHe trained at the Nicholas Institute Sports Medicine and Athletic Trauma at Lenox Hill Hospital in New York City and the Division of Congenital Heart Diseases at the University of California at Los Angeles. <br />\nDr Fratellone is one of the few cardiologists with a degree in Integrative Medicine from the University of Arizona under the leadership and auspices of Dr Andrew Weil, where his degree was confirmed with honors.  Dr Fratellone studied botanical medicine under the directorship of 7Song and is a member of the American Herbal Guild and President of the NY City Chapter of the same organization. Contact: http://www.fratellonemedical.com/\n<br /></p>\n"
}
