{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-030915/",
    "podcast": {
      "developer-note": "",
      "length": "57:48",
      "note": "",
      "size": 20812334,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/pib2zu/GaryNullShow_WBAI030615_030915.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Tue, 10 Mar 2015 17:54:01 +0000",
        "timestamp": "1426028041"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2015-03-09 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>A subversive re-evaluation of the history of religion in the US and evidence that it should not be regarded solely as a<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nChristian nation, with Dr Peter Manseau.\n<br />\nDr Peter Manseau is a religious scholar and independent author of ficition and non fiction whose writings have focused in large part upon revisionist interpretations of religious and spiritual history.<br />\n  He has received many awards including the National Jewish Book Award, the Sophie Brody Medal, Ribalow Prize for fiction and a National Endowment for the Arts Literature Fellowship. <br />\nHe is a co-founding editor of the religious blog KillingTheBuddha.com with Jeff Sharlet, who has appeared on this program.<br />\n  Peter received his doctorate in religion from Georgetown University and is currently curating an exhibit of America’s diverse religious past for the Smithsonian National Museum of American History. <br />\nHis most recent book is “One Nation Under Gods: A New American History” which is like a spiritual biography of the US that deconstructs many of the myths held among Christians that this country was settled and founded solely upon the principles of the Christian Bible and ordained and sanctioned by a Christian God. <br />\nHis website is PeterManseau.com<br /></p>\n"
}
