{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-052214/",
    "podcast": {
      "developer-note": "",
      "length": "55:54",
      "note": "",
      "size": 13416072,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/w3igt8/LeidStories_052214.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-05-22 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Detroit: Court Hears ‘Grand Bargain’; Banksters See A ‘Renaissance’\nIn Vermont, A Big Victory for Free and Fair<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nElections\nIn Congress, Republicans Force New Probe Into Benghazi Terrorist Attack\nFederal mediators announced yesterday that the United Auto Workers union has agreed to help raise funds to cover the costs of retirees’ pensions as part of a “grand bargain” with Emergency Manager Kevyn Orr to pull the City of Detroit out of bankruptcy.\n<br />\nLeid Stories correspondent Abayomi Azikiwe, editor of the Pan-African Newswire, brings us up to speed on yesterday’s legal dealings; a sudden affection for the city by bankster JPMorgan Chase; and the Koch Brothers’ effort to make an example of Detroit.\n<br />\nOn April 16, Leid Stories featured a small political action committee, calling itself Wolf-PAC, that had launched an ambitious plan to end corporate financing of political campaigns—in essence seeking to reverse the effect of controversial Citizens United US Supreme Court decision that political spending by corporations is a form of protected speech.\n<br />\nTodd Jagger, Wolf-PAC’s coordinator for Texas and Western states, reports a historic victory for the organization in Vermont.\n<br />\nUnder restrained protest, House Minority Leader Nancy Pelosi yesterday presented five Democrats who will join the Republican-led select committee re-examining the Sept. <br />\n11, 2012 attack on the US consulate in Libya.\n<br />\nThe matter has been thoroughly discussed and put to rest, said Pelosi. <br />\nNot so, says the irksome Sen. <br />\nLindsey Graham (R-SC), as he makes his case on the Senate floor. <br /></p>\n"
}
