{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-030912/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:54",
      "note": "",
      "size": 58479595,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/vsz9t/GaryNullShow030912.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-03-09 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Prof.\n&lt;!--more--&gt;\nJames Gustave Speth has been one the true insiders and leaders of the environmental movement for the past four decades. <br />\nFor a decade he was the Dean of the School of Forestry and Environmental Studies at Yale University and now is on the faculty of the Law School at the University of Vermont in Burlington. <br />\nIn the past he co-founded the National Resources Defense Council, chaired the President’s Council on Enviornmental Quality under President Carter, was a senior advisor on President Clinton’s transition team, and was the founding president of the World Resources Institute. <br />\nProf. <br />\nSpeth also served as the CEO of the United Nations Development Program.<br />\n  He has received many awards for his stance on dealing with global environmental problems, including Japan’s prestigious Blue Planet Prize for lifetime creative, visionary leadership.\n<br />\nProf. <br />\nSpeth is the author of several books, the last being “The Bridge at the Edge of the World: Capitalism, the Environment and Crossing from Crisis to Stability” and his new article on the Orion Magazine website “America the Possible: A Manifesto” is an important piece for listeners to read.\n<br /></p>\n"
}
