{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stores-us-postal-service-%e2%80%98reforms%e2%80%99-have-big-money-behind-them-031314/",
    "podcast": {
      "developer-note": "",
      "length": "54:32",
      "note": "",
      "size": 13090795,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/d76rsk/LeidStories031314.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid StoresU.S. Postal Service ‘Reforms’ Have Big Money Behind Them"
  },
  "title": "Leid StoresU.S. Postal Service ‘Reforms’ Have Big Money Behind Them",
  "date": "2014-03-13 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>The U.S.\n&lt;!--more--&gt;\nPostal Service for many years has been the poster child for what’s wrong with “big government.<br />\n” Ever-increasing operational costs, loss of market share and revenue to electronic mail and the private mailing industry, and staggering deficits ($5 billion last year) haven’t helped the USPS any. <br />\nNow powerful forces are behind a push in Congress to institute “reforms” that will have devastating impact on postal workers, consumers and communities across the nation.\n<br />\nThe Senate’s Postal Reform Act of 2014, shepherded by Thomas Carper (D-Del.) and Tom Coburn (R-Okla.) through the Homeland Security and Governmental Affairs Committee, and the Postal Reform Act of 2013 authored by Darrell Issa (R-Calif.<br />\n), chairman of the House Oversight and Government Reform Committee, are the latest incarnations of a master plan to “right-size” the USPS. <br />\nUnion leaders and the rank and file, understanding what that means, are already in battle mode.\n<br />\nLeid Stories begins a series of discussions on the seamy undersides of the legislative “solutions” to USPS’s woes.\n<br />\nInvestigative reporter Peter Byrne, author of Going Postal: Dianne Feinstein’s Husband Sells Post Offices to His Friends, Cheap, tackles the “solution” to shut down “unnecessary” post offices across the country. <br />\nIt’s a real estate bonanza, he says, and the politically connected have their feet in the door.\n<br />\nRetired letter carrier John Dennie, who two years ago attempted a citizen’s arrest of Postmaster General Patrick R. <br />\nDonahoe for administrative crimes, contends that the government itself engineered USPS’s fiscal crisis. <br />\n   <br /></p>\n"
}
