{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-will-the-afl-cio-restructure-to-include-community-organizations-080713/",
    "podcast": {
      "developer-note": "",
      "length": "59:03",
      "note": "",
      "size": 14174459,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/dy6v2k/AlternativeVisions080713.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Will the AFL-CIO Restructure To Include Community Organizations?"
  },
  "title": "Will the AFL-CIO Restructure To Include Community Organizations?",
  "date": "2013-08-07 00:00:00 -0600",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>At the end of July, the president of the AFL-CIO, America’s largest union federation, Richard Trumka, announced that at<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nits coming September convention the AFL-CIO Union Federation would decide on bringing community organizations into the Federation and allowing the organizations to become formal members of the federation, ‘with decision making power’ (quoted from Wall St. <br />\nJournal, July 27-28, 2013)). <br />\nGroups like the NAACP, La Raza, Sierra Club and others are reportedly now in negotiations with the AFL-CIO, a change of potentially significant impact (or maybe not!<br />\n). <br />\nIs something big about to happen in Union labor at the top? <br />\nOr is it just a cover for closer cooperation to help Democrats get elected in 2014?  In today’s show, Dr Rasmus interviews three long time union activists—in California, North Carolina, and Philadelphia—on the potential significance of the AFL-CIO’s coming convention and closer organizational ties with national community organizations.  Jack’s guests—Steve Early, Zachary Robinson, and Jim Moran—also report at length on what’s happening locally in their back yards in terms of growing labor-community actions on a number of fronts.<br />\n”\nSteve Early is a long time union activist, former representative for the CWA in New England area, a lawyer, journalist with publications in the Boston Globe, New York Times, Washington Post, and numerous other periodicals, and book author. <br />\nHis recent books include “Embedded with Organized Labor”, “The Civil Wars of US Labor”, and most recent, “Save Our Unions”, published by Monthly Review Press. <br />\nHe is also a member of the Green Shadow Cabinet. <br />\nSteve resides in Richmond, California, a hotbed of recent local community action.\n<br />\nZachary Robinson is an officer in the AAUP in Greenville, North Carolina. <br />\nA member of Pitt County Coalition Against Racism, and of the local Executive Board of the NAACP Pitt County chapter. <br />\nZach has been active in the noteworthy “Moral Mondays” grass roots movement and protests in North Carolina, opposing the draconian measures being introduced by its newly elected Republican Teaparty governor and Legislature.\n<br />\nJim Moran is a long time union member of the Newspaper Guild, officer and activist in the Philadephia area. <br />\nJim has led the fight for job safety and health in the area for decades, and is a member of the board of the Pennsylvania Labor History Society. <br />\nJim is also a member of the Green Shadow Cabinet responsible for labor issues.<br /></p>\n"
}
