{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/october-13-2010/",
    "podcast": {
      "developer-note": "",
      "length": "57:15",
      "note": "",
      "size": 13742064,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/8esrcf/GaryNullShow101310.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "October 13, 2010"
  },
  "title": "October 13, 2010",
  "date": "2010-10-13 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today’s guest is Stephen Kohn and he is one of the nation’s leading advocates for corporate and government<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nwhistleblowers and has a long record spanning over 25 years of court victories on behalf of individuals bringing the truth to the public about corruption, fraud and misdemeanors. <br />\n He is the Executive Director of the National Whistleblower Center in Washington and a Trustee of the National Whistleblower Legal Defense and Education Fund. <br />\nStephen has testified in Congress and counseled the Senate Judiciary to protect whistleblower well being. <br />\nHe is the author of the first legal treatise on whistleblower back in 1985 and has since published numerous articles and books . <br /></p>\n\n<p>Also, we have Dean Zerb and he is a special counsel who conducted congressional investigations into government waste, fraud and abuse for over 25 years. <br />\nHe served as Senator Charles Grassley’s chief investigative counsel on the Senate Finance Committee. <br />\nDean was instrumental in the creation of the Whistleblower Office at the IRS and the drafting of Whistleblower laws. <br />\nThe National Journal named him one of the top staffers in Congress, and he is listed among the Hill’s top 100. <br />\nHe has conducted investigationis into the Dept. <br />\nof Health and Human Services, the Red Cross, non profit hospitals, Enron, the IRS, the Department of Defense and many others. <br />\nAs an expert in taxation law and its oversight, Dean is frequently recognized in the New York Times, Wall Street Journal, Financial Times, Forbes and other publications.\n<br /></p>\n"
}
