{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-010615/",
    "podcast": {
      "developer-note": "",
      "length": "57:02",
      "note": "",
      "size": 20537955,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/in47b2/PCH_010615.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2015-01-07 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>CONVERSATIONS WITH REMARKABLE MINDS\nThe physics of angels: a postmodern dialogue between science and spirituality\nDr.\n<!--more-->\nSheldrake has written extensively on morphogenic theory since the publication “A New Science in Life “in 1981.<br />\n  His book “Science Set Free” is a thorough critique of the flaws in the dominant mechanistic scientific model. <br />\nHis website is Sheldrake.org Dr Rupert Sheldrake is a British biochemist and plant physiologist who has experimented with innovative field theory in plants and animals, including humans, to account for the causative formation of the deeper structures of biological development and collective consciousness.  His research has included efforts to reach a greater understanding of memory, perception and cognition as well as the forces that unfolds an organism.   Over the past several decades Rupert developed his theory of morphic resonance and morphogenic fields.<br />\n  While in India, he became a close associate of the late Father Bede Griffiths – an internationally renowned Dominican monk, mystic and spokesperson for interspiritual dialogue between religions.\n<br />\nReverend Matthew Fox is one of the today’s most progressive theologians and spiritual visionaries today. <br />\nHe is the founding theologian behind what is called today Creation Spirituality – an ecumenical and interspiritual theology that posits life as an original blessing. <br />\nFor years, former Pope Benedict XV!<br />\n, then known as Cardinal Ratzinger (the chief inquisitor and head of the Vatican’s Congregation of Doctrine and Faith) attempted to silence Rev. <br />\nFox, which eventually led to his being expelled from the Dominican Order and his subsequent joining the Anglican Church. <br />\nLater he founded YELLA-WE, an inner city project in Oakland California to bring youth together with elders for learning and wisdom \nMatt is the author of over 30 books on theology, biblical exegesis, mysticism, interfaith dialogue, education, gender issues, cosmology and other topics, including “The Pope’s War” and “The Hidden Spirituality of Men.” His website is MatthewFox.org\nTogether Rev Fox and Dr Sheldrake have published a new release – “The Physics of Angels: Exploring the Realm Where Science and Spirit Meet.”<br /></p>\n"
}
