{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-134/",
    "podcast": {
      "developer-note": "",
      "length": "1:08:45",
      "note": "",
      "size": 16501536,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/25y3it/GaryNullShow061611.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-06-16 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today’s guest is Robert Parry and he is one of our leading progressive investigative journalists best known for his<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nuncovering Iran-Contra story and Oliver North’s involvement which earned him the George Polk Award for National Reporting in 1984. <br />\n He current writes for Consortium News, and has covered many important stories on domestic and foreign affairs issues including the Nicaragan contra-cocaine connection, right wing terrorism, the demise of American media, the Bush and Obama presidencies, the rise and influence of the Neocons and our wars overseas. <br />\n He has worked as a journalist for the Associated Press, Newsweek and PBS Frontline. <br />\nHe has written several books, the latest being “Neck Deep: The Disastrous Presidency of George W Bush”. <br /></p>\n\n<p>Also, we have Dr Michael Hudson and he is one of our nation’s important economists and Wall Street financial analysts. <br />\nHe is currently the President of The Institution for the Study of Long-Term Economic Trends and was the Chief Economic Policy Advisor for the Rep. <br />\nDennis Kucinich’s 2008 presidential campaign. <br />\n Dr Hudson has served as an advisor to the White House, State and Defense departments at the Hudson Institute, in addition to the United Nations Institute where he became a specialist in global economics. <br />\nDr Hudson has written several books and many important papers articles, including “Super-Imperialism: The Economic Strategy of the American Empire” and “Global Fracture: The New International Economic Order”.\n<br />\nWEBSITE: www.Michael-Hudson.com\n<br /></p>\n"
}
