{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-013114/",
    "podcast": {
      "developer-note": "",
      "length": "57:34",
      "note": "",
      "size": 13817940,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/h956wh/BAR012514.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-01-31 00:00:00 -0700",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>A Black-Green Alliance in Libya?\n&lt;!--more--&gt;\nReports of intense fighting in southern Libya against the NATO-installed regime indicate that “Green” supporters of the former Gaddafi government could form an alliance with Black Libyans, who have been subjected to murderous ethnic cleansing, said political analyst Eric Draitser, of StopImperialism.<br />\ncom. <br />\n“As these two forces begin to fight back against these racist and imperialist puppets that run the country, we’re beginning to see a form of mass resistance. <br />\nWhat form that ends up taking still remains to be seen,” said Draitser.\n<br />\nNSA is Like J. <br />\nEdgar Hoover on Steroids\nThe recent report of the federal Privacy and Civil Liberties Oversight Board, which described the omnibus NSA spy program as unconstitutional, will make Congress “more responsive to the public outcry” against the Surveillance State, said Carl Messineo, legal director of the Partnership for Civil Justice Fund. <br />\n“Public opinion polls are clear that a majority of Americans recognize that there has been an unacceptable loss of civil liberties in the so-called pursuit of anti-terrorism,” said Messineo. <br />\n“This is J. <br />\nEdgar Hoover’s intelligence program on steroids.<br />\n”\nSexual Abuse Rampant in US Prisons\nA Bureau of Justice Statistics report shows continued high rates of sexual misconduct against inmates in the nations federal, state and local prisons and jails. <br />\nHowever, only a very small proportion of cases lead to prosecutions of prison staff, said Chris Daley, deputy executive director of Just Detention International, a watchdog group. <br />\nMost sexual abuse victims get no medical care, despite the fact that “the vast majority of facilities have medical folks on staff who, within about a 12-hour period, could easily provide both emergency care and collect evidence needed for prosecution” – but that rarely happens in US prisons, said Daley.\n<br />\nNYC Police Commissioner Bratton is “War Criminal of Our Communities”\nA father recently took his two daughters to the Brooklyn Academy of Music to hear Angela Davis and watch a film on political prisoners. <br />\nInstead, the place was packed with “establishment Democratic Party speakers backslapping each other about [Mayor Bill] de Blasio’s election,” including Bill Bratton, de Blasio’s new police commissioner and an architect of stop-and-frisk. <br />\n“I was aghast that this type of forum” during MLK week “would give a voice to this war criminal of our communities,” said Greg Butterfield, of New Yorkers Against Bratton.\n<br />\nBring Mumia Home Campaign\nThe Fraternal Order of Police is spearheading a drive against former NAACP Legal Defense Fund lawyer Debo Adegbile’s nomination as head of the US Justice Department’s Civil Rights Division. <br />\nThe LDF helped overturn the death sentence against Mumia Abu Jamal, in the killing of a Philadelphia policeman in 1981. Dr Johanna Fernandez, professor of history at Baruch College and a member of Mumia’s defense team, said the FOP “distorts race to delegitimize the claims of Mumia Abu Jamal and all people who have been wrongly incarcerated by the state.<br />\n”\nAnthony Monteiro spoke in support of the Bring Mumia Home Campaign. <br />\n“At some point, white America has to confront itself and its own contradictions,” he said. <br />\n“It is not Mumia that they fear; it is the truth that Mumia represents.<br />\n” Temple University has refused to renew Dr Monteiro’s contract as a professor of African American Studies – in retaliation, many believe, for his political activism.\n<br />\nAmiri Baraka Eulogized by His Son\n“My father was – IS – a revolutionary,” said Ras Baraka, in his eulogy for famed poet/activist Amiri Baraka, who died at age 79 in Newark, New Jersey. <br />\nCity councilman Ras Baraka is running for mayor of Newark.<br /></p>\n"
}
