{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-072514/",
    "podcast": {
      "developer-note": "",
      "length": "57:35",
      "note": "",
      "size": 20732112,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/7pm96t/GaryNullShow_072514.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-07-25 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The corruption and failure of America’s Foster Care and Child Welfare System\nJoachim Hagopian has been a practicing<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nclinical psychologist and marriage counselor practicing in California for over 25 years, with an emphasis on disadvantaged youth and the child welfare system. <br />\nFor years he has worked with child abuse victims and learning disabilities in diverse settings including residential homes and outpatient clinics.\n<br />\nFrom a Congressional appointment, Joachim attended the US Military Academy at West Point through a Congressional appointment in the late 1960s. <br />\n After clashing with the system he was railroaded out at the end of his third year. <br />\nThis resulted in Joachim filing charges against the academy with failure to allow due process and he won the case in a New York federal district court. <br />\nThis case set the precedent that continues today for cadets the right to present their case and witness before the academy.<br />\n  He eventually completed his education at West Point and served as an officer – many of his classmates now being top high ranking officers in the Department of Defense. <br />\nJoachim’s story is retold in his manuscript book “Don’t Let The Bastards Getcha Down.<br />\n”  In addition he writes on issues about geopolitics, national security and international relations for Global Research, many which have been featured on the Public Radio Network and Boiling Frogs. <br />\nHis articles can be found at GlobalResearch.ca under Hagopian, and his West Point book at RedRedSea.<br />\nnet.\n<br />\n \n <br /></p>\n"
}
