{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-moral-mondays-the-north-carolina-fight-for-democracy-082813/",
    "podcast": {
      "developer-note": "",
      "length": "55:18",
      "note": "",
      "size": 13273652,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/ukuweq/AlternativeVisions082813.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Moral Mondays’ & the North Carolina Fight for Democracy"
  },
  "title": "Moral Mondays’ & the North Carolina Fight for Democracy",
  "date": "2013-08-28 00:00:00 -0600",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n&lt;!--more--&gt;\nJack Rasmus invites guests from the grass roots fight for democracy in North Carolina, where democratic and civil rights have come under intensifying attacks from its Republican governor and conservative state legislators. <br />\nContinuing the theme of recent Alternative Visions radio shows on the growing assault on democratic and civil rights in the US and abroad, Dr Rasmus interviews three well known and highly respected community activists who have been deeply involved in the ‘moral mondays’ protests and other movements in that state.  Jack welcomes Reverend Nelson Johnson, Ajamu Dillahunt, and Zach Robinson–all three located in different parts of the state and together involved in the fight to defend democratic, civil and labor rights in a state where recent attacks on democratic, civil and labor rights have been the most intense.<br />\n  What happens in North Carolina is a harbinger of things to come’\nReverend Nelson Johnson is pastor of the Faith Community Church in Greensboro, Executive Director of the “Beloved Community” movement and center, and leads the Interfaith Workers Justice Center for workers, a ‘workers center’ group affiliated with the AFL-CIO.\n<br />\nAjamu Dillahunt is a founder of the Blackworkers for Justice, which has resisted job offshoring and safety &amp; health problems in that state for decades. <br />\nHe is a past president of the Postal Workers union , a member of the Raleigh, North Carolina Central Labor Council, and a statewide coordinator for the ‘moral mondays’ and other coalition protests.\n<br />\nZachary Robinson is a long time member and officer of the American Professors Union, and a participant in many of the ‘moral mondays’ protests for the past year.\n<br /></p>\n"
}
