{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/japan%e2%80%99s-recession-the-contradictions-of-global-capital-112914/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:37",
      "note": "",
      "size": 21826628,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/649hy2/AlternativeVisions_113014.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Japan’s Recession  & the Contradictions of Global Capital"
  },
  "title": "Japan’s Recession  & the Contradictions of Global Capital",
  "date": "2014-11-29 00:00:00 -0500",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n<!--more-->\nJack Rasmus describes Japan’s latest 2014 recession as yet another example of growing global Capitalist economic contradictions. <br />\nWith its stock markets booming, exports rising, unemployment at a 16 year low, interest rates at zero and massive money injections by its central bank—how is it that Japan’s economy has plunged again the last six months into a severe recession once again?  Is it that it has introduced QE monetary policies too ‘late’, as one wing of mainstream economists argue (ie ‘retro classicalists’)?<br />\n  Or is it because it has not introduced fiscal stimulus government spending, as another wing of economists argue (ie ‘hybrid keynesians’)? <br />\nJack challenges both explanations. <br />\nReal wages and real household income continues to decline, and consumption falter in turn, Jack argues, because job growth has been largely ‘contingent’(part time/temp), because Japan QE/monetary policy has depressed its currency by 35% and raise the cost of consumer imports that reduces real wages still further, and because Japan fiscal policy raised consumer taxes and reduced household income still further in turn.<br />\n  Jack argues Japan is yet another ‘model’ and example of how capitalist monetary policies driving the world economy today bail out wealthy investors, bankers, and multinational companies first and quickly, but result in a failure to boost real investment, jobs and average consumer incomes as well in the process. <br />\nWith little household demand for real goods and services, businesses cut labor costs (wages) instead to boost profit margins and then hoard their cash, or invest it offshore, or divert it to financial asset speculation globally.<br />\n  Capitalist monetary policies bail out the rich, but simultaneously cause the rest of the global economy to gradually grind to a halt—Japan being but the latest, and most extreme, example of the growing contradictions of global capital today.\n<br /></p>\n"
}
