{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-dr-diana-alstad-dr-joel-kramer-scott-shackford-072412/",
    "podcast": {
      "developer-note": "",
      "length": "1:04:29",
      "note": "",
      "size": 15479014,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/xbtcpr/GaryNullShow072412.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Dr. Diana Alstad, Dr. Joel Kramer, Scott Shackford"
  },
  "title": "Dr. Diana Alstad, Dr. Joel Kramer, Scott Shackford",
  "date": "2012-07-24 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The psychological dynamics of authoritarianism and its power as a threat to democracy\nDr.\n&lt;!--more--&gt;\nDiana Alstad is an author and lecturer. <br />\nA Woodrow Wilson Fellow, she received a PhD from Yale in 1971 and was a professor at Duke University in the humanities. <br />\nAlstad taught the first Women’s Studies courses at Yale and Duke, co-founded New Haven Women’s Liberation in 1968, and was on the board of the Veteran Feminists of America from 1998 to 2004.\n<br />\nAnd we have Dr Alstad’s partner for almost 40 years,  Dr Joel Kramer. <br />\nJoel is the author of a early seminal work The Passionate Mind  in 1974. <br />\nHe did his postgraduate work in philosophy and psychology at the University of Florida, NYU, and Columbia  and was one of the early pioneers of transpersonal thought on the faculty at Esalen Institute in Big Sur, California. <br />\n His work in mind/body approaches to Yoga as a means of self-transformation over the years has become an integral part of modern American yoga.\n<br />\nIn addition to Diana and Joel being pioneers in the birthing of American yoga, they are also the authors of the Guru Papers: Masks of Authoritarian Power – written in 1993 which has become the standard classic text on spiritual authoritarianism and the misuse of power for personal gain and aggrandizement.\n<br />\nPLUS: An update on this shocking video from Anaheim, the creeping police state and our 1st Amendment rights.\n<br />\nSHOCKING : CALIFORNIA COPS OPEN FIRE ON MEN - WOMEN - CHILDREN - BABIES </p>\n\n<p>Shackford comes to Reason.<br />\ncom after nearly a decade of serving in various editing positions for Freedom Communications, a libertarian-leaning media chain that may or may not still exist depending on when this profile is being read. <br />\nPrior to moving to Reason, he was editor in chief of the Desert Dispatch in Barstow, Calif.<br />\n, where he wrote editorials focusing on libertarian issues like wasteful municipal spending, school choice, the drug war and abuse of police authority. <br />\nHe also editorialized about state and federal transportation and energy spending. <br />\nLiving in the midst of heavily subsidized solar developments in the Mojave Desert, he warned about potential problems with the Department of Energy’s guaranteed loan program months before Solyndra actually filed for bankruptcy.\n<br /></p>\n\n<p><br /></p>\n"
}
