{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-121214/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:51",
      "note": "",
      "size": 22266269,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/qjhb97/GaryNullShow_121214.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-12-12 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today, flax seed as good as fish for fatty acids, green leafy vegetables help circulation, brain inflammation a<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nhallmark of autism, most significant factors guaranteed to depress your immune system, and more.\n<br />\nA look at the scientific evidence on how spirituality and religion enhances a person’s physical, mental and social health\nDr Harold Koenig is a professor of psychiatry and behavioral sciences at an associate professor of medicine at Duke University’s Medical Center, and is a founder and director of Duke’s Center for Spirituality, Theology and Health – a multidisciplinary research and training program that explores the biological mechanisms by which religion and spirituality affect physical health and medical outcomes.  Earlier, Dr Koenig specialized in geriatric and family medicine.<br />\n  He holds degrees from Stanford University and a medical degree from the University of California at San Francisco. <br />\nHe has written extensively on mental health, geriatrics and religion, with over 450 peer-reviewed papers, and is regarded as one of the world’s top experts on the interface between religion and health. <br />\nAmong his more recent publications are “Spirituality in Patient Care”, “The Handbook on Religion and Health”, and most recent “Health and Well-being in Islamic Societies. <br />\nThe website for his Center is SpiritualityAndHealth.Duke.edu<br /></p>\n"
}
