{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-042314/",
    "podcast": {
      "developer-note": "",
      "length": "52:31",
      "note": "",
      "size": 12606798,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/5dx68q/LeidStories_042314.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-04-23 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Up South: New York’s Schools Most Segregated In The Nation\nHell On Wheels: Postal Service Targets Its Truckers and<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nMachinists\nObama, Sharpton Seek Voting-Rights ‘Volunteers.<br />\n’  No, It’s A Job! <br />\nGet Paid!\n<br />\n“For several decades, the state has been more segregated for blacks than any Southern state, though the South has a much higher percent of African American students,” said a report recently released by the University of California-Los Angeles Civil Rights Project.\n<br />\nGary Orfield, professor of education, law, political science and urban planning at UCLA, details the findings of the report, which tracked trends in public-school education in New York and other East Coast cities over the past 60 years.\n<br />\nLeid Stories has been covering the bipartisan plan to overhaul the US Postal Service with sweeping “reforms” that will cut jobs, close “unnecessary” post offices, cut back on mail delivery, sell off shuttered centers and other properties, and privatize as many postal services as possible.\n<br />\nKevin Cole (California) and Greg Stinson (Oregon) discuss the pushback from truckers and machinists.\n<br />\nOn the heels of President Obama’s vapid speech at the National Action Network’s annual convention about voting-rights violations and how important it is that African Americans vote comes an announcement by NAN’s honcho, the Rev. <br />\nAl Sharpton that the organization is looking for “volunteers” in eight states to do field work (pun intended).\n<br /></p>\n\n<p>Leid Stories says, “It’s a job. <br />\nPay the people!”<br /></p>\n"
}
