{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-031212/",
    "podcast": {
      "developer-note": "",
      "length": "1:03:02",
      "note": "",
      "size": 15130224,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/eh8r8g/ProgressiveCommentaryHour031212.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-03-13 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>HIV/AIDS Special\nClark Baker\nClark Baker is a former officer of the LAPD in Los Angeles, who left after retirement in<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\n2000 to become an independent writer and private investigator. <br />\nHe is now the founder of the Office for Medical and Scientific Justice in Southern California, which spearheads investigations into the politics and fraud of various medical related groups and individuals, including the pro-AIDS industry and academia. <br />\nClark serves on the Board of the Semmelweis Society International, a foundation that awards individuals for their scientific independence in innovative research and critical thought in the absence of invested interests. <br />\nHe has written extensively on his investigations into the activities of the pro HIV community.\n<br />\nWebsite: Office of Medical and Scientific Justice www.OMSJ.<br />\norg\nLiam Scheff\nLiam Scheff is an investigative journalist and researcher addresses scientific discoveries, the medical cult and politics of scientism - especially concerning infectious disease, vaccines and prescription drugs - and issues concerning race, class and culture. <br />\nHe has been an activist for children and adolescent rights, and broke the story about government agencies, particularly the NIH, and Big Pharma’s hidden experimental trials with dangerous HIV drugs on New York City orphans.\n<br />\nLiam is a co-host Robert Scott Bell’s program on health, and has been published in the New York Press, LA Citybeat, Salvo, Hustler and others. <br />\nHe is a contributing investigator for the Office of Medical and Scientific Justice and founder of ReduceTheBurden.org\nWebsite: www.LiamScheff.com and www.ReduceTheBurden.<br />\norg\nCelia Farber\nCelia Farber is a journalist who covered the HIV wars extensively since 1987, in various magazines. <br />\nSome of these writings are collected in her book: “Serious Adverse Events: An Uncensored History of AIDS” published by Melville House Press. <br />\n(now Random House) in 2006.\n<br />\nActivist Michael Callen called Farber “..the best AIDS journalist in the world.<br />\n” She also has enemies, of course. <br />\nHer 2006 article for Harper’s magazine detailing the totalitarian corruption of HIV/AIDS research was titled “Out of Control: AIDS And The Corruption of Medical Science.<br />\n” The attacks from the AIDS industry were predictable and fierce. <br />\nNevertheless, she won the 2008 Semmelweis Clean Hands Award for Outstanding Investigative Journalism.\n<br />\nCelia will also be starting to host her own program, entitles Radio Free Science, on the Progressive Radio Network this Friday, March 16th at 3pm Eastern Time.\n<br /></p>\n"
}
