{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-122012/",
    "podcast": {
      "developer-note": "",
      "length": "1:02:39",
      "note": "",
      "size": 15036395,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/bv6x4z/GaryNullShow122012.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-12-20 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Dr. Ken Stoller is a board pediatrician medicine and a environmental activist.\n&lt;!--more--&gt;\nHe is a founder and president of the International Hyperbaric Medical Association, a diplomat of the American Board of Pediatrics and a founder of the Humane Farming Association. <br />\nHaving become frustrated with medical agency and association cover-ups and the corporate medical lobbying powers over the rapid rise in children’s developmental disabilities, Dr Stoller and other physicians testified before Congress on the role vaccinations have played, particularly mercury, in the rise of autism and other related conditions. <br />\n In 2006, he met with environmental scientists at CDC headquarters to discover their concern about mercury but being powerless to affect the agency’s policy. <br />\nHis letter of resignation to the American Pediatric Association, published in a distinguished peer review medical journal, raised quite a storm in the pediatric community.\n<br />\nDr Stoller continues to work with patients with autistic and developmental conditions in his private practice and is currently collaborating with the renowned alternative psychiatrist Dr Daniel Amen.\n<br /></p>\n"
}
