{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "image",
      "url": "http://leidstories.podbean.com/mf/web/vb9b/Utrice-Leid-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-dr-martin-luther-king-jr-a-time-to-break-the-silence-012014/",
    "podcast": {
      "developer-note": "",
      "length": "56:58",
      "note": "",
      "size": 13673744,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/f4n68b/LeidStories012014.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Dr. Martin Luther King Jr.: “A Time to Break the Silence”"
  },
  "title": "Dr. Martin Luther King Jr.: “A Time to Break the Silence”",
  "date": "2014-01-20 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Leid Stories commemorates Dr. Martin Luther King Jr.\n&lt;!--more--&gt;\nDay with purposeful contemplation of a guiding principle in his life’s work: “Injustice anywhere is a threat to justice everywhere.<br />\n”\nAt a meeting in New York City of the nondenominational Clergy &amp; Laity Concerned, Dr King exhorted leaders in the faith community — and people of conscience generally — to be true advocates for the poor and oppressed by relentlessly opposing US laws and policies that are morally wrong and inhumane – not only for fellow Americans, but for people all over the world.\n<br />\nAmerica’s appetite for war, he said, is sated always by unimaginable hardship, suffering and sacrifices by those least able to bear them – the poor at home and in far-flung corners of the world where America introduces itself with bombs and utter destruction.\n<br />\nThis speech was delivered at Riverside Church on April 4, 1967, a year to the day of the assassination of Dr King in Memphis, Tenn., where he was mobilizing a march in support of 1,300 African American sanitation workers striking for recognition of their union, better working conditions and a living wage. <br /></p>\n"
}
