{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-091114/",
    "podcast": {
      "developer-note": "",
      "length": "56:46",
      "note": "",
      "size": 20440512,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/9bri7z/LeidStories_091114.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-09-11 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Detroit Bankruptcy Trial: Judge Grants Delay So Bond Insurer Could Ink Sweet Deal with the City\nThe nation today marks<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nthe 13th anniversary of a national tragedy. <br />\nFor Detroiters, it’s the day after yet another tragedy hit home. <br />\nThe federal judge they were hoping would agree that the city’s declared bankruptcy was contrived and that its $18-billion debt claim is superinflated instead appears to be going along with the plan to “re-imagine” Detroit.\n<br />\nJudge Steven Rhodes yesterday announced a delay in the trial until Monday so that bond insurer Syncora Guarantee, one of the city’s largest creditors, could work out a sweet deal with the state-imposed city manager, Kevyn Orr. <br />\nThe deal would significantly reduce opposition to Orr’s draconian bankruptcy-exit plan and encourage approval by the court.\n<br />\nTom Barrow, former chairman of Michigan’s State Board of Accountancy and CEO of the largest minority-owned firm in the Midwest, was among the first to publicly raise questions about Orr’s debt calculations and his insistence, endorsed by the state, that bankruptcy was Detroit’s only way out.\n<br />\nHe joins Leid Stories today with “a heavy heart,” he says, about what’s happening to Detroit. <br />\nJudge Rhodes’ action is a harbinger of more unwarranted miseries to come, he says.<br /></p>\n"
}
