{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-shadow-banking-concerns-growing-%e2%80%93-062114/",
    "podcast": {
      "developer-note": "",
      "length": "57:09",
      "note": "",
      "size": 13717211,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/7tkprb/AlternativeVisions_062114.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Shadow Banking Concerns Growing"
  },
  "title": "Shadow Banking Concerns Growing",
  "date": "2014-06-21 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>“Dr.\n&lt;!--more--&gt;\nJack Rasmus reviews the growing role and influence of shadow banks in the global financial system, amidst recent growing concern in official circles of the need for their regulation and control to avoid another even deeper financial crash in the future. <br />\n Rasmus addresses the recent editorial of Mark Carney, chair of the UK’s central bank, the Bank of England, last week on the need to quickly regulate the shadow banking system, and the daily feature stories in the global financial paper, The Financial Times, on shadow banks following Carney’s editorial. <br />\nDr Rasmus argues that “money capital is like water flowing downhill” and cannot be regulated in the long run”. <br />\n Jack documents the explosion in liquidity and investible financial assets in the global shadow banking system since the 1960s and since the crash of 2008 in particular, and explains the fundamental linkage between the new global financial elite—the global high net worth individual investors(HNWIs)—and the shadow banks as their now preferred investing institutions as they shift their wealth recently from traditional banks to the shadow sector. <br />\n Referring to recent reports by the Boston Consulting Group and Capgemini, Jack shows how investible assets of HNWIs and the shadow banks have grown faster since 2008 than during the decade preceding the crash of 2008. <br />\nWhile global total private wealth has risen by more than $40 trillion, from $111 trillion in 2008 to more than $152 trillion today, the top 200,000 HNWIs share has risen even faster and now exceeds $53 trillion. <br />\n Jack explains how the growing concentration and acceleration of liquid, investible assets within the HNWIs and Shadow banks is building the preconditions for another, perhaps even greater, financial crash, as debt-leverage based investing and securitization grows again. <br />\n Jack notes that Bank of England Carney’s recent editorial represents a growing awareness among central bankers that their influence over the shadow banking system may be eroding even further than pre-2008, laying the ground for even greater central banks’ difficulty in re-stabilizing the global capitalist system in the event of another crash.”\n<br /></p>\n"
}
