{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-debt-relief-and-debt-forgiveness-050613/",
    "podcast": {
      "developer-note": "",
      "length": "57:12",
      "note": "",
      "size": 13728705,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/q25zpv/PRCH050613.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Debt Relief and Debt Forgiveness"
  },
  "title": "Debt Relief and Debt Forgiveness",
  "date": "2013-05-06 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Charles Eisenstein is an independent scholar who writes about civilization, economics, transpersonal psychology and the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nevolution of human cultures.  In the past he has taught at Goddard College, Penn State, and lived and worked as a translator in Mainland China for many years.<br />\n  Charles has degrees in Mathematics and Philosophy from Yale and he has been active with other visionaries to develop progressive models of business and charity based upon a deeper ethical standard. <br />\nHis two most important books, “Sacred Economics:  Money, Gift and Society in the Age of Transition” which deals with the topic of the invention of money and abandonment of the barter and gift economies. <br />\nHis most recent book  is “The Ascent of Humanity: Civilization and the Human Sense of Self.”\nHis websites are  CharlesEisenstein.net  AND  Sacred-Economics.<br />\norg\nMichael “Mike” Konczal is a Fellow at the Roosevelt Institute, a non profit organization dedicated to the creation of a New Deal in the 21st century. <br />\n His work focuses on financial reform, unemployment, inequality and progressive solutions for restoring the economy. <br />\nMike’s blog, Rortybomb, was named among the top 25 financial blogs by Time Magazine.<br />\n  His writings have appeared in the Boston Review, the American Prospect, the Nation, Slate and Dissent, and he has been guest on PBS Newshour, with Rachel Maddow, Marketplace and others.\n<br />\nHis website is RortyBomb.wordpress.<br />\ncom\nAndrew Ross is a Professor of Social and Cultural Analysis New York University where his research focuses on labor and urban studies, social and political theory, ecology and cultural studies. <br />\n He is a leading organizer of Strike Debt, a national organization that emerged from the Occupy movement in order to build resistance to all forms of debt imposed upon citizens by banks, and earlier help found the Occupy Student Debt Campaign.<br />\n  And has been active in the anti-sweatshop effort since the mid-90s. <br />\nAndrew has written or been the editor of over fifteen books, the most recent being “Bird on Fire: Lessons from the World’s Least Sustainable City” at Oxford University Press and “Nice Work If you Can Get It: Life and Labor in Precarious Times” published by NYU Press.\n<br />\nHis organization’s website is StrikeDebt.org\n<br /></p>\n"
}
