{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-090413/",
    "podcast": {
      "developer-note": "",
      "length": "1:03",
      "note": "",
      "size": 15122181,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/tx2w5p/GaryNullShow090413.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-09-04 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>American aggression against Syria - the facts we know and the credibility of Obama’s push for war\nDavid Swanson is one<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nof our most important social and political activists in the liberal progressive movement. <br />\nHe served as Dennis Kucinich’s press secretary during the 2004 presidential campaign, and as the communications coordinator for the Association of Community Organizations for Reform Now (better known as ACORN) from 2000 to 2003. <br />\n In 2005, David spearheaded the exposure of the Downing Street Memos to the attention of the US Government and he had led an ongoing campaign to impeach Bush and Cheney.\n<br /></p>\n\n<p>David is the founder of the blog WarsACrime.<br />\norg and his most books, “War is a Lie” and “When the World Outlawed War” provide refutations of every arguments to justify the wars we are embedded in and to debunk the rationale for future wars on America’s horizon.\n<br /></p>\n\n<p>Newsmaker for 911 Event in NYC: Vigil in Central Park, Sunday Sept. <br />\n8\nVigil to recognize and honor the full cost of human life of 911 and those who died afterwards as a result of US military invention</p>\n\n<p>Sunday, September 8\n1:00 to 3:00 pm\nUSS Maine Monument, near Columbus Circle in Central Park</p>\n\n<p>Show up wearing as much black as possible, but a black t-shirt and darker jeans is perfect. <br />\nPlease avoid logos and text on your clothing, as we want this to be visually appealing, and simple.\n<br />\nLogistics/details:\nWe expect one volunteer* in white to represent the victims on 9/11/2001. <br />\nMore volunteers in gray will represent the additional US deaths from the wars, and those who died from health effects, or other aspects of 9/11 and “war on terror”.\n<br />\nA large group of people dressed in black will represent the people of other nations who have died in the wars, and destruction of entire societies. <br />\nMost of these will represent people who have died in Iraq and Afghanistan, but other facets of the (pre-planned) “war on terror” will be included. <br />\nWe will form into various configurations, and take pictures to visually represent the true cost of 9/11.\n<br />\nIf you are sure you will attend, please email us, or use the form below.\n<br />\n617-299-1167\ninfo@911kills.org\nwww.facebook.com/911kills<br /></p>\n"
}
