{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-063014/",
    "podcast": {
      "developer-note": "",
      "length": "57:53",
      "note": "",
      "size": 13893172,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/vgaxm7/ProgressiveCommentaryHour_063014.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2014-07-01 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Special on US Failed Healthcare System  \nElizabeth Rosenthal, M.D. is a dermatologist and an assistant clinical<span class=\"ellipsis\">…</span>\n<!--more-->\nprofessor at Albert Einstein College of Medicine in New York City. <br />\nShe is an executive board member of the NY Metro chapter of Physicians for a National Health Program. <br />\nA very experienced advocate for single payer, upon her retirement after 40 years in private practice, Dr Rosenthal has focused her energies on the state of US health care and argued for the rationale of a single payer system. <br />\nShe has appeared on radio and television and she helped lead a fact-finding delegation to Canada to compare the Canadian system with the US.  Dr Rosenthal received in medical degree from New York University’s School of Medicine.<br />\n  \nDr Michael Huntington is a retired oncologist and the former Medical Director of the Radiation Oncology Department at Good Samaritan Hospital in Corvallis Oregon where he currently resides. <br />\nHe is a founder of the Oregon Chapter of Physicians for a National Health Program  – that now has over 18,000 member physicians who favor single payer universal health coverage. <br />\nIN 2009 Dr Huntington helped create the Mad as Hell Doctors, who toured the US speaking in favor of single payer healthcare  reform before the passing of Obama’s plan. <br />\nHe is currently the president of the Health Care for All Oregon Education Fund. \nThe Website for Physicians for a National Health Program is www.PNHP.org\nDr Julian Whitaker is one of the nation’s most prominent and respected alternative medical practitioners and a specialist in orthomolecular medicine, diabetes, heart disease, cancer and anti-aging.<br />\n  He has degrees from Dartmouth, Emory University School of Medicine and completed his orthomolecular surgical studies at the University of California at San Francisco. <br />\nHe is the founder of the Whitaker Wellness Institute in Newport Beach, California, which has served over 40,000 patients with comprehensive protocols involving diet, nutrition, exercise and lifestyle changes.<br />\n  Back in the 1970s, Dr Whitaker co-founded the California Orthomolecular Medical Society along with Nobel Prize winner Linus Pauling.\n<br />\nDr Whitaker is the author many books including “Mini Fast Diet”,  “Reversing Heart Disease” and   “Reversing Diabetes”   His websites are DrWhitaker.com  and WhitakerWellness.com<br /></p>\n"
}
