{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg"
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/infectious-myth-we-can%e2%80%99t-trust-our-eyes-052814/",
    "podcast": {
      "developer-note": "",
      "length": "59:44",
      "note": "",
      "size": 14338403,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/sp9dcw/InfectiousMyth_052714.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "We can’t trust our eyes"
  },
  "title": "We can’t trust our eyes",
  "date": "2014-05-28 00:00:00 -0600",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>Everybody who has studied biology even at a high school level has seen pictures of the internal structure of a cell or<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nother microscopic biological bodies, such as viruses. <br />\nMany of the structures we see have names, like endoplasmic reticulum or golgi apparatus. <br />\nAnd we learn about the probable function of these structures. <br />\nResearchers study them, drugs are planned based on the impact on them. <br />\nDiseases are studied based on the difference between microscope pictures of healthy versus diseased cells.\n<br />\n \nThis episode’s guest, Dr Harold Hillman has been saying for a long time, since at least 1970, that what we are seeing is only an artifact of the process of killing the cell so that it can be observed under a light microscope or electron microscope. <br />\nIt is possible to observe living cells under a light microscope, but very often cells are “fixed” (killed), dehydrated, colored and suffer other indignities that can drastically change what is seen.\n<br />\n \nDr Hillman makes two major observations that drew him to his conclusions. <br />\nFirst, in living tissues, structures move around, and the network of fibers that supposedly provides structure to the cell is smaller than the size of the objects that move around. <br />\nSecondly, structures always seem to have the same orientation under the microscope, which is impossible. <br />\nThey should have a random orientation. <br />\nThe apparent thickness of spherical objects, such as membranes, should vary with the angle of the cut. <br />\nConsequently he believes that much of what we see under a microscope is false.\n<br />\n \nFundamentally he believes that valid observations can only be taken from living systems, preferably whole organisms. <br />\nEven cell culture systems introduce many anomalies and observations from them producing structures and behaviors that cannot necessarily be extrapolated to living organisms.\n<br />\n \nDr Hillman’s ideas are potentially revolutionary but he also talks about the wall of silence he has experienced from both major journals, that most often reject his papers without explanation, and from leading scientists whose work is based on what is seen under microscopes, who refuse to talk to him.\n<br />\n \nThis censorship of radical ideas is unfortunately common in science, and belies the myth that scientists are always open to new ideas.\n<br />\n \nFor more information about the work of this scientist, see: http://harold-hillman.com<br /></p>\n"
}
