{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-233/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:17",
      "note": "",
      "size": 14467824,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/nnzrre/GaryNullShow110411.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-11-04 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Harriet Washington is one of America’s most important medical journalists and bioethicists today, investigating some of<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nthe darker recesses of American medicine and experimentation. <br />\nShe has been a fellow of ethics at Harvard Medical School and its School of Public health, a Knight fellow at Stanford University, a senior researcher at the National Center for Bioethics at Tuskegee University and a visiting scholar at the DePaul University College of Law.\n<br />\nHarriet published her critically acclaimed book “Medical Apartheid: The Dark History of Medical Experimentation on Black Americans from Colonial Times to the Present” in 2007. <br />\nIt received many major awards including the National Book Critic’s Circle Award and was named one of the Best Books by Publisher’s Weekly.\n<br />\nHer most recent book is “Deadly Monopolies: The Shocking Corproate Takeover of Life Itself and the Consequences for Your Health and our Medical Future” – which promises to be the most thorough, comprehensive text on corporate manipulation and ownership of medical science solely for profit.\n<br /></p>\n"
}
