{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-radio-commentary-hour-060313/",
    "podcast": {
      "developer-note": "",
      "length": "57:55",
      "note": "",
      "size": 13902367,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/yzdt65/PCH060313edit.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Radio Commentary Hour"
  },
  "title": "Progressive Radio Commentary Hour",
  "date": "2013-06-03 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>The recent rise in pro-vaccination efforts to mandate vaccines, remove vaccine exemption and hold parents of<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nunvaccinated children legally liable for lawsuits\nDr Toni Bark is a pediatric physician and a prestigious homeopathic and holistic doctor practicing in the Chicago area.<br />\n  This year she was awarded the honor of vice president of the American Institute of Homeopathy. <br />\nIn addition to her medical degree from Rush Medical College and pediatric internship at NYU, she has degrees in psychology, a masters in Healthcare Emergency Management from Boston University Medical School, and was by Dr Erica Fromm at the American Society for Clinical Hypnosis.\n<br />\nDr Bark is a regular guest speaker at the University of Chicago and contributed to Mary Holland’s and Louise Habakus’ important book “Vaccine Epidemic”\nHer website and blog is www.Disease-Revesal.<br />\ncom\nProf. <br />\nMary Holland is a Director of the Graduate Legal Skills Program at New York University School of Law, specializing in international human rights, public law and vaccine safety law and injury compensation. <br />\nShe has degrees  in Russian studies from Harvard, and graduate degrees in international relations and a JD from Columbia University, where she has also taught international law at its Law School. <br />\nMary is the co-author of “Vaccine Epidemic: How Corporate Greed, Biased Science and Coercive Government Threaten Our Human Rights, Our Health and Our Children.”\nBOOK:  “Vaccine Epidemic: How Corporate Greed, Biased Science and Coercive Government Threaten Our Human Rights, Our Health and Our Children.”\nWEBSITE www.VaccineEpidemic.<br />\ncom\nRobert Krakow is a New York City trial lawyer in private practice and one of the nation’s leading attorneys for vaccine damaged children through the government’s Vaccine Injury Compensation Program. <br />\nHe has handled almost every kind of civil and criminal case in all federal and state courts. <br />\nBob has been a trial lawyer for over 30 years and is a former Narcotics Bureau Chief in the Manhattan District Attorney’s Office. <br />\nHe has founded several not-for-profit organizations advocating for the rights of individuals with special needs and is a renown critic of the dominant medical belief that present vaccines are safe and effective.<br />\n  He is a graduate of George Washington University Law School and served in the past the Director of the Consumer Protection Center.\n<br />\nWEBSITE www.KrakowLawFirm.com\nAlan Phillips is an attorney practicing in Chapel Hill North Carolina.  He is one of the few American attorneys whose legal practice focuses on vaccine exemptions and vaccine waivers.<br />\n  He is an Advisory Board member of the American Chiropractic Autism Board, the World Association for Vaccine Education, and is a co-founder of the North Carolina Citizens for Healthcare Freedom. <br />\nAlan is the author of “The Authoritative Guide to Vaccine Legal Exemptions” and “Dispelling Vaccination Myths: An Introduction to the Contradictions Between Medical Science and Immunization Policy, which has been transated in serveral languages. <br />\nBoth can be found on his website\nWEBSITE www.VaccineRights.com\n<br /></p>\n"
}
