{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-091814/",
    "podcast": {
      "developer-note": "",
      "length": "53:45",
      "note": "",
      "size": 19353600,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/m6kzat/LeidStories_091814.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-09-18 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>License to Kill: Senate Hearing Peeps Plan for Syria—ISIS and Assad\nThe Leader Shipped: Sharpton Bails on Michael<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nBrown, Eric Garner Cases\nAt a US Senate hearing yesterday on President Obama’s declared war against the Islamic State(now occupying swaths of land in Iraq and Syria), Secretary of State John Kerry quickly urged a “classified” meeting with Sen. <br />\nJohn McCain (R-Arizona) when McCain insisted on a twofer: Annihilate both the jihadists and the country’s embattled president, Bashar al-Assad.\n<br />\nBut it was clear that the warhawk McCain was publicly stating the administration’s true intent in pursuing the Islamic State in Syria. <br />\nKerry disagreed only as to sequence; first, the IS terrorists, he said.\n<br />\nLeid Stories discusses the surreal and patently illegal nature of Obama’s “democratic” process of\nResidents of Ferguson, Missouri, unleased their fury at a county council meeting Tuesday night, demanding the arrest of Darren Wilson, the police officer who shot and killed 18-year-old Michael Brown of Ferguson on Aug. <br />\n9. <br />\nThe justice-seeking locals appear to be no closer to that goal than when Bloviator in Chief Al Sharpton swooped into town and commandeered their movement as the guy who can get results. <br />\nSimilarly, 10 weeks after the police-chokehold killing of Eric Garner in Staten Island, NY, no arrests have been made of the officers involved.\n<br /></p>\n\n<p>Two epic fails by Sharpton–and proceeding as planned. <br /></p>\n"
}
