{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-01-13-12/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:22",
      "note": "",
      "size": 14490720,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/wvsywz/GaryNullShow011312.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-01-13 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guest: Hans Herren\nDr.\n&lt;!--more--&gt;\nHans Herren is an internationally respected scientist and the current President of the Millennium Institute in Washington DC – a research based think tank that develops strategies for the world to move towards economic equity and environmental sustainability. <br />\n In the past he has served as the director of the International Center for Insect Physiology and Ecology in Nairobi and the Africa Biological Control Center in Benin, Africa. <br />\nHe was responsible for saving the African cassava crop in 1995 which averted Africa’s worst ever food crisis.\n<br />\nDr Herren received his doctorate from the Federal Institute of Technology in Switzerland and holds numerous awards – election to the US National Academy of Science, recipient of the World Food Award — highest award given for advancing human development – the Tyler Awrd for Environmental Achievement and the Sir and lady Rank Prize for Nutrition awarded by then Prime Minister Margaret Thatcher.\n<br />\nDr Herren’s current focus is on promoting agroecology as the among the most important means for feeding the world and is currently responsible for saving millions of African lives.\n<br /></p>\n"
}
