{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-061812/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:46",
      "note": "",
      "size": 14584686,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/2tim9d/GaryNullShow061812.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-06-18 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>A global forecast for the next 40 years – a conversation with a co-author of the controversial 1972 publication Limits<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nof Growth\nProf. <br />\nJorgen Randers is a professor of climate change studies at the Norwegian School of Business in Oslo Norway, where he specializes in the future of climate change and sustainable development. <br />\n He has served on the boards of several corporations and is a sustainability consultant  for the Norwegian government’s Commission on Low Emissions to reduce greenhouse gases. <br />\n In the 90s he served as the deputy director general of the World Wildlife Fund International. <br />\n He did is undergraduate work at the University of Oslo and received his doctorate from MIT’s Sloan School of Management.\n<br />\nProf. <br />\nRanders is perhaps best known internationally for his co-authored 1972 publication of the controversial study “Limits of Growth’, which utilized system’s analysis to predict the state of the world in 2012. <br />\nWhile mostly discredited at the time of its publication, the study has become increasingly prophetic in its accuracy and has stirred renewed interest. <br />\n A new futurist analysis looking at the world in 2052, and commemorating the 40th anniversary the original report, has just been published – “2052: A Global Forecast for the Next Forty Years.”\n<br /></p>\n"
}
