{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/jim-west-on-ultrasound-and-west-nile-virus-010614/",
    "podcast": {
      "developer-note": "",
      "length": "58:49",
      "note": "",
      "size": 21174141,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/kbfxqg/TIM_010615.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Jim West on Ultrasound and West Nile Virus"
  },
  "title": "Jim West on Ultrasound and West Nile Virus",
  "date": "2015-01-07 00:00:00 -0700",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>Jim West is a New York based activist who has critically studied a number of medical issues, including environmental<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\ncauses for Polio and West Nile Virus. <br />\nMore recently, for a book he is writing, he has investigated whether ultrasound is safe and effective, and has concluded that there is evidence that neither are true, the 5 MHz vibrations, far outside the range of normal sounds, are associated with neurological deficits, such as autism. <br />\nIt is also unnecessary for most women, as problems can be diagnosed in other ways, and he believes it should be reserved for times when it is the only diagnostic tool available. <br />\nDavid and Jim also talk about the 1999 West Nile Virus epidemic in North America, which he associated with the use of MTBE a gasoline “oxygenator” which, at that time, constituted up to 15% of the fuel purchased, depending on the time of the year. <br />\nThe disease hit birds near highways, and already sick old people, at a time of the year when the temperature made air quality worst.\n<br />\n \nFor more information consult Jim’s website: http://harvoa.org<br /></p>\n"
}
