{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-121313/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:54",
      "note": "",
      "size": 14619444,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/izjb2/GaryNullShow121313.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-12-13 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>What the traditional medical system of the father of western medicine, the Arab physician Avicenna offers to the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nprevention, diagnosis and treatment of disease with Drs Hakima Amri and Mones Abu-Asab.\n<br />\nDr Hakima Amri (Hah-keema Ahm-ree) is an Associate Professor of Biochemistry and Cellular and Molecular Biology at Georgetown University in Washington DC. <br />\nShe is the co-founder and co-director of the university’s master’s program in Complementary and Alternative Medicine. <br />\nBorn and raised in Algeria, Dr Ahm-ree received her masters and doctorate in reproductive biology and biochemistry at Pierre and Marie Curie University in Paris, and received post-doctoral training in molecular endocrinology at Georgetown University Medical Center. <br />\nHer peer-reviewed medical papers have focused on mind-body medicine, acupuncture, homeopathy, and the importance and contribution of complementary medicine in medical school curiculums.\n<br />\nDr Mones Abu-Asab (Moan-ess Aboo-Ahs-saab) is a senior scientist at the National Institutes of Health National Eye Institute where he specializes in phylogenetic systematics, bioinformatics, and nerve pathology. <br />\nIn the past he has performed research at the National Cancer Institute, George Washington University, Walter Reed, and the Smithsonian Institute, and he has taught at Beirzeit University in the Palestinian West Bank. <br />\nIn addition to his many publications on disease modeling, biomarker discovery and tumor biology, Dr Abu-Asab has also written on traditional medical systems and global warming.\n<br />\nBoth Hah-keema and Moan-nes are co-authors and translators of a new modern edition the first book of the important medical canon by the 11th century Arab physician Avicenna. <br />\nAvicenna’s canon has served as the basis for an entire traditional medical system that has been practiced for over a 1000 years, known as Unani, which is regarded by many scholars as the single most important medical treatise in western civilization along with the works of Hippocrates and Galen. <br />\nWhile most people interested in alternative medicine have heard of Chinese and the Indian Ayruveda traditional medical systems, few are familiar with the vital advances in traditional medicine and healing that took place in the Arab world and which continues to offer important and profound insights into preventing, diagnosing and treating disease. <br />\nTheir book, “Avicenna’s Medicine: A New Translation of the 11th Century Canon with Practical Applications for Integrative Health Care” was recently published by Inner Traditions.<br /></p>\n"
}
