{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/one-of-a-kind-the-significance-and-legacy-of-marion-barry-the-cosby-factor-rape-race-credibility-and-justice-112414/",
    "podcast": {
      "developer-note": "",
      "length": "54:44",
      "note": "",
      "size": 19707575,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/xiyda7/LeidStories_112414.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "One of A Kind: The Significance and Legacy of Marion Barry | The Cosby Factor: Rape, Race, Credibility and Justice"
  },
  "title": "One of A Kind: The Significance and Legacy of Marion Barry | The Cosby Factor: Rape, Race, Credibility and Justice",
  "date": "2014-11-24 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Flags are flying at half mast in Washington, D.C., to mark the death yesterday morning of Marion Barry, without<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nquestion the city’s most popular, controversial, criticized, powerful and beloved mayor. <br />\nHe was 78.<br />\n \nBarry, a four-term mayor of the district—from 1979 to 1991, and from 1995 to 1999—was the 8th Ward’s representative in the City Council when he died, bringing to an end more than 40 tumultuous years in civil-rights struggle and public life. <br />\nEven a federal conviction and six-month prison sentence on drug-use charges in 1990 did not end his political career, as was clearly intended.\n<br />\nHistorian, political researcher and commentator Dr Randy Short discusses the significance and legacy of Washington, DC’s self-described “Mayor for Life.”\n \nEntertainer Bill Cosby ended his sold-out gig in Melbourne, Fla.<br />\n, on Friday with a standing ovation from adoring fans. <br />\nWithin the industry and in the court of public opinion, however, there’s nothing to cheer about. <br />\nAn ever-growing list of women, most of them white, have come forward alleging that he had drugged and sexually assaulted or raped them, and although their claims date back as many as 50 years, they are gaining traction as having credibility, even without proof.\n<br />\nExactly 27 years ago today, a 15-year-old girl on her way home from school vanished without a trace. <br />\nShe was pulled into a car by white men who took her to a remote location, drugged her, and for four days gang-raped her, she said. <br />\nShe was semiconscious when found next to a trash container in an apartment complex. <br />\nTawana Brawley’s claim was dismissed as a “hoax.<br />\n”\nSimilarly, Nafissatou Diallo, an immigrant from Guinea, found herself the target of prosecution when the Sofitel housekeeper alleged that IMF chief Dominique Strauss-Kahn had sexually assaulted her in his hotel suite in 2011. <br />\nProsecutor Cyrus Vance Jr. <br />\nhimself asked a judge to dismiss charges against Strauss-Kahn because Diallo lacked credibility. <br />\nStrauss-Kahn later settled.\n<br />\nLeid Stories diiscusses the obvious race-based dichotomy in who is “credible.”<br /></p>\n"
}
