{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-121814-1418934045/",
    "podcast": {
      "developer-note": "",
      "length": "59:09",
      "note": "",
      "size": 21294513,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/km6xwz/LeidStories_121814.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-12-18 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>The Big Thaw: Obama Seeks Rapprochment with Cuba, but Foes Aplenty\nBenton Harbor: A Lesson About Justice and Why It’s<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nEverybody’s Business\nPresident Obama’s announcement yesterday that the United States and Cuba have agreed to pursue bilateral talks immediately to cease hostilities after 53 years sent stocks soaring, peace and political activists applauding, and diehard opponents of the communist regime to back-room drawing boards to plot their next bipartisan moves.\n<br />\nSeeking to reverse the Cold War, Kennedy-era isolation policy toward Cuba, Obama is making a bold move, arguing that isolation simply has not worked. <br />\nBut in the twilight of his tenure, and now with opposition even within his own battered party, can he pull it off?\n<br />\nDiplomatic scholar, historian, attorney and prolific author Dr Gerald Horne puts Obama’s stunning announcement in political and historical perspective.\n<br />\n \nIt isn’t getting the kind of media attention it deserves, but the controversial prosecution, conviction and sentencing of the Rev. <br />\nEdward Pinkney—a pastor in Benton Harbor, Michigan, who has been leading a decades-long fight against a corporate takeover of the almost-all-black lakeshore town—is big news. <br />\nIt’s fired up grassroots activists across the nation.\n<br />\nIn a poignant statement after Pinkney’s sentencing (Dec. <br />\n16 program), an elder-observer of Pinkney’s trial gives a stunning indictment of the criminal-justice system, the evil of capitalism, and explains why justice is everybody’s business.\n<br />\n <br /></p>\n"
}
