{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-lessons-from-prison-and-smuggled-nukes-071212/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:41",
      "note": "",
      "size": 14567445,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/9p4sp2/GaryNullShow071212.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Lessons from Prison and Smuggled Nukes"
  },
  "title": "Lessons from Prison and Smuggled Nukes",
  "date": "2012-07-12 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Reon Schutte has become an international inspirational speaker following his release after 13 years in one of the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nworld’s most renown and brutal prisons according to many international human rights organizations – the Chikurburi Prison in Zimbabwe.\n<br />\nAt the age of 18, Reon was a member of the South Africa Special Forces and specialized in cross border raids – having fought in 13 countries before being captured while on a rescue mission in Zimbabwe. <br />\nFor the next 13 years he was imprisoned under a threat by Zimbabwe President Robert Mugabe that he would die in prison.\n<br />\nToday Reon travels the world speaking about the most basic moral principles of freedom, the power of our personal choice, perseverance against the worst of odds and forgiveness and acceptance that he experienced in Chikurburi Prison.\n<br />\nHe is also the author of recent book about his spiritual lessons: Set Yourself Free: Breaking Out of Your Personal Prison through the Power of Choice.\n<br />\nNetanyahu legacy of smuggling nuclear materials and the US-Israeli nuclear connection\nGrant F. <br />\nSmith is director of the Washington, DC based Institute for Research: Middle Eastern Policy, an independent nonprofit that studies US policy formulation toward the Middle East. <br />\nGrant launched IRmep was on Capitol Hill as a warning about the grave dangers of adopting a 1996 neoconservative plan for involving the US military more deeply across the Middle East. <br />\nHis research and analysis about trade, law enforcement, and opportunity costs have appeared in Antiwar.<br />\ncom, the Financial Times of London, Arab News, The Wall Street Journal, The Washington Post, The Jewish Daily Forward, The New York Times and specialty publications such as the US State Department’s Washington File.\n<br />\nBefore joining IRmep, Grant was a research program manager at the Boston based Yankee Group Research, Inc. <br />\nand taught courses in finance, research, and marketing for five years at CESA in Bogotá, one of Colombia’s top\\ranked business schools. <br />\nHe is also the author of a new book “Divert!<br />\n: Numec, Zalman Shapiro and the Diversion of US Weapons Grade Uranium into the Israeli Nuclear Weapons Program” which is about the smuggling of nuclear material.\n<br /></p>\n"
}
