{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-the-arab-world-031914/",
    "podcast": {
      "developer-note": "",
      "length": "1:02:14",
      "note": "",
      "size": 14939847,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/4698kr/GaryNullShow031914.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Arab World"
  },
  "title": "The Arab World",
  "date": "2014-03-19 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The coming collapse of the Gulf monarchies and the reshaping of the Arab world\nDr.\n&lt;!--more--&gt;\nChristopher Davidson is a Reader in Middle East Politics in the School of International Affairs at Durham University in the UK and an expert in the politics, economics and sociology of the Arab Gulf States. In the past he has been an assistant professor at Zayed University on its United Arab Emirates and Dubai campuses. He is also consults for the UN’s Alliance of Civilizations.<br />\n Dr Davidson’s most recent publication – “After the Sheikhs: The Coming Collapse of the Gulf Monarchies” predicts that the pieces are in place for the downfall of the autocratic ruling families across the Gulf States during the next 2 to 5 years. <br />\nThe book has been reviewed as among the Most Significant Books of 2013 by the Foreign Policy Association and among the top ten best books on the Middle East by Foreign Policy journal and the Al-Monitor.<br />\n The Economist recognizes him as one of the most knowledgeable academics writing about the Gulf region. <br />\nChristopher has a BA and Masters from the University of Cambridge and received an additional masters and a doctorate from the University of St. <br />\nAndrews in Scotland.<br /></p>\n"
}
