{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-whats-next-for-american-labor-112112/",
    "podcast": {
      "developer-note": "",
      "length": "53:57",
      "note": "",
      "size": 12951615,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/6zp4as/AlternativeVisions112112.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "What’s Next for American Labor?"
  },
  "title": "What’s Next for American Labor?",
  "date": "2012-11-21 00:00:00 -0500",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>With wages of US workers falling for more than a decade now, chronic long term problems of job creation in the US,<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nattacks on public workers and unions intensifying, and union membership continuing to decline—‘What’s Next for American Labor” is the topic of today’s November 22, 2012  ‘Alternative Visions’ radio show.<br />\n  Dr Jack Rasmus welcomes special guests—long time union officers and activists, Jerry Gordon (UFCW) and Dennis Serrette (CWA), to discuss what should be the future direction of American labor and unions after having spent $400 million to elect politicians in each of the last two national election cycles, 2008 and 2012, and thus far having little to show for it.\n<br />\nJerry Gordon is a long time activist in the antiwar, labor, and civil rights movements, and has been an International Representative for the United Food and Commercial Workers, UFCW, for 25 years. <br />\nHe is currently the national secretary of the recently formed Emergency Labor Network, ELN, a grass roots organization of union and community leaders and activists dedicated to moving American labor and unions in a more progressive direction.\n<br />\nDennis Serrete is a 49 year veteran of the US union movement, a former National Director, now retired, of the Communications Workers of America, CWA, a past president and vice president of CWA locals 2108 and 1101 in New York, a founder of the Coalition of Black Trade Unions, CBTU, in 1972 and also a member of the Emergency Labor Network, ELN, today.”\n<br /></p>\n"
}
