{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-091813/",
    "podcast": {
      "developer-note": "",
      "length": "58:47",
      "note": "",
      "size": 14108317,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/cdfcdx/AlternativeVisions091813.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "The AFLCIO Convention & New Union-Community Alliances"
  },
  "title": "The AFLCIO Convention & New Union-Community Alliances",
  "date": "2013-09-18 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr.\n<!--more-->\nJack Rasmus welcomes two long-time union officers, Steve Early of the CWA and Carl Finamore of the Machinists, who attended the recent AFLCIO convention where delegates recently discussed and voted on whether to bring community groups (NAACP, La Raza, Sierra Club, etc.) into the union federation as a new kind of membership.<br />\n  Both Steve and Carl have more than 30 years each of experience in the US labor movement, which they bring to the discussion. <br />\nJack introduces the show and discussion with an explanation of the dimensions of the deep decline in union labor in the USA, its failing organizing and bargaining strategies at the company level and the political level with its alliance with the Democratic Party, as well as the consequences of both. <br />\n Steve and Carl discuss the resolution and scope of the decision at the AFLCIO convention to forge a deeper partnership with community organizations. <br />\nHow can union labor stop and reverse its slide? <br />\nJack and guests debate whether some kind of new grass roots organizational structure uniting labor and community organizations must occur if union labor in the US is to survive and grow.\n<br />\n \nSteve Early is a retired, long time staff representative for the Communications Workers of America and an author of several recent books on the US union movement today, including ‘Embedded With Organized Labor’ and ‘The Civil Wars in US Labor’.<br />\n  Carl Finamore is a former president of Local 1781 of the machinists union representing workers in the airlines industry and a frequent writer to various magazines and blogs on labor and other issues. <br />\nCheck out both their recent articles on the widely read blog, Counterpunch.org, on the recent AFLCIO convention and other labor topics<br /></p>\n"
}
