{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-012615/",
    "podcast": {
      "developer-note": "",
      "length": "58:43",
      "note": "",
      "size": 21142749,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/acdiyw/BAR012615.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2015-01-26 00:00:00 -0700",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>The $10 billion pledged by international donors for Haiti earthquake relief, five years ago, was “enough money to give<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nevery Haitian a check for $1,000,” said Jake Johnston, principal author of the Center for Economic and Policy Research report, “Haiti by the Numbers, Five Years Later.” Yet, 300,000 people are living on the outskirts of Port-au-Prince in appalling conditions, while “only 9,000 homes have been built by the international response.<br />\n” Cholera, brought into the country by United Nations soldiers, is unchecked, and a US-backed president rules largely by decree. <br />\nMost American aid money was spent on US firms, said Johnston. <br />\n“Less than one percent of it went to Haitian organizations or Haitian government institutions. <br />\n ”</p>\n\n<p>Newark to Get Cop Review Board\n Newark, New Jersey, Mayor Ras Baraka unveiled a draft plan for the city’s first Citizens Complaint Review Board, last week. <br />\nThe proposed board would have the power to subpoena witnesses and recommend punishment of abusive officers. <br />\nHowever, the police director could, under some circumstances, veto the board’s recommendations – a serious point of contention, according to Larry Hamm, chairman of the People’s Organization for Progress. <br />\n“We’re going to need the most effective review board possible, in order to change p  olice behavior,” said Hamm. <br />\n“They see themselves as special, above the law, and above reproach. <br />\nThey don’t think citizens have the right to judge them.<br />\n”\nCharges Dropped Against Crusading Black Educator\nThree years ago, Professor Jahi Issa was arrested while observing a student protest against the rapid “whitening” of Delaware State University, a nominally Black institution. <br />\nA judge this month overrode prosecution objections and dismissed the misdemeanor resisting arrest charge. <br />\n“My attorney wrote that the president of Delaware State and his chief of police need to go see Selma, the movie, because they neither understand nor respect history,” said Dr Issa, who lost his job teaching history and Africana Studies. <br />\n“If this is the new crop of HBCU leadership, then we are seriously in trouble.<br />\n”\nMumia on MLK’s Ordeal\nDr Martin Luther King Jr. <br />\nwas “hounded and tormented” by the United States government “until his dying day,” said Mumia Abu Jamal, the nation’s best known political prisoner, in a report for Prison Radio. <br />\nThe pressure increased after King’s 1967 Riverside Church speech in which he denounced the Vietnam War “and criticized capitalism.<br />\n”\nUS Constitution Legalizes Slavery\nAnother correspondent for Prison Radio, Kerry Shakaboona Marshall, who has served more than 25 years of a life sentence imposed when he was a juvenile, said the US government has “perpetrated a fraud” on the public for the pat 150 years, with the claim that the 13th Amendment outlawed slavery. <br />\n“While the 13th Amendment abolished the chattel labor form of slavery, it simultaneously legalized slavery as a punishment for a criminal offense conviction,” said Marshall. <br />\nThe result was “penal slavery, the prison slave labor system.<br />\n”\nRev. <br />\nEdward Pinkney Awaits Hearing in Prison\nBenton Harbor, Michigan’s imprisoned community leader, Rev. <br />\nEdward Pinkney, is “doing very well, they have not broken his spirit,” said his wife, Dorothy. <br />\nRev. <br />\nPinkney was sentenced to 2 ½ to 10 years in prison for an elections petition offense stemming from a campaign to recall the local mayor, an ally of the giant Whirlpool corporation, which dominates the mostly Black town. <br />\nA hearing is scheduled for February 24 on two defense motions, including that one of the jurors was a close associate of the prosecution. <br />\nVeteran activist Larry Pinkney – no family relation – is media contact for Rev. <br />\nPinkney. <br />\n“He’s not getting his mail, they’ve moved him way up to Marquette, Michigan,” said Larry Pinkney. <br />\n“But the brother is a warrior, he’s a fighter, he’s standing tall.”<br /></p>\n"
}
