{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:11",
      "note": "",
      "size": 14443632,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/wzdsyh/ProgressiveCommentaryHour112111.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2011-11-21 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Guests: Dr. Samuel Epstein, Darrell Rogers, and Dr. Len Saputo\nDr.\n&lt;!--more--&gt;\nSamuel Epstein is a leading international authority on the causes and prevention of cancer. <br />\nHe is professor emeritus of Environmental and Occupational Medicine at the University of Illinois School of Public Health and the Chairman of the Cancer Prevention Coalition. <br />\n Frequently he has been invited to give testimony to Congressional hearings as an expert witness on the cancer risks of pesticides, petrochemicals, cosmetic products, rBGH hormone in milk, sex hormones in meat, and irradiated food. <br />\nHe has also served as a consultant to the US Senate Committee on Public Works.\n<br />\nDr Epstein is a sharp critic of the close relationship between cancer drug makers and our professional and government health agencies, in particular the American Cancer Society and the National Cancer Institute. <br />\n He has written 11 books and authored over 250 peer reviewed papers dealing environmental carcinogens in our everyday products and the reasons for why we are in fact losing the war on cancer. <br />\nHe has also received numerous awards from such organizations as the National Wildlife Federation, the Environmental Justice Award, Bioneers Award, and the Right Livelihood Award (the Alternative Nobel Prize).\n<br />\nAmong his more recent books is “National Cancer Institute and American Cancer Society:  Criminal Indifference to Cancer Prevention and Conflicts of Interest.<br />\n”\nDarrell Rogers is the Communications Director with the Alliance for Natural Health- USA, which has been at the forefront for spearheading amendments to the Senate 510 Food Safety Bill, but ultimately wants it defeated. <br />\nMatt has a higher degree in Government studies from Catholic University in Washington DC and has worked in public policy and public affairs issues with Senatorial campaigning and on Capitol Hill. <br />\n He has also worked as a political affairs specialist for one of the largest political consulting firms in DC. <br />\n www.ANH-USA.<br />\norg\nDr Len Saputo is a board certified physician in internal medicine and the Founder and Medical Director of Health Medicine Foundation in California, a nonprofit education foundation of integral healthcare providers and community leaders dedicated to a holistic vision of wellness. <br />\n  He has been practicing since 1965 after graduating from Duke University’s medical school.\n<br />\nHe has co-authored several books on natural wellness health, his most recent being “A Return to Healing: Radical Health Care Reform and the Future of Medicine” which is a detailed critique of the dominant conventional medical establishment and paradigm, how it is a dismal failure, and what an integral approach to healing can provide to make it more humane, healthy and sustainable.\n<br />\nLen also hosts the program “Prescriptions for Health” on the Progressive Radio Network.\n<br /></p>\n"
}
