{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-latin-america%e2%80%99s-%e2%80%98made-in-usa%e2%80%99-recessions-100414/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:39",
      "note": "",
      "size": 21834778,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/s8ztry/AlternativeVisions100414.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Latin America’s ‘Made in USA’ Recessions"
  },
  "title": "Latin America’s ‘Made in USA’ Recessions",
  "date": "2014-10-04 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus explains how the emerging recessions in Latin American economies—especially in Brazil, Argentina, and<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nVenezuela—are the direct consequence of recent shifting of US economic policies over the past year.<br />\n  Three forces are now converging to drive LATAM economies, especially the big 3 above, into yet another region-wide recession, which almost certainly will now worsen: 1) China’s demand for Latin American commodities, resources, and semi-finished imports is slowing as the China economy itself continues to slow; 2) prior massive free money inflows to Latin America from the US and other advanced economy central banks, which occurred between 2010-13 as a result of USA ‘QE’ and zero rate monetary policies by the US Federal Reserve, are now being reversed—engineering money flows back to the US economy from Latin America and other emerging markets. <br />\nMeanwhile, a third US policy change is being overlaid on the first two, further exacerbating LATAM economic recessions, in the form of additional negative economic pressure is imposed by the US on Argentina and Venezuela in particular (and potentially Brazil as well pending outcome of elections there) even as their economies slip into recession.   Jack explains how shifting US economic policy represents, in effect, efforts by USA policy makers to support a still weak USA economic recovery at the direct expense of emerging market economies, especially in Latin America.<br />\n  The USA has thus now begun ‘exporting’ its economic weakness to other economies, while simultaneously taking advantage of the recessions in Argentina and Venezuela to further destabilize those economies for political purposes as well. <br />\nMeanwhile, global capitalist economies everywhere have entered a phase where they are attempting to grow their own economies at the expense of their capitalist neighbors, marking a new more desperate stage in the global economy’s flagging recovery.\n<br /></p>\n"
}
