{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-030515-1425595131/",
    "podcast": {
      "developer-note": "",
      "length": "59:02",
      "note": "",
      "size": 21257294,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/fbuwvm/LeidStories_030515.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2015-03-05 00:00:00 -0500",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Venezuela In Crisis: Chavez Coup 2.0 in the Making?\n&lt;!--more--&gt;\nEach day the news out of the Bolivarian Republic of Venezuela, it seems, gets worse. <br />\nA shattered economy, out-of-control inflation, pervasive food shortages and mounting protests in the streets have kept President Nicolás Maduro on edge and on the defensive putting out fires since taking the country’s helm after the death of his predecessor, Hugo Chávez, exactly two years ago today.\n<br />\nVenezuela’s internal upheavals and unrelenting crises are neither accidental nor natural, Maduro has declared, pointing the finger of blame at the hemisphere’s hegemon, the United States. <br />\nChavez, too, had accused the United States of instigating a coup against him on April 11, 2002. <br />\nMilitary loyalists and popular support restored him to power within 48 hours.\n<br />\nOur guest, attorney Eva Golinger, an adviser to both Chavez and Maduro, says the presidents’ accusations against the United States are based on hard evidence. <br />\nFurther, she says in a wide-ranging interview, the Obama administration “is trying to complete with Maduro what President [George] Bush had attempted with Chavez.”\nGolinger, author of Bush Versus Chavez: Washington’s War on Venezuela, and co-author (with Saul Landau) of The Chavez Code: Cracking US Intervention in Venezuela, discusses the US role in Venezuela’s current crisis. \n <br /></p>\n"
}
