{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-drone-warfare-092612/",
    "podcast": {
      "developer-note": "",
      "length": "57:5",
      "note": "",
      "size": 13883768,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/jm9zgq/GaryNullShow092612.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "Drone Warfare"
  },
  "title": "Drone Warfare",
  "date": "2012-09-26 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>The US’ Drone Warfare and killing by remote control\nMedea Benjamin is a cofounder of the anti-war feminist organization<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nCodepink and a co-founder of the international human rights organization Global Exchange. <br />\n For the past 20 years she has been an advocate for social justice. <br />\nNew York Newsday described Medea as “one of America’s most committed — and most effective — fighters for human rights” and the Los Angeles Times called her “one of the high profile leaders of the peace movement.<br />\n” In 2005 she was among exemplary women nominated to receive a collective Nobel Peace Prize for their efforts to promote peace. <br />\n She has been at the forefront of protesting the war efforts of Bush and Obama and her activities in the Gaza Freedom March and flotilla, and her being arrested in Pakistan for supporting silenced lawyers seeking human rights policies.\n<br />\nIn the past she has worked as an economist and nutritionist for the United Nations and World Health Organization. <br />\nShe has diligently fought the World Trade Organization and was responsible for bringing attention to Nike’s and an additional 27 US clothing retailers for capitalizing on sweatshop labor in developing countries.\n<br />\nShe is the author of the recent book:  “Drone Warfare: Killing by Remote Control” which goes into detail about this stealth weaponry, and its role in shaping US military foreign policies in many nations around the world.\n<br />\nDr Jack Rasmus is a professor of political economics at St. <br />\nMary’s College and Santa Clara University in California.<br />\n  Prior to teaching, he was an economic analyst for several global corporations and an organizer, negotiator and business representative for several labor unions. <br />\nAt one time he was elected at the National First Vice President of the National Writers Union.\n<br />\nIn addition to his economic profession, Dr Rasmus is a playwright and author of fictional works dealing with social and labor struggles, and the owner fo Kyklos Productions. <br />\nBesides his articles for progressive news and commentary sources, he is the author of several books, including “Epic Recession and Global Financial Crisis” which describes the origins and repercussions of increasing financial instability in America.\n<br />\n www.JackRasmus.com<br /></p>\n"
}
