{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/gary-null-show-%e2%80%93-020615/",
    "podcast": {
      "developer-note": "",
      "length": "58:04",
      "note": "",
      "size": 20909880,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/zidc9x/GaryNullShow_020615.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2015-02-06 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>First Guest: Prof. Mary Holland\nProf.\n&lt;!--more--&gt;\nMary Holland is a Director of the Graduate Legal Skills Program at New York University School of Law, specializing in international human rights, public law and vaccine safety law and injury compensation. <br />\nShe also has a son who regressed into autism following the MMR vaccine. <br />\nYesterday she was a guest on Democracy Now along with Dr Paul Offit, the guru celebrity of the pro-vaccine industry.  Since Offit was the last to be interviewed during yesterday’s program, we have invited her on to respond to Offit’s comments.<br />\n  Mary has degrees  in Russian studies from Harvard, and graduate degrees in international relations and a JD from Columbia University, where she has also taught international law at its Law School. <br />\nMary is the co-author of “Vaccine Epidemic: How Corporate Greed, Biased Science and Coercive Government Threaten Our Human Rights, Our Health and Our Children.”  The website is VaccineEpidemic.<br />\ncom\nSecond Guest: Dr Sherri Tenpenny\nDr Sherri Tenpenny is an osteopathic medical physician who incorporates integrative medicine in her practice for treating allergies, childhood illnesses and women’s health issues. <br />\nShe is also one of the country’s most knowledgeable and outspoken physicians opposing the efficacy and safety of vaccines.<br />\n  She is the founder and lead medical practitioner of the Tenpenny Integrative Medical Center in Strongsville, Ohio.\n<br />\nShe has authored several books on vaccines including, “Fowl: Bird Flu, It is Not What You Think” and “Saying No to Vaccines: A Resource Guide for All Ages”, and her recent DVD – “Flu and Flu Vaccines: What’s Coming Through That Needle” is an invaluable resource for educating people on influenza and the flu vaccines.  Her websites are DrTenpenny.com  and TenpennyIMC.com<br /></p>\n"
}
