{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-the-%e2%80%98dud%e2%80%99%e2%80%94the-2nd-ukraine-imf-deal%e2%80%99-updates-on-greece-debt-negotiations-021415/",
    "podcast": {
      "developer-note": "",
      "length": "58:34",
      "note": "",
      "size": 21088564,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/d92kur/AlternativeVisions_021415.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "The ‘Dud’—The 2nd Ukraine-IMF Deal’ + Updates on Greece Debt Negotiations"
  },
  "title": "The ‘Dud’—The 2nd Ukraine-IMF Deal’ + Updates on Greece Debt Negotiations",
  "date": "2015-02-14 00:00:00 -0700",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus provides updates on the continuing negative effects of the Eurozone QE announced last month, the Greek<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nDebt-Troika negotiations over the past week, and details on last week’s announced IMF-Ukraine bailout #2. <br />\nIn the first half hour, Jack describes how the Eurozone QE is intensifying currency wars and forcing other Euro countries into introducing negative interest rates, which will have major negative economic effects. <br />\nThen an update on how the Greeks are succeeding to push the Troika closer to their (Greek) bargaining position, to provide them bridge loans and renegotiate the debt based on an ending of austerity. <br />\nIn the second half of the hour, Jack provides details on the 2nd IMF bailout deal for Ukraine also just announced this past week. <br />\nHow the bailout package has risen from $17.<br />\n1 last April 2014 now to $40 billion—now approaching Jack’s forecast last April that Ukraine would need a minimum of $50 billion. <br />\nJack’s 2014 forecast of a collapse of Ukraine’s GDP of 10%, of its currency, and other indicators are now also realized. <br />\nThe second IMF bailout will not stop the decline of the Ukraine economy either, Jack argues.<br />\n  The show concludes with an analysis of the ‘Grand Strategies’ of the USA, Germany-France, and Russia with regard to the Ukraine, the conflict over which has always been a proxy for a larger strategic fight between the USA and Russia, over the future of Europe it self and which way Europe will orient economically in the decades ahead.\n<br /></p>\n"
}
