{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-061314/",
    "podcast": {
      "developer-note": "",
      "length": "1:03:24",
      "note": "",
      "size": 15219775,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/swvmqb/GaryNullShow_061314.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-06-13 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Gary delivers the fresh updates in health and healing, plus environmental and public health news and commentaries.\n&lt;!--more--&gt;\nAlso, Call to action on GMO labeling Bill in NY with Ronnie Cummins.\n<br />\nRonnie Cummins is the Executive Director of the Organic Consumers Association and author of “Genetically Engineered Foods: A Self Defense Guide for Consumers.<br />\n”  With almost  a million members, the Association is a non profit public interest organization campaigning for sustainable health and justice on critical issues of food safety, industrial agriculture, genetic engineering, Fair Trade and environmental sustainability. <br />\nRonnie has been a life-long activist in the human rights, anti-nuclear, labor and agricultural movements. <br />\nIn the 1990s he worked closely with futurist and activist Jeremy Rifkin on Economic Trends and Rifkin’s “Beyond Beef” campaign.  His current goal through the Association is to increase organic agriculture to at least 30 percent by the year 2015 and to further a global moratorium on genetically engineered crops.<br />\n  Ron’s writings appear on numerous alternative, independent news outlets. <br />\nHis website is www.OrganicConsumers.org<br /></p>\n"
}
