{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-011314/",
    "podcast": {
      "developer-note": "",
      "length": "56:09",
      "note": "",
      "size": 13479288,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/jwde4y/BAR011314.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-01-13 00:00:00 -0700",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>The Friends and Foes of Amiri Baraka\nLarry Hamm, chairman of the Newark, New Jersey-based People’s Organization for<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nProgress, wants there to be no mistake: His friend and mentor Amiri Baraka, the activist/poet/public intellectual who died last week at age 79, “was a revolutionary. <br />\nIn the days ahead, until he’s buried, everybody is going to look back upon him with fond remembrances. <br />\nBut, for some of those people, if Amiri Baraka was coming down the street, they would cross to the other side.<br />\n” Baraka’s funeral will be held on Saturday, in Newark.\n<br />\nWar on Poverty was Underfunded and Restrained\nFrom the very beginning of President Lyndon Johnson’s War on Poverty, launched 50 years ago, “there was a push to keep the lid on new spending on anti-poverty programs – and that only got worse with the funneling of money to Vietnam,” said Alice O’Connor, professor of history at the University of California at Santa Barbara and author of Poverty Knowledge: Social Science, Social Policy and the Poor in Twentieth Century US History. <br />\nAlthough newly created federal agencies were mandated to give the poor a voice in anti-poverty efforts, “there was pressure from the localities to keep that money out of the hands of groups that were going to challenge the status quo,” said O’Connor.\n<br />\nFrom Many Struggles, One\nProgressive forces can achieve victory by building a “movement of movements,” said Margaret Flowers, co-author with Kevin Zeese of the article “Task of a People-Powered Movement for 2014.<br />\n” Flowers and Zeese, directors of It’s Our Economy, have identified ten “fronts of struggle,” ranging from health care to jobs to peace. <br />\n“Our task is to help connect these individual struggles to the broader struggle,” said Flowers.\n<br />\nWorthless Democrats\nPresident Obama’s recent promises about combating economic inequality are meaningless rhetoric,” said Doug Henwood, editor of the Left Business Observer. <br />\n“The problem is, the Democrats are now so thoroughly a Wall Street party, that they can’t do anything serious” to help poor and working people. <br />\n“I expect nothing out of the Democratic Party, nationally or locally.<br />\n” Real social progress will require grassroots mobilization, said Henwood.\n<br />\nThe Washington Post as a CIA Asset\nRootsAction.<br />\nOrg co-founder Norman Solomon will this week present a petition to editors of the Washington Post, demanding the newspaper inform its readers of owner Jeff Bezos’ intimate business relationship with the CIA. <br />\nBezos is also the billionaire owner of Amazon, which last year concluded a $600 million contract with the CIA. <br />\n“The responsibility of the CIA is to keep secrets, and the responsibility of journalism is to expose secrets,” said Solomon.Post journalists should be worried that it become commonly known as “being in bed with the CIA.<br />\n”\nTutu Wrong About ICC, Says Herman\nEdward Herman, professor emeritus at the University of Pennsylvania’s Wharton School, takes issue with former South African archbishop Desmond Tutu’s contention that the International Criminal Court is a force for justice in Africa. <br />\nThe ICC only indicts Africans, and only those Africans that are not allied with the United States, said Herman, co-author of The Politics of Genocide. <br />\n“The bias has been blatant.<br />\n” US allies Uganda and Rwanda invaded the Democratic Republic of Congo and “killed literally millions of people,” with no response from the ICC, said Herman.\n<br />\nMumia: Support the Dallas Five\nOn January 21, trial begins for five Pennsylvania inmates charged with riot and incitement stemming from a 2010 protest against violence by guards at a prison in the town of Dallas. <br />\nThe Dallas Five “are fighting for their lives,” said political prisoner Mumia Abu Jamal, reporting for Prison Radio.<br /></p>\n"
}
