{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-030512/",
    "podcast": {
      "developer-note": "",
      "length": "1:01",
      "note": "",
      "size": 14640048,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/2sedja/ProgressiveCommentaryHour030512.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-03-06 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Our delusional democracy and the failure of our Two-Party System\nJoel Hirschhorn is the author of Delusional Democracy:<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nFixing the Republic without Overthrowing the Government” and is a co-founder of Friends of the Article V Convention. <br />\nHe is a frequent commentator and writer on the need for a second American Revolution to restore American democracy and the need for reform constitutional amendments. <br />\nJoel is a former senior official at the Congressional Office of Technology Assessment and National Governors Association, and a former full professor at the University of Wisconsin, Madison.\n<br />\nJim Garrison is the co-founder and president of Wisdom University and President of the State of the World Forum as part of the Gorbachev Foundation, which he co-founded. <br />\nIn 2000, he initiated the launch of the Commission on Globalization which challenged the existing global governance system and gathered leaders together to define viable alternatives. <br />\nJim has graduate degrees in religion and theology from Harvard and Cambridge universities, and is the author of “Civilization and the Transformation of Power” and “America as Empire: Global Leader or Rogue Nation”.\n<br /></p>\n"
}
