{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-are-us-unions-today-at-a-strategic-impasse-part-2-121113/",
    "podcast": {
      "developer-note": "",
      "length": "56:18",
      "note": "",
      "size": 13515546,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/upvs5/AlternativeVisions_121113.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Are US Unions Today at a Strategic Impasse, Part 2"
  },
  "title": "Are US Unions Today at a Strategic Impasse, Part 2",
  "date": "2013-12-11 00:00:00 -0500",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Continuing the discussion initiated on November 20 with guests with long-time grass roots experience in the American<span class=\"ellipsis\">…</span>\n<!--more-->\nunion movement, Dr Jack Rasmus invites Jerry Gordon and Alan Benjamin, to discuss the general topic: Have the basic strategies of US Labor employed since the 1980s now reached an impasse and dead end?. Both guests have more than 40 years of experience each in the union movement, and offer their comments on the state, and future direction, of union labor’s current political, industrial (bargaining, organizing, strikes), and community alliance strategies.<br />\n  Topics addressed include the recent Chicago teachers strike, the fight to protect jobs at Boeing in Seattle, the recent AFLCIO convention, organizing the south, labor’s increasingly shabby treatment by the Democratic Party, and other examples, as discussants take on the topic of ‘what needs to change strategically and organizationally for union labor in America to reverse its decades-long decline.\n<br />\nThe theme of today’s show will continue in coming weeks. <br />\nTune in next wednesday, December 18, when Jack interviews long-time union strategist, Ray Rogers.\n<br />\nJerry Gordon is a former representative of the United Food &amp; Commercial Workers for decades, now retired, and currently secretary of the Emergency Labor Network and Labor Fightback coalition.<br />\n  Alan Benjamin is a long time delegate to the San Francisco Central Labor Council, AFLCIO, a member of OPEIU, and active in labor immigration coalition work.\n<br /></p>\n"
}
