{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-36/",
    "podcast": {
      "developer-note": "",
      "length": "4:01:51",
      "note": "",
      "size": 58043232,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/ttxz9x/GaryNullShow012711.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-01-27 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Wakefield Files– the case against John Deer  and the British Medical Journal\nDr Andrew Wakefield is an academic<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\ngastroenterologist specializing in inflammatory bowel disease &amp; the measles-mumps-rubella vaccine or MMR. <br />\nHe is a former Fellow of the Royal College of Surgeons &amp; has published over 130 original scientific papers &amp; book chapters. <br />\nIn 1998, he and his colleagues at the Royal Free Hospital in London reported a novel inflammatory bowel disease in children with developmental disorders such as autism.<br />\n  \nDr Wakefield lost his job at the Royal Free Hospital, his career and medical license. <br />\nIn May, timed with the release of his memoir “Callous Disregard: Autism and Vaccines, The Truth Behind the Tragedy” — the UK issued a release that he is officially banned from practicing medicine. <br />\nDr Wakefield continues to conduct his research in the effects of the MMR vaccine &amp; the causes for autism spectrum disorders. <br />\n www.Callous-Disregard.<br />\ncom\nDr Edward Yazbak-Board Certified in Pediatrics, Fellow of the American Academy of Pediatrics, &amp; Medical Expert for the Social Security Administration Office of Disability Adjudication and Review. <br />\nHe has practiced pediatrics for 35 years, and since 1998 has researched the prevalence and causes of auto-immune regressive autism and vaccine injury. <br />\nHe has written extensively on those subjects and testified as a medical expert.<br />\n  Dr Yazbak’s grandson is autistic and was treated at the Royal Free Hospital by Drs Wakefield and Walker-Smith\nIsabella Thomas has two autistic children who were part of the original 12 patients in the Royal Free study reported in the Lancet by Drs Wakefield, Walker Smith, Murch and colleagues. <br />\nIsabella has 4 sons — 2 who received the MMR vaccine and are now have autism and serious bowel problems, and two sons who did not receive the MMR and are fine. <br />\n Isabella is also the main parent Brian Deer has been most focused on. <br /></p>\n\n<p>Jim Moody is Dr Wakefield’s US attorney and the current director of the family advocacy organization The National Autism Association, and the research think tank Safeminds, which provide excellent resources on autism and vaccine related issues. <br />\n  He consults with the Petitioners Steering Committee on autism cases in Vaccine Court. <br /></p>\n\n<p>Clifford Miller is a lawyer in Kent, UK and a solicitor of the supreme court of England civil proceedings, who has specialized in intellectual property, anti-trust and legal issues in the electronics and communications fields. <br />\n Mr Miller is a graduate physics and former examining university lecturer in law. <br />\n Over the years he has been active in investigating vaccine issues and science. <br /></p>\n\n<p><br /></p>\n"
}
