{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-major-cabinet-changes-for-obama%e2%80%99s-second-term-%e2%80%93-011413/",
    "podcast": {
      "developer-note": "",
      "length": "56:52",
      "note": "",
      "size": 13648666,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/fqvnms/PCH011413.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Major Cabinet changes for Obama’s second term"
  },
  "title": "Major Cabinet changes for Obama’s second term",
  "date": "2013-01-14 00:00:00 -0500",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Ray McGovern served as an Army intelligence officer and a CIA analyst from the administration of John F.\n&lt;!--more--&gt;\nKennedy to that of George H. <br />\nW. <br />\nBush. <br />\nAmong his duties was preparing the President’s Daily Brief, which he briefed one-on-one to President Ronald Reagan’s most senior national security advisers. <br />\nSince retiring from government service, he has been one of our nation’s most vocal peace activists and journalists. <br />\nIn 2003, he helped create Veteran Intelligence Professionals for Sanity (VIPS) to expose the way intelligence was being falsified to “justify” war on Iraq.\n<br />\nRay’s opinion pieces appear in many leading newspapers here and abroad, including a major section in an important book, “Neocon’d Again” dealing with America’s war in Iraq.<br />\n  He holds degrees in theology and philosophy from Fordham University, is a graduate from Harvard Business School and has a certificate of theology from Georgetown University.\n<br />\nProf.<br />\n  Stephen Zunes is a Professor of Politics and International Studies at the University of San Francisco, where he chairs the program in Middle Eastern Studies. <br />\nHe is recognized as one the country’s leading scholars of US Middle East policy and of strategic nonviolent action, Professor Zunes received his PhD. <br />\nfrom Cornell University and previously served on the faculty of Ithaca College, the University of Puget Sound, and Whitman College. <br />\nHe serves as a senior policy analyst for the Foreign Policy in Focus project of the Institute for Policy Studies, an associate editor of Peace Review, a contributing editor of Tikkun, and chair of the academic advisory committee for the International Center on Nonviolent Conflict.\n<br />\nAmong his publications, the most recent is “Western Sahara: War, Nationalism and Conflict Irresolution”\nFor the past 30 years, Robert Scheer has built a reputation as one of the nation’s most honest and insightful political writers. <br />\nFrom 1976 to 1993 Robert was a national correspondent for the Los Angeles Times, reporting on the Cold War, arms control, and national politics.  He is a professor at the University of Southern California Annenberg School of Journalism and editor in chief of the Webby Award winning internet magazine Truth Dig.com.  He is regularly heard on the NPR program “Left Right and Center” on KCRW in Santa Monica.<br />\n  Robert has a graduate degree in economics from UC Berkeley and has been a fellow at Yale and Stanford universities.\n<br />\n His latest r book “The Great American Stickup: How Regan Republicans and Clinton Democrats Enriched Wall Street While Mugging Main  Street” is one of the more concise publications outlining the causes and intrigues that brought forth our great recession\n BOOK:  “The Great American Stickup: How Regan Republicans and Clinton Democrats Enriched Wall Street While Mugging Main  Street”\n<br /></p>\n"
}
