{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-102014/",
    "podcast": {
      "developer-note": "",
      "length": "56:57",
      "note": "",
      "size": 20505457,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/antdqv/BAR102014.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 02 Mar 2015 17:10:38 +0000",
        "timestamp": "1425334238"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-10-20 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Pennsylvania Enacts Bill to Silence Prisoners – Especially Mumia Abu Jamal\nA new law would curtail the speech of<span class=\"ellipsis\">…</span>\n<!--more-->\nprisoners held by the State of Pennsylvania on the grounds that their utterances and writings might cause “mental anguish” to crime victims. <br />\n“It’s a backlash, it’s a repressive law,” said Dr Johanna Fernandez, professor of history at Baruch College and a supporter of Mumia Abu Jamal, the nation’s best known political prisoner. <br />\n“It suggests that authorities are feeling the heat of emerging movements against police brutality and mass incarceration.<br />\n”\nSpeaking from Frackville State Prison, Mumia Abu Jamal said the legislation proves Pennsylvania’s government “doesn’t give a white about their own Constitution, nor about the United States Constitution. <br />\nI welcome that, because it proves that they are the outlaws.<br />\n” Police organizations were outraged that Abu Jamal was allowed to give a commencement speech at Vermont’s Goddard College.\n<br />\nMonth of Resistance to Mass Incarceration\n \nPolice and FBI personnel have reverted to throwing around the old term “outside agitators” to describe activists that have journeyed to Ferguson, Missouri, to protest the US criminal justice system. <br />\n“They’re picking up the terminology of George Wallace, Bull Connor and the like,” said Carl Dix, of the Stop Mass Incarceration Network, who was arrested along with fellow co-founder Dr Cornel West, in Ferguson, last week. <br />\nThe point “is to divide the movement to transform the status quo.<br />\n” Nationwide actions to resist police brutality, mass incarceration and criminalization of Black people are set for October 22.\n<br />\nProp 47 Would Dramatically Reduce Incarceration in California</p>\n\n<p>The online activist outfit Color of Change has thrown its weight behind passage of Proposition 47, a ballot initiative that would reclassify some nonviolent crimes from felonies to misdemeanors and redirect prison funding to programs for transition to life on the outside. <br />\n“It would impact up to 10,000 people who are currently incarcerated” and spare thousands more from being “overcharged” for offenses, said Matt Nelson, organizing director for Color of Change. <br />\nMoreover, said Nelson, passage would go far to “make it unacceptable to have such high rates of incarceration, which really start in a racially biased culture.<br />\n”\nNext Round: Rev. <br />\nPinkney vs. <br />\nWhirlpool in Benton Harbor\nCommunity activist Rev. <br />\nEdward Pinkney goes on trial October 27 on charges of altering signatures on petitions to recall the mayor of Benton Harbor, Michigan, a mostly Black town long dominated by the giant Whirlpool Corporation. <br />\n“They’re counting on an all-white jury that is motivated by something other than the truth,” said Pinkney, leader of the fight to recall Mayor James Hightower. <br />\nWhirlpool and county police authorities “would do anything – I believe they would even kill – to keep him in office, because he is the corporate puppet,” said Pinkney.\n<br />\nTemple University Students Supplement “Africology” with DuBois\nStudents at Philadelphia’s Temple University are holding their own WEB. <br />\nDubois lecture series to make up for what’s missing from the new “Africology” courses instituted by Dr Molefi Asante, chairman of the recently renamed African American Studies department. <br />\nAsante refused to renew the contract of Duboisian scholar Dr Anthony Monteiro. <br />\n“We feel a critical analysis, historically, politically and economically, through the vantage of African American struggle, is lacking” under the Africology regime, said student organizer Sabrina Sample. <br />\nAsante’s agenda has been to “eliminate any competition with Afro-centric ideology within the department.”<br /></p>\n"
}
