{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/the-infectious-myth-fluoridation-with-paul-connett-101414/",
    "podcast": {
      "developer-note": "",
      "length": "58",
      "note": "",
      "size": 20880107,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/iuzp4x/TIM101414.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 24 Feb 2015 20:00:00 +0000",
        "timestamp": "1424826000"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Fluoridation with Paul Connett"
  },
  "title": "Fluoridation with Paul Connett",
  "date": "2014-10-14 00:00:00 -0400",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>Paul Connett has worked harder and longer than anyone to oppose water fluoridation from a scientific perspective.\n<!--more-->\nHe is a retired chemistry professor, and head of the Fluoride Action Network.\n<br />\n \nPaul and David talk about the history of water fluoridation, how it helped change the public perception of this common industrial waste product, and also how water consumers (that’s everyone) have successfully fought back against the practice. <br />\nIt is now found mainly in North America and Ireland, but is receding in most places. <br />\nRecently it was banned in Israel and there are ongoing lobbying or legal actions in many remaining cities.\n<br />\n \nThis episode discusses what are the major negative health effects of fluoride, especially the devastating impact on bones and joints, how children with levels of fluoride not much higher than the amount deliberately added to water, have lower IQs. <br />\nAnd also the stupidity of carefully measuring the quantity of fluoride added to water, knowing that the amount of water consumed per person varies dramatically, especially when measured relative to body weight.\n<br />\n \nYou can find more about fluoride at the Fluoride Action Network’s website: http://fluoridealert.org\n <br /></p>\n"
}
