{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-090414/",
    "podcast": {
      "developer-note": "",
      "length": "55:24",
      "note": "",
      "size": 19949760,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/qupsxt/LeidStories_090414.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-09-04 00:00:00 -0400",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Detroit Bankruptcy Trial: All Sides Are Telling It to the Judge\nDepartment of Justice Still Thinks Police Killings Are<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nA ‘Civil-Rights’ Issue\nMore than a year after the City of Detroit, under state-imposed emergency management, filed for municipal bankruptcy to discharge $18 billion in debts, a high-stakes federal trial, the final phase of the bankruptcy process, is set to determine whether the city’s plan is fair to all interested parties seeking to protect their financial interests.\n<br />\nThe trial started Tuesday (Sept.<br />\n2) with a bang. <br />\nLawyers for the city said its bankruptcy-exit plan is workable and has broad approval. <br />\nBut yesterday, lawyers for New York-based bond insurer Syncora Guarantee Inc.<br />\n, one of the largest creditors with $400 million owed, told Judge Steven Rhodes they will not accept 10 cents on the dollar, as the city has proposed.\n<br />\nAbayomi Azikiwe, editor of Pan-African News Wire, who has been Leid Stories’ correspondent on Detroit’s bankruptcy and related matters, gives us a comprehensive overview of what’s at stake in the trial for Detroiters, who the major players are, and what they want from the court.\n<br />\nUS Attorney General Eric Holder announces today that he will launch a comprehensive civil-rights investigation into the Ferguson Police Department in Missouri. <br />\nIt’s where Officer Darren Wilson, who shot and killed Michael Brown on Aug. <br />\n9 works, and the department that brought to national attention the increasingly militarized police response to civil protest.\n<br />\nIn a commentary, Leid Stories contends that while Holder’s action may satisfy political considerations, it continues the sorry legacy of the Justice Department regarding the killing of African Americans a “civil-rights” matter, and not a mandate for vigorous criminal prosecutions.<br /></p>\n"
}
