{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-042312/",
    "podcast": {
      "developer-note": "",
      "length": "56:38",
      "note": "",
      "size": 13595472,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/hyy462/ProgressiveCommentaryHour042312.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-04-23 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Martha Rosenberg is an investigative health reporter, commentator and an editorial cartoonist who has written<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nextensively on the dangers of industrial food and pharmaceutical drugs, devious practices by the Big Drug Makers, pharma advertizing, dangers of antibiotics and FDA incompetence in drug oversight for efficacy and safety.<br />\n  She is a frequent contributor to the San Francisco Chronicle, Providence Journal and the Chicago Tribune.\n<br />\nMartha has recently published her first book, “Born with a Junk Food Deficiency: How Flaks, Quacks and Hacks Pimp the Public Health” which includes many interviews with physicians, researchers and insiders willing to come forward to speak about the devious practices of the drug and food industrial complexes.\n<br />\nDr Bruce Levine is a clinical psychologist in Cincinnati and an activist, author addressing the societal problems in our corporate healthcare system.  He is regular contributor to Z Magazine, Alternet, Adbusters, the Ecologist and the Huffington Post.<br />\n  Bruce is a member of Mind Freedom International, and is on the Advisory Council of the International Center for the Study of Psychiatry and Pyschology.\n<br />\nHis most recent book, “Get Up Stand Up: Uniting Populists, Energizing the Defeated, and Battling the Corporate Elite” is a thorough investigation into the psychological underpinnings behind the American public’s passivity and aura of powerlessness to stand up against corporate and political powers who are removing the democratic freedoms in the nation.\n<br /></p>\n"
}
