{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse/",
    "podcast": {
      "developer-note": "",
      "length": "45:31",
      "note": "",
      "size": 10924416,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/3ebrr6/NaturalNurse062011.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "The Natural Nurse"
  },
  "title": "The Natural Nurse",
  "date": "2011-06-20 00:00:00 -0400",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Host Ellen Kamhi, PhD RN, www.naturalnurse.com, interviews Philippa J. Cheetham, M.D. Dr.\n<!--more-->\nCheetham is a Board certified Urological Surgeon at the Department of Uro-oncology at Columbia University Medical Center and is associated with Columbia’s Center for Holistic Urology. <br />\nBefore arriving at Columbia, Dr Cheetham enjoyed a highly celebrated career, graduating with honors from the University of Bristol Medical School, UK, and receiving a prestigious academic research fellowship from the Royal College of Surgeons of England, in the Department of Pharmacology at Oxford University. <br />\nAlong with a strong basis in conventional medical training in urology, Dr Cheetham also has a keen interest in holistic and natural therapies for urological conditions. <br />\nDr Cheetham co-authored three books including, The Patient’s Guide to AHCC- The Clinically Proven Nutrient supported by 25 Clinical Studies, and has also contributed chapters to the “ABC of Urology” textbook, published numerous articles in peer-reviewed journals, and is a TV medical correspondent for Fox news. <br />\nOn todays show, we will focus on THE SOCIETY OF INTEGRATIVE UROLOGY, SIU www.integrativeurology.org a non-profit organization dedicated to advancing urologic care by incorporating research, education and clinical practice of complementary and integrative therapies for urologic conditions for men and women, and the role of The Center for Holistic Urology (CHU) at Columbia University Medical Center http://www.holisticurology.columbia.edu/\n<br /></p>\n"
}
