{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-the-bomb-the-fuse-and-the-dud-part-1-012415/",
    "podcast": {
      "developer-note": "",
      "length": "1:01:3",
      "note": "",
      "size": 22143075,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/t25cw6/AlternativeVisions_012415.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "The Bomb, the Fuse and the Dud (Part 1)"
  },
  "title": "The Bomb, the Fuse and the Dud (Part 1)",
  "date": "2015-01-24 00:00:00 -0500",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Jack Rasmus discusses yesterday’s big announcement of a massive $1.5 trillion Quantitative Easing (QE) money injection<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nprogram by the European Central Bank, and its consequences for the Eurozone and global economy. <br />\nAfter nearly $9 trillion in total QEs by US, UK, Japan and now the Eurozone, the global economy continues to slowly drift into recession and deflation. <br />\nClaims by central banks and politicians that QEs are about growing the economy, lowering unemployment or raising inflation to a stable 2% are debunked as empirically false. <br />\nQEs are about bailing out financial institutions and the new finance capital elite and then ballooning their balance sheets well beyond bailout as well. <br />\nJack explains the several flaws and consequences of QE: it doesn’t result in lending for real investment, leads to financial speculation and bubbles, accelerates incomes of super wealthy (via stock buybacks, dividend payouts, etc.), raises global private debt by business, reduces incomes of middle classes, sets off competitive devaluations and currency wars, leads to real goods deflation and financial asset market inflation (stocks, junk bonds, forex, etc.<br />\n), and accelerates global income inequality trends. <br />\nJack explains the connections between QE and fiscal austerity policies. <br />\nAnd represents a growing desperation by financial capital elites and their institutions to ensure growing incomes for themselves by artificial means (free money) and at the direct expense of incomes of the rest of society. <br />\nThe linkage of QE and ‘labor market reforms’ (attacks on wages) are noted.\n<br />\n \n(Next week’s show: Part 2 ‘the fuse’, the coming elections in Greece and ascendancy of the left party, Syriza. <br />\nWill it mean the beginning of the end of neoliberalism and a fight back against QE, free money, and austerity?)<br /></p>\n"
}
