{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-understanding-the-new-world-order-031813/",
    "podcast": {
      "developer-note": "",
      "length": "56:01",
      "note": "",
      "size": 13444075,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/pran4x/PCH031813.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Understanding the New World Order"
  },
  "title": "Understanding the New World Order",
  "date": "2013-03-18 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Dr. Rodrigue Tremblay is a prominent Canadian economist who is now a professor emeritus at the University of Montreal.\n&lt;!--more--&gt;\nIn the late 1970s he served as the Minister of Industry and Commerce in the Quebec government. <br />\nDr Tremblay is also the President of the North American Economics and Finance Association and President of the Canadian Economics Society.\n<br />\nDr Tremblay has authored over 25 books on economics, finance and a variety of global ethical and political issues. <br />\nHis blog on geopolitics is read throughout the world and translated into 8 languages. <br />\nHis most recent book “The Code for Global Ethics: Ten Humanist Principles” addresses the urgent need for a new sense of morals in the face of immense international and global challenges.\n<br />\nBOOK: “The Code for Global Ethics: Ten Humanist Principles”\nWEBSITE &amp; BLOG:  www.TheNewAmericanEmpire.<br />\ncom\nDr Michel Chossudovsky is a professor emeritus at the University of Ottawa in Ontario and has been an economic advisor to many developing countries. <br />\n He is the founder of the Center for Research on Globalization at the University of Montreal and founding editor of Global Research.<br />\nca. <br />\n Prof. <br />\nChossudovsky is one of world’s leading visionaries in economic trends associated with free market globalization, having identified over 15 years ago many of the problems in global neoliberal economics that are now frequent in our headlines:  austerity, economic shock therapy, the association between rising poverty, the pillaging of developing nations due to the structural adjustment policies of the US led World Bank, IMF and WTO, and the criminalization of our banking system.\n<br />\nHe has written several books, most notably “The Globalization of Poverty and The New World Order” AND “Towards a World War 3 Scenario: The Dangers of Nuclear War”\nWEBSITE:  www.GlobalResearch.ca\n<br /></p>\n"
}
