{
  "header": {
    "category": "the-news-dissector",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenewsdissector.podbean.com/e/news-dissector-10313/",
    "podcast": {
      "developer-note": "",
      "length": "56:58",
      "note": "",
      "size": 13673535,
      "type": "audio/mpeg",
      "url": "http://thenewsdissector.podbean.com/mf/feed/2ar8v9/NewsDissector103113.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://thenewsdissector.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Fri, 19 Sep 2014 16:24:15 +0000",
        "timestamp": "1411161855"
      },
      "subtitle": "h",
      "title": "The News Dissector"
    },
    "tags": [
      "News & Politics",
      "the-news-dissector"
    ],
    "title": "The News Dissector"
  },
  "title": "The News Dissector",
  "date": "2013-10-31 00:00:00 -0400",
  "categories": [
    "the-news-dissector"
  ],
  "content": "<p>Special guest; Colleen Rowley\nShe just visited Snowden in Russia\n \nShortly after becoming a Special Agent with the FBI,<span class=\"ellipsis\">…</span>\n<!--more-->\nRowley was assigned to the Omaha, Nebraska and Jackson, Mississippi Divisions. <br />\nBeginning in 1984, she spent six years working in the New York Office on investigations involving organized crime. <br />\nShe also served in the US embassy in Paris and the consulate in Montreal. <br />\nIn 1990, she was assigned to the FBI’s Minneapolis office, where she became the chief legal adviser.<br />\n[citation needed]\nAfter the September 11, 2001, attacks, Rowley wrote a paper for FBI Director Robert Mueller documenting how FBI HQ personnel in Washington, DC, had mishandled and failed to take action on information provided by the Minneapolis, Minnesota Field Office regarding its investigation of suspected terrorist Zacarias Moussaoui. <br />\nMoussaoui had been suspected of being involved in preparations for a suicide-hijacking similar to the December 1994 “Eiffel Tower” hijacking of Air France 8969. <br />\nFailures identified by Rowley may have left the US vulnerable to the September 11, 2001, attacks. <br />\nRowley was one of many agents frustrated by the events that led up to the attacks, writing:\nDuring the early aftermath of September 11th, when I happened to be recounting the pre–September 11th events concerning the Moussaoui investigation to other FBI personnel in other divisions or in FBIHQ, almost everyone’s first question was “Why?<br />\n–Why would an FBI agent(s) deliberately sabotage a case? <br />\n(I know I shouldn’t be flippant about this, but jokes were actually made that the key FBI HQ personnel had to be spies or moles, like (Robert Hanssen), who were actually working for Osama Bin Laden to have so undercut Minneapolis’s effort.<br />\n) [2][3]</p>\n\n<p>Rowley testified in front of the Senate and for the 9/11 Commission about the FBI’s internal organization and mishandling of information related to the September 11, 2001, attacks. <br />\nShe jointly held the TIME“Person of the Year” award in 2002 with two other women credited as whistleblowers:Sherron</p>\n\n<p>Telecommunications Policy–a corporate guy was just named to head the FCC Ev Ehrlich</p>\n\n<p>President of ESC Company, a DC-based economics and business consulting firm that serves (among others) Fortune 500 firms, non-profits in areas such as infrastructure and climate change, and the baseball and hockey players unions.  Former Under Secretary of Commerce for Economic Affairs (Clinton, under Secretaries Brown, Kantor, and Daley), Vice-President for Strategic Planning and Chief Economist, Unisys Corporation, Assistant Director of the Congressional Budget Office, one-time legislative Assistant to Congressman John Conyers, Jr., author of two novels published by Warner Books, Big Government and Grant Speaks.<br />\n  PhD University of Michigan, BA Stony Brook University, educated by New York City public schools.\n<br /></p>\n\n<p>Recent works include:\n· White Paper – This is the big one – regarding a progressive broadband agenda\n· Wall Street Journal\n· Oakland Tribune\n· Fresno Bee\n· Seattle Times</p>\n\n<p>Net Neutrality</p>\n\n<p>Net Neutrality: ”principle that advocates all internet traffic to be treated equally.<br />\n”\nThe Case: The case between Verizon and the Federal Communications Commission concerns the FCC’s 2011 open Internet rules requiring Internet providers to treat all Web traffic as the same in a manner that gives consumers equal access to all lawful content. <br />\nVerizon has argued such network-neutrality rules are “arbitrary and capricious” and violate the company’s freedom of speech. <br />\nEarly signs suggest two members of the court’s three-judge panel are sympathetic to Verizon’s case. <br />\nOral arguments were held on September 9. <br />\nA decision – either to uphold or overturn the doctrine – is expected by year’s end.\n<br /></p>\n"
}
