{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-a-may-day-lament-for-american-labor-jobs-wages-and-the-110-million-050314/",
    "podcast": {
      "developer-note": "",
      "length": "43:51",
      "note": "",
      "size": 10527451,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/73z85e/AlternativeVisions_050314.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "A May Day Lament for American Labor: Jobs, Wages and the 110 Million"
  },
  "title": "A May Day Lament for American Labor: Jobs, Wages and the 110 Million",
  "date": "2014-05-03 00:00:00 -0600",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Dr Jack Rasmus reviews the employment and GDP reports of the past week and considers the condition of American Labor on<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nMay Day, May 1 2014, five years the end of the recession.<br />\n  Diving deeper into the numbers, Rasmus shows how millions have been leaving the US labor force and how a ‘great churning’ of jobs is going on across several dimensions: younger workers leaving while older retirees reentering; higher paid jobs being replaced by lower pay; manufacturing &amp; construction jobs replaced by managers, professionals, and part time-temp services work; and nonunion replacing union jobs. <br />\nRasmus explains how the actual unemployment rate is 14% and more than 20 million are still jobless—not 6.<br />\n3% and 10 million–and that 2 million have left the labor force in the past six months, and explains why the US population is growing faster than jobs being created. <br />\nRasmus explains the 110 million ‘core’ working class in the US is going backward in terms of wages and incomes—which have declined 10% to 15% since 2009 ass the wealthiest 1% gain 95% of all national income.<br />\n  Rasmus concludes with a preliminary comment on the new bestseller book just out, ‘Capital in the 21st Century’, by Thomas Picketty and provides his brief critique as to what’s missing in it (and in the recent works by other liberal economists like Paul Krugman, Robert Reich, and James Galbraith also writing on income inequality in America in recent years).\n<br /></p>\n"
}
