{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-102/",
    "podcast": {
      "developer-note": "",
      "length": "57:57",
      "note": "",
      "size": 13907808,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/pmyntj/GaryNullShow050311.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-05-03 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today’s guest is Dr. Tim Flannery and he has been considered one of the most famous scientists of our time.\n&lt;!--more--&gt;\nHe is an Australian mammalogist, palaeontologist, ecologist and global warming activist. <br />\nHe was among the first scientists in the world to sound the alarm for tackling the problem of climate change. <br />\nIn addition to his professorship at MacQuarie University, he is also Australia’s first Chief Commissioner for Climate Change. <br />\nHe is believed to have discovered more new species of life than Darwin. <br />\nDr Flannery holds many prestigious positions and posts: the Australian representative for National Geographic, director of Australia’s Wildlife Conservancy, chair of the Copenhagen Climate Council. <br />\nAs an anti-war activist, he is a member of the Soldiers for Peace project to end all wars.\n<br />\nHe was awarded Australian of the Year for his stance on climate change and advocating for the shutting down of coal energy plants – extremely controversial in Australia where the country depends mostly on coal for its energy. <br />\n His writings on climate change and the future of the global environment while offering hope, also are dire warnings.\n<br />\nTim has published well over a dozen books and numerous papers. <br />\nHis most recent book, and perhaps his most all encompassing on a global scale, is “Here on Earth: A Natural History of the Planet.”\n<br /></p>\n"
}
