{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-012314/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:38",
      "note": "",
      "size": 14555324,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/gzcn/GaryNullShow012314.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2014-01-23 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Growing global inequality and the corporate capture of the political process that is contributing to it – a report from<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nOxfam in the UK\nRicardo Fuentes-Nieva is the head of research for Oxfam GB in the UK, an international civil organization addressing global issues such as food security, social and economic inequality and poverty, climate change, resource conservation and democratic participation of national citizenries. <br />\nHe is a lead researcher in the recent Oxfam report on growing inequality, entitled “Working for the Few: Political Capture and Economic Inequality.<br />\n”  Prior to joining Oxfam, Riccardo worked with UN Development Program where he led the production of the first Africa Human Development Report. <br />\nHe has co-authored several global Human Development Reports including the World Bank’s 2010 World Development Report and is currently collaborating with the new assessment of the Intergovernmental Panel on Climate Change (IPCC). <br />\nBefore joining UNDP, he worked in the Ministry of Social Development in Mexico and the research department of the Inter-American Development Bank. <br />\nRicardo is trained as an economist and has degrees from CIDE in Mexico City and from the University of Pompeu Fabra in Spain. <br />\nThe website is Oxfam.org.uk\n<br /></p>\n"
}
