{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-081114/",
    "podcast": {
      "developer-note": "",
      "length": "55:15",
      "note": "",
      "size": 19893600,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/8bj6qw/BAR_081014.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-08-11 00:00:00 -0400",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Wall Street is Milking Detroit Dry\nMass water cutoffs are set to resume on August 25, a prelude to privatization of<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nDetroit’s water and sewage department, while plans are afoot to put public parking up for auction. <br />\n“The underlying agenda” of the state-imposed bankruptcy process is the “sell off of public assets; the destruction of the strength – to the extent it exists – of the labor movement; and the expropriation of public pension funds,” said Abayomi Azikiwe, of the Moratorium Now Coalition. <br />\nA similar fate awaits other cities across the country, because “the crisis of the overall American capitalist system has worsened and, therefore, there’s more pressure being put on municipalities to extract more wealth for the benefit of Wall Street.<br />\n”\nBlack Is Back Coalition to Gather in Philadelphia\nThe Black Is Back Coalition for Social Justice, Peace and Reparations, which has consistently opposed the corpora tist and warlike policies of the Obama administration since its founding in 2009, holds its annual conference in Philadelphia, August 16 and 17. <br />\n“More and more people are being awakened to the catastrophe that the Obama regime has become, not only for the struggle and rights of African people here in the United States, but for people around the world,” said Black Is Back chairman Omali Yeshitela. <br />\nThe Coalition plans to mount another march on the White House on November 1.\n<br />\nBlack Liberation in the Age of Climate Change\nooperation Jackson, a campaign to bring cooperative economics to Jackson, Mississippi, is one of the legacies of the late Chokwe Lumumba’s brief tenure as mayor of the mostly Black city. <br />\nThe grassroots effort has joined forces with the Climate Justice Alliance, according to veteran organizer Kali Akuno. <br />\n“We’re looking not only to control the means of production in Jackson – and eventually throughout Mississippi, and beyond – but we’re trying to make sure that we produce goods and services differently than the standard capitalist methods, which are over-reliant on petrochemicals and unhealthy products,” said Akuno.\n<br />\nMumia: Immigrant-Bashing is Part of Americana\nResentment of new immigrant groups is “as old as the country, itself,” said Mumia Abu Jamal, the nation’s best known political prisoner. <br />\n“Every generation, anxious about their place in this turbulent society, gives new arrivals hell,” said Abu Jamal, in a report for Prison Radio. <br />\nAnti-immigrant sentiment helped fuel a resurgence of the Ku Klux Klan. <br />\n“It doesn’t take much to spark it back up again, as we see with the children of Central America.<br />\n”\nCIA Battles to Keep Its Torture Secrets\nCongress adjourned without resolution of the Senate Intelligence Committee’s attempt to declassify a 6,000-page report on CIA torture programs. <br />\nShahid Buttar, executive director of the Bill of Rights Defense Committee, said the agency “destroyed the evidence of its crimes – obstructing justice in the process – and then, when investigated by the Senate, hacked the Senate servers, infiltrated the Senate computer system, stole documents from the Senate, and then filed false allegations with the Justice Department seeking prosecution of Senate staffers.” Arguably, the CIA is “the world’s most successful terror organization,” said Buttar.<br /></p>\n"
}
