{
  "header": {
    "category": "the-infectious-myth",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://infectiousmyth.podbean.com/e/the-infectious-myth-mammography-031214/",
    "podcast": {
      "developer-note": "",
      "length": "58:18",
      "note": "",
      "size": 13993796,
      "type": "audio/mpeg",
      "url": "http://infectiousmyth.podbean.com/mf/feed/bxfvtz/InfectiousMyth_031114.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/664160/DavidCroweArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "archives@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Tue, 10 Mar 2015 20:15:29 +0000",
        "timestamp": "1426036529"
      },
      "subtitle": "“The Infectious Myth” will examine disease paradigms and the scientific or historical evidence that the simple story we are told about a virus, bacteria or gene causing a disease, is probably false.",
      "title": "The Infectious Myth"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-infectious-myth"
    ],
    "title": "Mammography"
  },
  "title": "Mammography",
  "date": "2014-03-12 00:00:00 -0400",
  "categories": [
    "the-infectious-myth"
  ],
  "content": "<p>David talked with Professor Peter Gøtzsche, head of the Cochrane Institute in Denmark about two books he has recently<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\npublished. <br />\nPeter explains how his 2012 book, “Mammography Screening: Truth Lies and Controversy”, dismantles the myth that mammography is beneficial, that mammography just leads to over diagnosis, severe anxiety in women, even those whose false alarm is later withdrawn, and has never been shown to have any reduction in the overall death rate for women. <br />\nPeter explains that his 2013 book, “Deadly Medicines and Organised Crime: How big pharma has corrupted healthcare” has a strong title, but one that is justified by the US government definition of Organized Crime. <br />\nWhile pharmaceutical companies have been fined billions of dollars for illegal behavior, they are still getting away with literal murder. <br />\nAlthough surveys show that the general public do not trust drug companies, they do trust their doctors. <br />\nSo drug companies can lavish attention (money) on doctors knowing that their patients will believe that their doctors offer an independent opinion about the value of drugs. <br />\nPeter explains that this is a myth, that most doctors get most information about drugs from pharmaceutical companies. <br />\nDrug companies also manipulate research, suppressing studies that show a negative result, and promoting research that shows a positive result, even if that research is biased. <br />\nSo that this discussion is not too depressing, at the end David asks Dr Gøtzsche for ideas on how individuals can protect themselves a corrupt and deadly system.\n<br />\n <br /></p>\n"
}
