{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-12-22-11/",
    "podcast": {
      "developer-note": "",
      "length": "1:04:45",
      "note": "",
      "size": 15542064,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/mck924/GaryNullShow122211.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-12-22 00:00:00 -0500",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Guest: Rocky Anderson\nWe have joining us for today’s broadcast Ross “Rocky” Anderson who announced his candidacy to the<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nPresidency and the launch of a new national party – the Justice Party – at the end of November.\n<br />\nRocky is the former two-term mayor of Salt Lake City, serving from 2000 to 2008. <br />\nHe is the executive director of organization High Road for Human Rights. <br />\n Prior he practiced law in Utah for 21 years and was listed in Best Lawyers in America. <br />\n A former member of the Democratic Party, he left ver its evisceration of the Constitution and it having morphed as a flip side of the GOP.\n<br />\nAmong his achievements and positions, which will have a chance to explore more thoroughly are:\n·        Listed by Business Week as one of the top 20 activists in th world on climate change and has received many awards from various environmental organizations\n·        Recognized by the Human Rights Campaign as one of the top 10 advocates for GLPT equality\n·        A leading opponent of invasion of Iraq and the only US mayor who advocated for the impeachment of George Bush\n·        As mayor of Salt Lake City he succeeded in reducing incarceration of those convicted for minor crimes such as drug possession and rather created restorative justice programs that earned him his second World Leadership Award.\n<br /></p>\n"
}
