{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-44/",
    "podcast": {
      "developer-note": "",
      "length": "1:03:26",
      "note": "",
      "size": 15223536,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/wx2int/GaryNullShow021011.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2011-02-10 00:00:00 -0700",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Today’s guest is Brent Leung and he is a young Canadian born film director, with a degree in psychology from Kwantlen<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nUniversity in British Columbia and the Watkins Film School in Nashville. <br />\n Brent’s first documentary, House of Numbers, is the latest controversial film to challenge the official HIV-AIDS story. <br />\n Having been troubled by the media’s portrayal of AIDS, Brent embarked on a journey to many countries to film and interview major players on both sides of the HIV debate. <br />\nHouse of Numbers won international media attention and awards. <br />\n One of the primary reasons for the film being a victim of a concerted effort by the AIDS establishment is because Brent managed to get access to interview and film some of the primary guardians of the HIV-AIDS story – including Luc Montagnier, Robert Gallo, John Levy, Anthony Fauci, Jim Moore and others, and present their own words showing that HIV is barely understood by the so-called experts and authorities and the research establishment is in disarray and our health policy dealing with AIDS is a disaster.\n<br />\nBrent is preparing a new release of approximately 10 hours of footage focusing on his interviews with the leaders of the AIDS-HIV story. <br /></p>\n\n<p>WEBSITE:  www.HouseOfNumbers.<br />\ncom\nAlso, we have Liam Scheff and he is an investigative journalist and researcher addresses scientific discoveries, the medical cult and politics of scientism – especially concerning infectious disease, vaccines and prescription drugs —  and issues concerning race, class and culture. <br />\n He has been an activist for chidren and adolescent rights, and broke the story about government agencies, particularly the NIH, and Big Pharma’s hidden experimental trials with dangerous HIV drugs on New York City orphans. <br /></p>\n\n<p>Liam has been published in the New York Press, LA Citybeat, Salvo, Hustler and others. <br />\nHe is a contributing investigator  for the Office of Medical and Scientific Justice and founder of the Reduce The Burden.<br />\norg  His online podcast, The Investigation, covers a variety of themes concerning the perversion of science.\n<br />\nWEBSITES:  www.LiamScheff.com   AND   www.ReduceTheBurden.<br />\norg\nAlso, we have Mark Gabrish Conlan and he is gay journalist and an expert in the history of the gay community and AIDS activist. <br />\nMark is the founder of the San Diego chapter of HEAL (Health Education AIDS Liaison) and the editor of Zenger’s News Magazine, a monthly publication on alternative lifestyles, politics, health and culture, and contributes investigative articles,  and writes for the San Diego Reader. <br />\n Mark is a participant in the ReThinking AIDS organization and a contributor to their VirusMyth.<br />\norg news and publication site.\n<br /></p>\n"
}
