{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-corporate-strategy-in-america-%e2%80%93-090614/",
    "podcast": {
      "developer-note": "",
      "length": "58:13",
      "note": "",
      "size": 20958696,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/vqxcje/AlternativeVisions_090614.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Corporate Strategy in America"
  },
  "title": "Corporate Strategy in America",
  "date": "2014-09-06 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>Host, Jack Rasmus, discusses the origins and evolution of Corporate Strategy in the USA since the 1970s and explains<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nhow that has played a central role in gutting union membership, undermining collective bargaining, and all but negating effective union political action. <br />\n Jack describes the collapse of union membership and the net loss of 20 million potential union members since 1980, how corporations transformed collective bargaining from a means for workers to improve wages and benefits to a tool for taking away wages and benefits, and how union labor political action has collapsed into a policy of little more than providing money handouts to Democrats. <br />\n  Jack explains how the failure of union strategy for organizing, bargaining, and political action is in large part due to the corresponding successes of corporate strategies that originated and began in the 1970s. <br />\nUnion strategic failures thus cannot be separated from Corporate strategic successes; they are both sides of the same coin. <br />\n Rasmus describes in detail how Corporate America in the 1970s reorganized and restructured itself to enable new strategies that took on the building trades unions, the teamsters union, and manufacturing unions, gutted their membership ranks, and effectively destroyed their union national, regional, and pattern bargaining power within a decade—by multiple means including double breasted operations, NLRB rule changes, industry deregulation, free trade, corporate tax incentives promoting offshoring &amp; runaway shops, rise of tens of millions of temp workers and independent contractors not allowed to unionize, intensified open shop drives, and today’s de-unionizing of public employment, and other measures. <br />\nToday’s economic (and increasingly political) class war in America, Rasmus explains, has its roots in corporate strategies formed in the 1970s, that continue to evolve and gain momentum today. <br />\nRasmus concludes new, more effective union strategies will have to be accompanied by fundamental reorganization and restructuring of American Unions—just as had occurred in US history before. <br />\n  </p>\n\n<p>For further on this theme, listeners are encouraged to read Rasmus’s four part series of articles appearing in the new Latin America media outlet, ‘teleSUR English’ at http://www.telesurtv.net/english/section/opinion/index.<br />\nhtml. <br />\n  (which are also available on his website, http://www.kyklosproductions.com/articles.html.) “<br /></p>\n"
}
