{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-041813/",
    "podcast": {
      "developer-note": "",
      "length": "1:02:47",
      "note": "",
      "size": 15068682,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/rcfhb8/GaryNullShow041813.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2013-04-18 00:00:00 -0600",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>CONVERSATIONS WITH REMARKABLE MINDS\nScience Set Free… deconstructing  the dogmas of scientific determinism and<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nreductionism and the threats such a dogma poses\nDr Rupert Sheldrake is a British biochemist and plant physiologist who has experimented with innovative field theory in plants and animals, including humans, to account for the causative formation of the  deeper structures of biological development. <br />\n His research has included efforts to reach a greater understanding of  memory, perception and cognition as well as the forces that unfolds an organism. <br />\n  Over the past several decades he developed the theory of morphic resonance and morphogenic fields that are instrinsic to all species. <br />\n While in India, he became a close associate of the late Father Bede Griffiths – an internationally renowned Dominican monk, mystic and spokesperson for interspiritual dialogue between religions.\n<br />\nDr Sheldrake has written extensively on his morphogenic theory since the publication of his first major book A New Science in Life in 1981 . <br />\nHis most recent book is “Science Set Free:  Ten Paths to New Discovery” which is a thorough critique of the flaws in the dominant mechanistic scientific establishments and offers alternative evidence to give credence for a new approach in scientific understanding.\n<br /></p>\n"
}
