{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-072314/",
    "podcast": {
      "developer-note": "",
      "length": "56:05",
      "note": "",
      "size": 20190168,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/rvp3yu/LeidStories_072314.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-07-23 00:00:00 -0600",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Peace Activist: Israel’s Carnage in Gaza Has Shifted the Public Discourse\nDetroit: City Manager Scores Major Victory;<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nRetirees OK Pension Cuts\nThe ‘48-Hour Rule’: How Cops Legally Avoid Investigations\nPhyllis Bennis, a fellow at the Institute for Policy Studies in Washington, DC, and director of its New Internationalism Project, helped found the US Campaign to End Israeli Occupation in 2001 and remains on its advisory board. <br />\nShe writes and speaks widely across the United States and around the world as part of the global peace movement, and is an informal adviser to several top UN officials on Middle East and UN democratization issues.\n<br />\nShe tells Leid Stories that Israel’s carnage in Gaza, and its policies toward Palestine in general, have triggered a shift in the public discourse, most notably among Jews.\n<br />\nKevyn Orr, the state-appointed emergency manager for the City if Detroit, on Monday got a huge boost to his bankruptcy-reorganization plan—agreement by city workers and retirees to cut their pensions by 4.<br />\n5 percent and forego other benefits.\n<br />\nCorrespondent Abayomi Azikiwe, editor of Pan-African News Wire, reports on what Orr’s victory means in the impending legal battle to prove to a federal judge that the city has met all the criteria to qualify for bankruptcy protection against creditors and to proceed with its recovery plan.\n<br />\nA funeral will be held this evening in New York City for Eric Garner, a 46-year-old father of six who died last Thursday after a violent arrest by police for allegedly selling “loosie” untaxed cigarettes.\n<br />\nTwo police officers involved in Garner’s fatal arrest—including the officer who held Garner in an illegal chokehold—have yet to be fully questioned about the incident. <br />\nLeid Stories discusses a controversial union rule that actually provides police officers legal protections against investigation and prosecution that civilians don’t have.<br /></p>\n"
}
