{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-062512/",
    "podcast": {
      "developer-note": "",
      "length": "1:02:25",
      "note": "",
      "size": 14983210,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/5daau/GaryNullShow062512.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-06-25 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>Biophysics behind Double Helix Water and its healing properties Dr.\n&lt;!--more--&gt;\nShui Yin Lo is the chairman of D &amp; Y Laboratories which is at the forefront of research in Double Helix water. <br />\nHe received his doctorate in theoretical physics under the Nobel laureate Dr Yoichiro Nambu at the world renowned University of Chicago physics department. <br />\nHe has been a visiting professor and lecturer at many leading academic institutes including the California Institute of Technology, Beijing’s Academy of Science, the Stanford University Accelerated Center, Denmark’s Institute of Theoretical Physics and others. <br />\nHe has published over 75 peer reviewed papers in physics journals and has over 60 patents related to the field of atomic and subatomic particle science. <br />\nIn more recent years, Dr Lo has focused on the biophysical properties of water within the human body, with special attention on stable water clusters which consequently led to his discovery of Double Helix Water. <br />\nHe has also researched the biophysics of acupuncture, and the pioneered new ways to understand the meridian system as channels of natural clustered water. <br />\nThis led to his book “The Biophysics Basis for Acupuncture and Health.” And more on double helix water is at his website DoubleHelixWater.com\n<br /></p>\n"
}
