{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "image",
      "url": "http://progressivecommentaryhour.podbean.com/mf/web/6pt8zm/GaryNull-PCH_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commentary-hour-070212/",
    "podcast": {
      "developer-note": "",
      "length": "54:01",
      "note": "",
      "size": 12967393,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/2fau8x/ProgressiveCommentaryHour070212.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commentary Hour"
  },
  "title": "Progressive Commentary Hour",
  "date": "2012-07-04 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>Special broadcast on ALEC\nLisa Graves is the Executive Director of the Center for Media and Democracy, the publisher of<span class=\"ellipsis\">…</span>\n<!--more-->\nPR Watch, SourceWatch, and BanksterUSA. <br />\nShe previously served as a senior advisor in all three branches of the federal government, as a leading strategist on civil liberties advocacy, and as an adjunct law professor at one of the top law schools in the country. <br />\nHer former leadership posts include: a Deputy Assistant Attorney General at the US Department of Justice, Chief Counsel for Nominations for the US Senate Judiciary Committee, and Senior Legislative Strategist for the American Civil Liberties Union (on national security and surveillance policies). <br />\nLisa has testified as an expert witness before both the Senate and House and has frequently appeared as an expert across the different radio and television net works.\n<br />\nThe Center for Media and Democracy recently obtained documents outlining about 800 bills, vetted and approved by major corporations along with Republican officials, who comprise the American Legislative Exchange Council or ALEC. <br />\nIt has been discovered that these bills are designed to rewrite state laws and target just about every area of American life – from education, union and worker rights, civil liberties, corporate oversight, health care, utilities, taxation – all which favor greater independence for the corporate regime and their domination over the privatization of people’s lives.\n<br /></p>\n"
}
