{
  "header": {
    "category": "progressive-commentary-hour",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://progressivecommentaryhour.podbean.com/e/progressive-commenatary-hour-on-nato-032414/",
    "podcast": {
      "developer-note": "",
      "length": "56:06",
      "note": "",
      "size": 13464764,
      "type": "audio/mpeg",
      "url": "http://progressivecommentaryhour.podbean.com/mf/feed/aicyxz/PCH032414.mp3"
    },
    "show": {
      "category": [
        "News & Politics"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/371244/GaryNull-PCH_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Wed, 25 Feb 2015 20:55:24 +0000",
        "timestamp": "1424915724"
      },
      "subtitle": "Gary Null discusses progressive issues with some of the most remarkable minds in the world.",
      "title": "Progressive Commentary Hour"
    },
    "tags": [
      "News & Politics",
      "progressive-commentary-hour"
    ],
    "title": "Progressive Commenatary HourOn NATO"
  },
  "title": "Progressive Commenatary HourOn NATO",
  "date": "2014-03-25 00:00:00 -0400",
  "categories": [
    "progressive-commentary-hour"
  ],
  "content": "<p>NATO’s mission in militarized globalization and intervening on behalf of US interests\nRick Rozoff has been an active<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nopponent of war, militarism and intervention for over 40 years. <br />\nHe is the manager of Stop NATO and its internet activities, which focuses on the threat of international militarization, especially through globalization, of the North Atlantic Treaty Organization (NATO). <br />\nRick has written over 300 articles on international affairs, frequently published on the Center for Research in Globalization and VoltaireNet, and his research and writings are frequently cited in investigations into postmodern geopolitics.<br />\n Rich frequently appears ion radio and television programs in Russia, the Middle East, Africa and the Caribbean.\n<br />\nRickRozoff.Wordpress.com\nProf.<br />\n Stephen Zunes (Zoo-ness) is a Professor of Politics and International Studies at the University of San Francisco, where he chairs the program in Middle Eastern Studies. <br />\nHe is recognized as one the country’s leading scholars of US Middle East policy and of strategic nonviolent action, Professor Zunes received his PhD. <br />\nfrom Cornell University and previously served on the faculty of Ithaca College, the University of Puget Sound, and Whitman College. <br />\nHe serves as a senior policy analyst for the Foreign Policy in Focus project of the Institute for Policy Studies, an associate editor of Peace Review, a contributing editor of Tikkun, and chair of the academic advisory committee for the International Center on Nonviolent Conflict.\n<br />\nAmong his publications, the most recent is “Western Sahara: War, Nationalism and Conflict Irresolution” and earlier “Tinderbox: US Foreign Policy and the Roots of Terrorism” co-written with Richard Falk. His website is www.StephenZunes.org</p>\n\n<p><br /></p>\n"
}
