{
  "header": {
    "category": "the-wake-up-call",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/276914/Richard_Martin_AlbumArt2.jpg"
    },
    "layout": "podcast",
    "link": "http://thewakeupcall.podbean.com/e/wake-up-call-economic-waves-cycles-051614/",
    "podcast": {
      "developer-note": "",
      "length": "56:28",
      "note": "",
      "size": 13552013,
      "type": "audio/mpeg",
      "url": "http://thewakeupcall.podbean.com/mf/feed/u4ig75/WakeUpCall_051614.mp3"
    },
    "show": {
      "category": [
        "Business",
        "Investing"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/276914/Richard_Martin_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 23 Feb 2015 21:03:15 +0000",
        "timestamp": "1424743395"
      },
      "subtitle": "Your Economic Survival?  They're Not Looking Out For You.  We are.",
      "title": "The Wake Up Call"
    },
    "tags": [
      "Business",
      "Investing",
      "the-wake-up-call"
    ],
    "title": "Economic Waves & Cycles"
  },
  "title": "Economic Waves & Cycles",
  "date": "2014-05-16 00:00:00 -0400",
  "categories": [
    "the-wake-up-call"
  ],
  "content": "<p>An introduction to cycles and waves in economic and financial activity.\n<!--more-->\nWe discuss the Kondratieff Wave, Harry Dent, Charles Nenner, Charles Hugh Smith, Robert Prechter and his Elliott Wave and Martin Armstrong as well as the theory of sun spot activity espoused by the English economist William Stanley Jevons. <br />\nThe imminent bursting of the Chinese bubble. <br />\nThe country’s total debt is 277% of GDP. <br />\nChinese private debt is now 190%. <br />\nThese figures are unprecedented for an emerging economy. <br />\nWhy foreign markets are so grotesquely overvalued today. <br />\nThere is no sustainable healing anywhere in the emerging market economies. <br />\nMarket gains will be given back as quickly as they materialized. <br />\nWhy man seems to seek out ways to self-destruct. <br />\nThe scandal of exposure to harm meted out to unwitting patients in America’s hospitals as spotlighted by National Nurses United. <br />\nWIN and Gallup surveyed more than 66,000 people across 65 nations and found that 24% of all respondents claim that the United States is the greatest threat to world peace today. <br />\nA driver was pulled over in Arizona for driving with her hands at the ten-to-two position, having out-of-town tags and looking like a drug smuggler even though she had done nothing wrong. <br />\nThe 10th Circuit US Court of Appeals unanimously upheld the search.\n<br /></p>\n"
}
