{
  "header": {
    "category": "the-gary-null-show",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thegarynullshow.podbean.com/e/the-gary-null-show-042612/",
    "podcast": {
      "developer-note": "",
      "length": "1:00:26",
      "note": "",
      "size": 14505587,
      "type": "audio/mpeg",
      "url": "http://thegarynullshow.podbean.com/mf/feed/v5y73/GaryNullShow042612.mp3"
    },
    "show": {
      "category": [
        "Health"
      ],
      "image": {
        "height": 144,
        "url": "http://thegarynullshow.podbean.com/feed/h",
        "width": 144
      },
      "owner": {
        "email": "h",
        "name": "h"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 17:00:00 +0000",
        "timestamp": "1426197600"
      },
      "subtitle": "h",
      "title": "The Gary Null Show"
    },
    "tags": [
      "Health",
      "the-gary-null-show"
    ],
    "title": "The Gary Null Show"
  },
  "title": "The Gary Null Show",
  "date": "2012-04-26 00:00:00 -0400",
  "categories": [
    "the-gary-null-show"
  ],
  "content": "<p>CONVERSATIONS WITH REMARKABLE MINDS\nWhy the world financial markets imploded – looking at the future\nFor many years,<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nJohn Perkins was an economic hit man (EHM), a job he held to convince developing nations to accept enormous loans for infrastructure development and to guarantee that development projects were contracted to US corporations such as Halliburton and Bechtel. <br />\nHe was a direct participant or witness to such dramatic modern events as the Saudi Arabian Money Laundering scandal, the fall of the Shah of Iran, the assassination of Panama’s president Omar Torrijos and the Panama invasion, and other government and corporate intrigues leading to the 2003 invasion of Iraq. <br />\nNow with both the global and domestic financial collapses, a strengthening of the corportacracy parallel to increasing rates of unemployment, homelessness, rising illness and disease and diminishing healthcare, John is in a unique position to provide comment and analysis since he contributed to these very same events in poorer nations.\n<br />\nAfter 911, John broke his silence with the publication of his international best seller “ Confessions of an Economic Hit Man.<br />\n” Since then he has been a champion of Amazonian indigenous spiritual culture and environmental movements through his Dream Change and the Pachamama Alliance projects.\n<br />\nJohn’s latest book is “Hoodwinked: Former Economic Hit Man Reveals Why the World Financial Markets Imploded—and How to Remake Them”.<br /></p>\n"
}
