{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "image",
      "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg"
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-061614/",
    "podcast": {
      "developer-note": "",
      "length": "56:33",
      "note": "",
      "size": 13573433,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/fsp9y3/BAR_061414.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2014-06-16 00:00:00 -0600",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Nation’s First All-Charter School System Restores Segregation\n </p>\n\n<p>The last conventional public school in the New<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nOrleans Recovery District closed last month, a harbinger of what may be in store in systems across the country. <br />\n“Apparently, this model means taking education out of the public realm and putting it into the hands of private, non-profit boards and for-profit corporations,” said Karran Harper Royal, a parent advocate with the city’s Coalition for Community Schools, one of several groups that have filed a civil rights suit against the district and the Louisiana Board of Education. <br />\n“It seems that white kids are disproportionately taking up the seats in the A- and B-rated schools,” while Black children are clustered in failing schools, said Ms. <br />\nHarper Royal. <br />\n“After all these years, we’re back in a segregated school system, only now it is also along class lines.<br />\n”</p>\n\n<p>Haiti Activists Urge Rejection of Both Congressional Candidates in Harlem\n </p>\n\n<p>Incumbent Harlem Congressman Charles Rangel and his main challenger, State Sen. <br />\nAdriano Espaillat, are both guilty of supporting “apartheid” policies against Dominicans of Haitian descent, charged demonstrators outside a televised campaign debate. <br />\nUnder a law passed by the Dominican Republic and endorsed by Rangel and Espaillat, less than 10 percent of 200,000-plus people with roots in Haiti will quality for Dominican citizenship, even though most have never set foot outside the country and speak only Spanish. <br />\nDaoud Andre, a Haitian community activist, called on Harlemites “not to vote for either of these supporters of apartheid,” and for “people of conscience around the world to boycott Dominican products and services,” including tourism.\n<br /></p>\n\n<p>Black Is Back Coalition: Obama “Worse Than Bush”\n </p>\n\n<p>Omali Yeshitela, chairman of the Black Is Back Coalition for Social Justice, Peace and Reparations, said Barack Obama has been “worse than Bush” for Black people, and for the cause of peace. <br />\n“Bush couldn’t have gotten away with the things Obama did without some kind of response” from the Black community,” said Yeshitela. <br />\nObama “has neutralized so many forces, taken them out of action. <br />\nIt wasn’t understood that part of Obama’s function was to act as a cover for white power and for imperialism. <br />\nHe’s escalated war, he’s signed off on assassinations, and he’s done it with a neutralized Black community.<br />\n” The Black Is Back Coalition holds its annual international conference in Philadelphia, August 16-17.\n<br /></p>\n\n<p>US Pushes Russia and China into Closer Alliance\n </p>\n\n<p>Washington’s provocations are driving Russia, the world’s top energy exporter, and China, soon to be the world’s largest economy, into a deeper economic and political alliance, said Eric Draitser, of StopImperialism.<br />\norg. <br />\n“It would seem a self-defeating strategy,” said the independent political analyst. <br />\n“But, the reality is that the United States doesn’t have control anymore. <br />\nObama and his blundering foreign policy have provided the impetus” for closer Sino-Russian collaboration, which can only increase with development of a “New Silk Road stretching from China all the way through Turkey and into Europe.<br />\n”</p>\n\n<p>Mumia on the Passing of Ruby Dee\n </p>\n\n<p>Actress and activist Ruby Dee, who died at age 91, supported many radical causes and political prisoners, including Mumia Abu Jamal. <br />\n“One would be hard pressed to find a role where she played anything less than the best of Black people,” said Abu Jamal, in a report for Prison Radio. <br />\nRuby Dee and her late husband Ossie Davis’ “work was a theater of Black dignity, Black family and Black love.”</p>\n\n<p><br /></p>\n"
}
