{
  "header": {
    "category": "leid-stories",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://leidstories.podbean.com/e/leid-stories-110514/",
    "podcast": {
      "developer-note": "",
      "length": "54:23",
      "note": "",
      "size": 19580463,
      "type": "audio/mpeg",
      "url": "http://leidstories.podbean.com/mf/feed/astejf/LeidStories_110514.mp3"
    },
    "show": {
      "category": [
        "Society & Culture"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/547423/Utrice-Leid-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Thu, 12 Mar 2015 21:05:57 +0000",
        "timestamp": "1426212357"
      },
      "subtitle": "Stories and news that affect us all",
      "title": "Leid Stories"
    },
    "tags": [
      "Society & Culture",
      "leid-stories"
    ],
    "title": "Leid Stories"
  },
  "title": "Leid Stories",
  "date": "2014-11-05 00:00:00 -0700",
  "categories": [
    "leid-stories"
  ],
  "content": "<p>Mayoral Recall Issue Claims Activist Battling Corporate Land Grab in Michigan\nThe Day After the Duopoly Settled Scores:<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nWhere Do We Go From Here?\n<br />\n \nFollowing directives from a judge and prosecutor that a person can be convicted without evidence, an all-white jury on the eve of elections stunned residents of the almost all-Black  town of Benton Harbor, Mich.<br />\n, by convicting a leader of an effort to recall the mayor, widely viewed as the henchman for Whirlpool Corporation’s plan to drive them out of the town and take over their land.\n<br />\nThe jury found the Rev. <br />\nEdward Pinkney guilty of five felony counts of voter fraud, saying he changed dates on some of the recall petitions and others were signed more than once. <br />\nBerrien County prosecutor has mentioned the possibility of a maximum life sentence looms for Pinkney at his scheduled sentencing on Dec. <br />\n15.<br />\n The firebrand pastor joins Leid Stories to discuss the verdict and what’s ahead.\n<br />\n \nWell, Selection Day—the day voters elected people they had no part in selecting—is done. <br />\nThe duopoly settled scores; wily, old-guard Republicans gave the smart-set Democrats and President Barack Obama a blistering beatdown, capturing both houses of Congress and a slew of governorships besides. \nLeid Stories’ listeners provide their own analyses of the duopoly’s scorched-earth battle, focusing particularly on implications for alternative political parties and movements.<br /></p>\n"
}
