{
  "header": {
    "category": "alternativevisions",
    "image": {
      "type": "image",
      "url": "http://alternativevisions.podbean.com/mf/web/2sqh9f/Jack-Rasmus-Album-Art.jpg"
    },
    "layout": "podcast",
    "link": "http://alternativevisions.podbean.com/e/alternative-visions-%e2%80%93-union-labor%e2%80%99s-strategic-impasse-an-interview-with-labor-oral-historian-staughton-lynd%e2%80%99-%e2%80%93-041914/",
    "podcast": {
      "developer-note": "",
      "length": "59:05",
      "note": "",
      "size": 14183340,
      "type": "audio/mpeg",
      "url": "http://alternativevisions.podbean.com/mf/feed/qrxbjy/AlternativeVisions_041914.mp3"
    },
    "show": {
      "category": [
        "Technology",
        "Podcasting"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/554419/Jack-Rasmus-Album-Art.jpg",
        "width": 144
      },
      "owner": {
        "email": "jtaubenfeld@garynull.com",
        "name": ""
      },
      "published": {
        "string": "Sat, 14 Feb 2015 19:00:00 +0000",
        "timestamp": "1423958400"
      },
      "subtitle": "Dr. Jack Rasmus will focus on today’s continuing crisis in the U.S. and global economies.",
      "title": "alternativevisions"
    },
    "tags": [
      "Technology",
      "Podcasting",
      "alternativevisions"
    ],
    "title": "Union Labor’s Strategic Impasse: An Interview with Labor Oral-Historian, Staughton Lynd’"
  },
  "title": "Union Labor’s Strategic Impasse: An Interview with Labor Oral-Historian, Staughton Lynd’",
  "date": "2014-04-19 00:00:00 -0400",
  "categories": [
    "alternativevisions"
  ],
  "content": "<p>‘Dr.\n&lt;!--more--&gt;\nRasmus interviews Staughton Lynd, long time oral histories labor historian, as part of the Alternative Vision show’s continuing focus on the subject: ‘Are US Unions At a Strategic Impasse’? <br />\nLynd recounts his oral history interviews with union activists and local leaders in the 1930s-40s and their warnings on the limits of Labor’s then developing strategies that have since become the norm for the past 75 years—ie industrial, bargaining, organizing, and political strategies that now appear in recent years to have exhausted their potential for advancing workers’ wages, benefits, and standard of living in the 21st century. <br />\nBoth Jack and Lynd discuss the  broad ‘legal web’ that has developed the past half century that today have effectively neutralized and defeated past union strategic approaches, as well as prevent internal union renewal ‘from below’. <br />\nCurrent promising movements by low wage workers, immigrant workers, and union reform movements in recent years (ie Chicago teachers, Boeing workers, etc.<br />\n) are considered for their great potential for union renewal. <br />\nBut both Jack and Lynd agree these spontaneous movements will likely atrophy, as in the recent past, unless some form of new union-community permanent organization at the grass roots emerges to break through the ‘legal web’ and internal union organizational roadblocks that prevent union renewal from below today. <br />\nThe ‘Great Task’ is to develop some kind of permanent labor-community organizational network that, according to Lynd,  “doesn’t give away workers freedom of action in order to become a permanent organizational structure that prevents that freedom of action”–as is the case today. <br />\n Lynd agrees to return to the May 3 Alternative Visions show to discuss this view further in his forthcoming new book, ‘Solidarity Unionism’, and Rasmus agrees to update his similar views on the necessity of new ‘labor-community alliance’ organizational forms for the 21st century.”\n<br /></p>\n"
}
