{
  "header": {
    "category": "the-natural-nurse",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://thenaturalnurse.podbean.com/e/the-natural-nurse/",
    "podcast": {
      "developer-note": "",
      "length": "50:22",
      "note": "",
      "size": 12091968,
      "type": "audio/mpeg",
      "url": "http://thenaturalnurse.podbean.com/mf/feed/b872r5/NaturalNurse091911.mp3"
    },
    "show": {
      "category": [
        "Health",
        "Alternative Health"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277785/EllenKamhi_AlbumArt2.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Tue, 10 Feb 2015 21:21:16 +0000",
        "timestamp": "1423621276"
      },
      "subtitle": "Specific information about using evidenced based natural health choices, with knowledgeable authors, guests and hosts.",
      "title": "The Natural Nurse"
    },
    "tags": [
      "Health",
      "Alternative Health",
      "the-natural-nurse"
    ],
    "title": "The Natural Nurse"
  },
  "title": "The Natural Nurse",
  "date": "2011-09-19 00:00:00 -0600",
  "categories": [
    "the-natural-nurse"
  ],
  "content": "<p>Host Ellen Kamhi, PhD RN, www.naturalnurse.com , interviews Dr. Andrew Campbell.\n&lt;!--more--&gt;\nDr Campbell  trained at the OrlandoRegionalMedicalCenter and completed residency at the Medical College of Georgia. <br />\nDr Campbell is fluent in six different languages: English, French, Spanish, Hungarian, German and Arabic. <br />\nHe has served as a consultant to the National Institute of Health, National Institute of Dental Research and the CDC. <br />\nHe is the editor-in-chief of Alternative Therapies in Health and Medicine, and is on the editorial board of medical journals. <br />\n Dr Campbell continues to contribute to the advancement of medical science in the fields of immunology and toxicology, focusing on the toxicity of molds, silicone and chemicals with 48 medical journal publications and chapters in medical books over the last two decades. <br />\nDr Campbell has been recognized by Who’s Who in the World for over a decade and is also recognized for this accomplishments and contributions to the science and medicine in Who’s Who in Medicine and Healthcare. <br />\nDr Campbell has been featured on 20/20, The Montel Williams Show, 24 Hour Investigative News and local channels throughout the United States, Canada and Mexico. <br />\n He has lectured throughout the world on the effects of molds, silicone and other toxins. <br />\nContact: answerwellness@gmail.com\n<br /></p>\n"
}
