{
  "header": {
    "category": "black-agenda-radio",
    "image": {
      "type": "",
      "url": ""
    },
    "layout": "podcast",
    "link": "http://blackagendaradio.podbean.com/e/black-agenda-radio-010515/",
    "podcast": {
      "developer-note": "",
      "length": "56:57",
      "note": "",
      "size": 20502477,
      "type": "audio/mpeg",
      "url": "http://blackagendaradio.podbean.com/mf/feed/r96jmy/BAR010515.mp3"
    },
    "show": {
      "category": [
        "Government & Organizations"
      ],
      "image": {
        "height": 144,
        "url": "http://imglogo.podbean.com/image-logo/277790/BlackAgendaRadio_AlbumArt.jpg",
        "width": 144
      },
      "owner": {
        "email": "karalee@garynull.com",
        "name": "Progressive Radio Network"
      },
      "published": {
        "string": "Mon, 09 Mar 2015 16:00:00 +0000",
        "timestamp": "1425934800"
      },
      "subtitle": "Hosts Glen Ford and Nellie Bailey, veterans of the Freedom Movement’s many permutations and skilled communicators, host a weekly magazine designed to both inform and critique the global movement.",
      "title": "Black Agenda Radio"
    },
    "tags": [
      "Government & Organizations",
      "black-agenda-radio"
    ],
    "title": "Black Agenda Radio"
  },
  "title": "Black Agenda Radio",
  "date": "2015-01-05 00:00:00 -0700",
  "categories": [
    "black-agenda-radio"
  ],
  "content": "<p>Michael Brown’s Killer Indicted by Black People’s Grand Jury\nAfter two days of investigation and deliberations, a Black<span class=\"ellipsis\">...</span>\n&lt;!--more--&gt;\nPeople’s Grand Jury handed down a first degree murder indictment against former Ferguson, Missouri, policeman Darren Wilson in the death of teenager Michael Brown. <br />\nFour Black prosecutors presented evidence to the 12 St. <br />\nLouis County residents, who also drew on the records of the mostly white official grand jury that failed to indict Wilson in November. <br />\n“Darren Wilson is a killer, but he’s not out there by himself,” said lead people’s prosecutor Omali Yeshitela, chairman of the International People’s Democratic Uhuru Movement. <br />\n“Somebody made the decision to leave the body there for 4 ½ hours” in the blazing August heat. <br />\nDarren Wilson “has been rewarded with almost a million dollars by white people. <br />\nThe problem is institutional, and this grand jury is more capable of understanding that” than the one that was seated and manipulated by St. <br />\nLouis prosecutor Bob McCulloch.\n<br />\nAn Awakening People\nDr Anthony Monteiro, the lifelong activist and former professor of African American Studies at Temple University, said young Black people are “awakening. <br />\nThey’re getting a sense of their power and what they can do without any corporate-designated leaders. <br />\nAnd, once they’ve seen that, they’re going to connect the killing of Black people by the police to the economic and social crisis that engulfs the country.<br />\n” Dr Monteiro was fired from his post at Temple for his political activism.\n<br />\nBeyond Issues of Brutality: Social Transformation\n“What we’re seeing is the radicalization of a new generation,” said Ajamu Baraka, an editor and columnist for Black Agenda Report and fellow at the Institute for Policy Studies. <br />\nThrough struggle, Black youth will learn that “what is absolutely required is a fundamental transformation of social relationships, and of the entire structure of oppression in this country.<br />\n” Baraka was a co-founder of the US Human Rights Network.\n<br />\nAmerica’s “Unworthy Victims”\nActivist scholar Paul Street, author of the recent article, “Worthy and Unworthy Victims: From Vietnam and Iraq to Ferguson and New York,” said the United States lauds its soldiers and cops as saints. <br />\nThe message is: “They’re policing the world and keeping chaos at bay; they’re nobly sacrificing themselves for the common good.” Meanwhile, “the folks on the other end of our guns” die in far greater numbers: millions killed in Vietnam and Iraq and untold numbers murdered under color of law in the “homeland.”<br /></p>\n"
}
